/**
 * @author GuoMengwen
 */
var cityData={
    hot: [
        {
            'pid': 110000,
            'pname': '北京市',
            'id': 110000,
            'name': '北京市'
        }, {
            'pid': 310000,
            'pname': '上海市',
            'id': 310000,
            'name': '上海市'
        },
        {
            'pid': 440000,
            'pname': '广东省',
            'id': 440100,
            'name': '广州市'
        },
        {
            'pid': 330000,
            'pname': '浙江省',
            'id': 330100,
            'name': '杭州市'
        },
        {
            'pid': 440000,
            'pname': '广东省',
            'id': 440300,
            'name': '深圳市'
        }
  ],
  "province"  :  [
    {
      "id"  :  "110000",
      "name"  :  "北京市",
      "city"  :  [
        {
          "id"  :  "110101",
          "name"  :  "东城区"
        },
        {
          "id"  :  "110102",
          "name"  :  "西城区"
        },
        {
          "id"  :  "110105",
          "name"  :  "朝阳区"
        },
        {
          "id"  :  "110106",
          "name"  :  "丰台区"
        },
        {
          "id"  :  "110107",
          "name"  :  "石景山区"
        },
        {
          "id"  :  "110108",
          "name"  :  "海淀区"
        },
        {
          "id"  :  "110109",
          "name"  :  "门头沟区"
        },
        {
          "id"  :  "110111",
          "name"  :  "房山区"
        },
        {
          "id"  :  "110112",
          "name"  :  "通州区"
        },
        {
          "id"  :  "110113",
          "name"  :  "顺义区"
        },
        {
          "id"  :  "110114",
          "name"  :  "昌平区"
        },
        {
          "id"  :  "110115",
          "name"  :  "大兴区"
        },
        {
          "id"  :  "110116",
          "name"  :  "怀柔区"
        },
        {
          "id"  :  "110117",
          "name"  :  "平谷区"
        },
        {
          "id"  :  "110228",
          "name"  :  "密云县"
        },
        {
          "id"  :  "110229",
          "name"  :  "延庆县"
        }
      ]
    },
    {
      "id"  :  "120000",
      "name"  :  "天津市",
      "city"  :  [
        {
          "id"  :  "120101",
          "name"  :  "和平区"
        },
        {
          "id"  :  "120102",
          "name"  :  "河东区"
        },
        {
          "id"  :  "120103",
          "name"  :  "河西区"
        },
        {
          "id"  :  "120104",
          "name"  :  "南开区"
        },
        {
          "id"  :  "120105",
          "name"  :  "河北区"
        },
        {
          "id"  :  "120106",
          "name"  :  "红桥区"
        },
        {
          "id"  :  "120110",
          "name"  :  "东丽区"
        },
        {
          "id"  :  "120111",
          "name"  :  "西青区"
        },
        {
          "id"  :  "120112",
          "name"  :  "津南区"
        },
        {
          "id"  :  "120113",
          "name"  :  "北辰区"
        },
        {
          "id"  :  "120114",
          "name"  :  "武清区"
        },
        {
          "id"  :  "120115",
          "name"  :  "宝坻区"
        },
        {
          "id"  :  "120116",
          "name"  :  "滨海新区"
        },
        {
          "id"  :  "120221",
          "name"  :  "宁河县"
        },
        {
          "id"  :  "120223",
          "name"  :  "静海县"
        },
        {
          "id"  :  "120225",
          "name"  :  "蓟县"
        }
      ]
    },
    {
      "id"  :  "130000",
      "name"  :  "河北省",
      "city"  :  [
        {
          "id"  :  "130100",
          "name"  :  "石家庄市",
          "area"  :  [
            {
              "id"  :  "130102",
              "name"  :  "长安区"
            },
            {
              "id"  :  "130103",
              "name"  :  "桥东区"
            },
            {
              "id"  :  "130104",
              "name"  :  "桥西区"
            },
            {
              "id"  :  "130105",
              "name"  :  "新华区"
            },
            {
              "id"  :  "130107",
              "name"  :  "井陉矿区"
            },
            {
              "id"  :  "130108",
              "name"  :  "裕华区"
            },
            {
              "id"  :  "130121",
              "name"  :  "井陉县"
            },
            {
              "id"  :  "130123",
              "name"  :  "正定县"
            },
            {
              "id"  :  "130124",
              "name"  :  "栾城县"
            },
            {
              "id"  :  "130125",
              "name"  :  "行唐县"
            },
            {
              "id"  :  "130126",
              "name"  :  "灵寿县"
            },
            {
              "id"  :  "130127",
              "name"  :  "高邑县"
            },
            {
              "id"  :  "130128",
              "name"  :  "深泽县"
            },
            {
              "id"  :  "130129",
              "name"  :  "赞皇县"
            },
            {
              "id"  :  "130130",
              "name"  :  "无极县"
            },
            {
              "id"  :  "130131",
              "name"  :  "平山县"
            },
            {
              "id"  :  "130132",
              "name"  :  "元氏县"
            },
            {
              "id"  :  "130133",
              "name"  :  "赵县"
            },
            {
              "id"  :  "130181",
              "name"  :  "辛集市"
            },
            {
              "id"  :  "130182",
              "name"  :  "藁城市"
            },
            {
              "id"  :  "130183",
              "name"  :  "晋州市"
            },
            {
              "id"  :  "130184",
              "name"  :  "新乐市"
            },
            {
              "id"  :  "130185",
              "name"  :  "鹿泉市"
            }
          ]
        },
        {
          "id"  :  "130200",
          "name"  :  "唐山市",
          "area"  :  [
            {
              "id"  :  "130202",
              "name"  :  "路南区"
            },
            {
              "id"  :  "130203",
              "name"  :  "路北区"
            },
            {
              "id"  :  "130204",
              "name"  :  "古冶区"
            },
            {
              "id"  :  "130205",
              "name"  :  "开平区"
            },
            {
              "id"  :  "130207",
              "name"  :  "丰南区"
            },
            {
              "id"  :  "130208",
              "name"  :  "丰润区"
            },
            {
              "id"  :  "130223",
              "name"  :  "滦县"
            },
            {
              "id"  :  "130224",
              "name"  :  "滦南县"
            },
            {
              "id"  :  "130225",
              "name"  :  "乐亭县"
            },
            {
              "id"  :  "130227",
              "name"  :  "迁西县"
            },
            {
              "id"  :  "130229",
              "name"  :  "玉田县"
            },
            {
              "id"  :  "130230",
              "name"  :  "曹妃甸区"
            },
            {
              "id"  :  "130281",
              "name"  :  "遵化市"
            },
            {
              "id"  :  "130283",
              "name"  :  "迁安市"
            }
          ]
        },
        {
          "id"  :  "130300",
          "name"  :  "秦皇岛市",
          "area"  :  [
            {
              "id"  :  "130302",
              "name"  :  "海港区"
            },
            {
              "id"  :  "130303",
              "name"  :  "山海关区"
            },
            {
              "id"  :  "130304",
              "name"  :  "北戴河区"
            },
            {
              "id"  :  "130321",
              "name"  :  "青龙满族自治县"
            },
            {
              "id"  :  "130322",
              "name"  :  "昌黎县"
            },
            {
              "id"  :  "130323",
              "name"  :  "抚宁县"
            },
            {
              "id"  :  "130324",
              "name"  :  "卢龙县"
            }
          ]
        },
        {
          "id"  :  "130400",
          "name"  :  "邯郸市",
          "area"  :  [
            {
              "id"  :  "130402",
              "name"  :  "邯山区"
            },
            {
              "id"  :  "130403",
              "name"  :  "丛台区"
            },
            {
              "id"  :  "130404",
              "name"  :  "复兴区"
            },
            {
              "id"  :  "130406",
              "name"  :  "峰峰矿区"
            },
            {
              "id"  :  "130421",
              "name"  :  "邯郸县"
            },
            {
              "id"  :  "130423",
              "name"  :  "临漳县"
            },
            {
              "id"  :  "130424",
              "name"  :  "成安县"
            },
            {
              "id"  :  "130425",
              "name"  :  "大名县"
            },
            {
              "id"  :  "130426",
              "name"  :  "涉县"
            },
            {
              "id"  :  "130427",
              "name"  :  "磁县"
            },
            {
              "id"  :  "130428",
              "name"  :  "肥乡县"
            },
            {
              "id"  :  "130429",
              "name"  :  "永年县"
            },
            {
              "id"  :  "130430",
              "name"  :  "邱县"
            },
            {
              "id"  :  "130431",
              "name"  :  "鸡泽县"
            },
            {
              "id"  :  "130432",
              "name"  :  "广平县"
            },
            {
              "id"  :  "130433",
              "name"  :  "馆陶县"
            },
            {
              "id"  :  "130434",
              "name"  :  "魏县"
            },
            {
              "id"  :  "130435",
              "name"  :  "曲周县"
            },
            {
              "id"  :  "130481",
              "name"  :  "武安市"
            }
          ]
        },
        {
          "id"  :  "130500",
          "name"  :  "邢台市",
          "area"  :  [
            {
              "id"  :  "130502",
              "name"  :  "桥东区"
            },
            {
              "id"  :  "130503",
              "name"  :  "桥西区"
            },
            {
              "id"  :  "130521",
              "name"  :  "邢台县"
            },
            {
              "id"  :  "130522",
              "name"  :  "临城县"
            },
            {
              "id"  :  "130523",
              "name"  :  "内丘县"
            },
            {
              "id"  :  "130524",
              "name"  :  "柏乡县"
            },
            {
              "id"  :  "130525",
              "name"  :  "隆尧县"
            },
            {
              "id"  :  "130526",
              "name"  :  "任县"
            },
            {
              "id"  :  "130527",
              "name"  :  "南和县"
            },
            {
              "id"  :  "130528",
              "name"  :  "宁晋县"
            },
            {
              "id"  :  "130529",
              "name"  :  "巨鹿县"
            },
            {
              "id"  :  "130530",
              "name"  :  "新河县"
            },
            {
              "id"  :  "130531",
              "name"  :  "广宗县"
            },
            {
              "id"  :  "130532",
              "name"  :  "平乡县"
            },
            {
              "id"  :  "130533",
              "name"  :  "威县"
            },
            {
              "id"  :  "130534",
              "name"  :  "清河县"
            },
            {
              "id"  :  "130535",
              "name"  :  "临西县"
            },
            {
              "id"  :  "130581",
              "name"  :  "南宫市"
            },
            {
              "id"  :  "130582",
              "name"  :  "沙河市"
            }
          ]
        },
        {
          "id"  :  "130600",
          "name"  :  "保定市",
          "area"  :  [
            {
              "id"  :  "130602",
              "name"  :  "新市区"
            },
            {
              "id"  :  "130603",
              "name"  :  "北市区"
            },
            {
              "id"  :  "130604",
              "name"  :  "南市区"
            },
            {
              "id"  :  "130621",
              "name"  :  "满城县"
            },
            {
              "id"  :  "130622",
              "name"  :  "清苑县"
            },
            {
              "id"  :  "130623",
              "name"  :  "涞水县"
            },
            {
              "id"  :  "130624",
              "name"  :  "阜平县"
            },
            {
              "id"  :  "130625",
              "name"  :  "徐水县"
            },
            {
              "id"  :  "130626",
              "name"  :  "定兴县"
            },
            {
              "id"  :  "130627",
              "name"  :  "唐县"
            },
            {
              "id"  :  "130628",
              "name"  :  "高阳县"
            },
            {
              "id"  :  "130629",
              "name"  :  "容城县"
            },
            {
              "id"  :  "130630",
              "name"  :  "涞源县"
            },
            {
              "id"  :  "130631",
              "name"  :  "望都县"
            },
            {
              "id"  :  "130632",
              "name"  :  "安新县"
            },
            {
              "id"  :  "130633",
              "name"  :  "易县"
            },
            {
              "id"  :  "130634",
              "name"  :  "曲阳县"
            },
            {
              "id"  :  "130635",
              "name"  :  "蠡县"
            },
            {
              "id"  :  "130636",
              "name"  :  "顺平县"
            },
            {
              "id"  :  "130637",
              "name"  :  "博野县"
            },
            {
              "id"  :  "130638",
              "name"  :  "雄县"
            },
            {
              "id"  :  "130681",
              "name"  :  "涿州市"
            },
            {
              "id"  :  "130682",
              "name"  :  "定州市"
            },
            {
              "id"  :  "130683",
              "name"  :  "安国市"
            },
            {
              "id"  :  "130684",
              "name"  :  "高碑店市"
            }
          ]
        },
        {
          "id"  :  "130700",
          "name"  :  "张家口市",
          "area"  :  [
            {
              "id"  :  "130702",
              "name"  :  "桥东区"
            },
            {
              "id"  :  "130703",
              "name"  :  "桥西区"
            },
            {
              "id"  :  "130705",
              "name"  :  "宣化区"
            },
            {
              "id"  :  "130706",
              "name"  :  "下花园区"
            },
            {
              "id"  :  "130721",
              "name"  :  "宣化县"
            },
            {
              "id"  :  "130722",
              "name"  :  "张北县"
            },
            {
              "id"  :  "130723",
              "name"  :  "康保县"
            },
            {
              "id"  :  "130724",
              "name"  :  "沽源县"
            },
            {
              "id"  :  "130725",
              "name"  :  "尚义县"
            },
            {
              "id"  :  "130726",
              "name"  :  "蔚县"
            },
            {
              "id"  :  "130727",
              "name"  :  "阳原县"
            },
            {
              "id"  :  "130728",
              "name"  :  "怀安县"
            },
            {
              "id"  :  "130729",
              "name"  :  "万全县"
            },
            {
              "id"  :  "130730",
              "name"  :  "怀来县"
            },
            {
              "id"  :  "130731",
              "name"  :  "涿鹿县"
            },
            {
              "id"  :  "130732",
              "name"  :  "赤城县"
            },
            {
              "id"  :  "130733",
              "name"  :  "崇礼县"
            }
          ]
        },
        {
          "id"  :  "130800",
          "name"  :  "承德市",
          "area"  :  [
            {
              "id"  :  "130802",
              "name"  :  "双桥区"
            },
            {
              "id"  :  "130803",
              "name"  :  "双滦区"
            },
            {
              "id"  :  "130804",
              "name"  :  "鹰手营子矿区"
            },
            {
              "id"  :  "130821",
              "name"  :  "承德县"
            },
            {
              "id"  :  "130822",
              "name"  :  "兴隆县"
            },
            {
              "id"  :  "130823",
              "name"  :  "平泉县"
            },
            {
              "id"  :  "130824",
              "name"  :  "滦平县"
            },
            {
              "id"  :  "130825",
              "name"  :  "隆化县"
            },
            {
              "id"  :  "130826",
              "name"  :  "丰宁满族自治县"
            },
            {
              "id"  :  "130827",
              "name"  :  "宽城满族自治县"
            },
            {
              "id"  :  "130828",
              "name"  :  "围场满族蒙古族自治县"
            }
          ]
        },
        {
          "id"  :  "130900",
          "name"  :  "沧州市",
          "area"  :  [
            {
              "id"  :  "130902",
              "name"  :  "新华区"
            },
            {
              "id"  :  "130903",
              "name"  :  "运河区"
            },
            {
              "id"  :  "130921",
              "name"  :  "沧县"
            },
            {
              "id"  :  "130922",
              "name"  :  "青县"
            },
            {
              "id"  :  "130923",
              "name"  :  "东光县"
            },
            {
              "id"  :  "130924",
              "name"  :  "海兴县"
            },
            {
              "id"  :  "130925",
              "name"  :  "盐山县"
            },
            {
              "id"  :  "130926",
              "name"  :  "肃宁县"
            },
            {
              "id"  :  "130927",
              "name"  :  "南皮县"
            },
            {
              "id"  :  "130928",
              "name"  :  "吴桥县"
            },
            {
              "id"  :  "130929",
              "name"  :  "献县"
            },
            {
              "id"  :  "130930",
              "name"  :  "孟村回族自治县"
            },
            {
              "id"  :  "130981",
              "name"  :  "泊头市"
            },
            {
              "id"  :  "130982",
              "name"  :  "任丘市"
            },
            {
              "id"  :  "130983",
              "name"  :  "黄骅市"
            },
            {
              "id"  :  "130984",
              "name"  :  "河间市"
            }
          ]
        },
        {
          "id"  :  "131000",
          "name"  :  "廊坊市",
          "area"  :  [
            {
              "id"  :  "131002",
              "name"  :  "安次区"
            },
            {
              "id"  :  "131003",
              "name"  :  "广阳区"
            },
            {
              "id"  :  "131022",
              "name"  :  "固安县"
            },
            {
              "id"  :  "131023",
              "name"  :  "永清县"
            },
            {
              "id"  :  "131024",
              "name"  :  "香河县"
            },
            {
              "id"  :  "131025",
              "name"  :  "大城县"
            },
            {
              "id"  :  "131026",
              "name"  :  "文安县"
            },
            {
              "id"  :  "131028",
              "name"  :  "大厂回族自治县"
            },
            {
              "id"  :  "131081",
              "name"  :  "霸州市"
            },
            {
              "id"  :  "131082",
              "name"  :  "三河市"
            }
          ]
        },
        {
          "id"  :  "131100",
          "name"  :  "衡水市",
          "area"  :  [
            {
              "id"  :  "131102",
              "name"  :  "桃城区"
            },
            {
              "id"  :  "131121",
              "name"  :  "枣强县"
            },
            {
              "id"  :  "131122",
              "name"  :  "武邑县"
            },
            {
              "id"  :  "131123",
              "name"  :  "武强县"
            },
            {
              "id"  :  "131124",
              "name"  :  "饶阳县"
            },
            {
              "id"  :  "131125",
              "name"  :  "安平县"
            },
            {
              "id"  :  "131126",
              "name"  :  "故城县"
            },
            {
              "id"  :  "131127",
              "name"  :  "景县"
            },
            {
              "id"  :  "131128",
              "name"  :  "阜城县"
            },
            {
              "id"  :  "131181",
              "name"  :  "冀州市"
            },
            {
              "id"  :  "131182",
              "name"  :  "深州市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "140000",
      "name"  :  "山西省",
      "city"  :  [
        {
          "id"  :  "140100",
          "name"  :  "太原市",
          "area"  :  [
            {
              "id"  :  "140105",
              "name"  :  "小店区"
            },
            {
              "id"  :  "140106",
              "name"  :  "迎泽区"
            },
            {
              "id"  :  "140107",
              "name"  :  "杏花岭区"
            },
            {
              "id"  :  "140108",
              "name"  :  "尖草坪区"
            },
            {
              "id"  :  "140109",
              "name"  :  "万柏林区"
            },
            {
              "id"  :  "140110",
              "name"  :  "晋源区"
            },
            {
              "id"  :  "140121",
              "name"  :  "清徐县"
            },
            {
              "id"  :  "140122",
              "name"  :  "阳曲县"
            },
            {
              "id"  :  "140123",
              "name"  :  "娄烦县"
            },
            {
              "id"  :  "140181",
              "name"  :  "古交市"
            }
          ]
        },
        {
          "id"  :  "140200",
          "name"  :  "大同市",
          "area"  :  [
            {
              "id"  :  "140202",
              "name"  :  "城区"
            },
            {
              "id"  :  "140203",
              "name"  :  "矿区"
            },
            {
              "id"  :  "140211",
              "name"  :  "南郊区"
            },
            {
              "id"  :  "140212",
              "name"  :  "新荣区"
            },
            {
              "id"  :  "140221",
              "name"  :  "阳高县"
            },
            {
              "id"  :  "140222",
              "name"  :  "天镇县"
            },
            {
              "id"  :  "140223",
              "name"  :  "广灵县"
            },
            {
              "id"  :  "140224",
              "name"  :  "灵丘县"
            },
            {
              "id"  :  "140225",
              "name"  :  "浑源县"
            },
            {
              "id"  :  "140226",
              "name"  :  "左云县"
            },
            {
              "id"  :  "140227",
              "name"  :  "大同县"
            }
          ]
        },
        {
          "id"  :  "140300",
          "name"  :  "阳泉市",
          "area"  :  [
            {
              "id"  :  "140302",
              "name"  :  "城区"
            },
            {
              "id"  :  "140303",
              "name"  :  "矿区"
            },
            {
              "id"  :  "140311",
              "name"  :  "郊区"
            },
            {
              "id"  :  "140321",
              "name"  :  "平定县"
            },
            {
              "id"  :  "140322",
              "name"  :  "盂县"
            }
          ]
        },
        {
          "id"  :  "140400",
          "name"  :  "长治市",
          "area"  :  [
            {
              "id"  :  "140402",
              "name"  :  "城区"
            },
            {
              "id"  :  "140411",
              "name"  :  "郊区"
            },
            {
              "id"  :  "140421",
              "name"  :  "长治县"
            },
            {
              "id"  :  "140423",
              "name"  :  "襄垣县"
            },
            {
              "id"  :  "140424",
              "name"  :  "屯留县"
            },
            {
              "id"  :  "140425",
              "name"  :  "平顺县"
            },
            {
              "id"  :  "140426",
              "name"  :  "黎城县"
            },
            {
              "id"  :  "140427",
              "name"  :  "壶关县"
            },
            {
              "id"  :  "140428",
              "name"  :  "长子县"
            },
            {
              "id"  :  "140429",
              "name"  :  "武乡县"
            },
            {
              "id"  :  "140430",
              "name"  :  "沁县"
            },
            {
              "id"  :  "140431",
              "name"  :  "沁源县"
            },
            {
              "id"  :  "140481",
              "name"  :  "潞城市"
            }
          ]
        },
        {
          "id"  :  "140500",
          "name"  :  "晋城市",
          "area"  :  [
            {
              "id"  :  "140502",
              "name"  :  "城区"
            },
            {
              "id"  :  "140521",
              "name"  :  "沁水县"
            },
            {
              "id"  :  "140522",
              "name"  :  "阳城县"
            },
            {
              "id"  :  "140524",
              "name"  :  "陵川县"
            },
            {
              "id"  :  "140525",
              "name"  :  "泽州县"
            },
            {
              "id"  :  "140581",
              "name"  :  "高平市"
            }
          ]
        },
        {
          "id"  :  "140600",
          "name"  :  "朔州市",
          "area"  :  [
            {
              "id"  :  "140602",
              "name"  :  "朔城区"
            },
            {
              "id"  :  "140603",
              "name"  :  "平鲁区"
            },
            {
              "id"  :  "140621",
              "name"  :  "山阴县"
            },
            {
              "id"  :  "140622",
              "name"  :  "应县"
            },
            {
              "id"  :  "140623",
              "name"  :  "右玉县"
            },
            {
              "id"  :  "140624",
              "name"  :  "怀仁县"
            }
          ]
        },
        {
          "id"  :  "140700",
          "name"  :  "晋中市",
          "area"  :  [
            {
              "id"  :  "140702",
              "name"  :  "榆次区"
            },
            {
              "id"  :  "140721",
              "name"  :  "榆社县"
            },
            {
              "id"  :  "140722",
              "name"  :  "左权县"
            },
            {
              "id"  :  "140723",
              "name"  :  "和顺县"
            },
            {
              "id"  :  "140724",
              "name"  :  "昔阳县"
            },
            {
              "id"  :  "140725",
              "name"  :  "寿阳县"
            },
            {
              "id"  :  "140726",
              "name"  :  "太谷县"
            },
            {
              "id"  :  "140727",
              "name"  :  "祁县"
            },
            {
              "id"  :  "140728",
              "name"  :  "平遥县"
            },
            {
              "id"  :  "140729",
              "name"  :  "灵石县"
            },
            {
              "id"  :  "140781",
              "name"  :  "介休市"
            }
          ]
        },
        {
          "id"  :  "140800",
          "name"  :  "运城市",
          "area"  :  [
            {
              "id"  :  "140802",
              "name"  :  "盐湖区"
            },
            {
              "id"  :  "140821",
              "name"  :  "临猗县"
            },
            {
              "id"  :  "140822",
              "name"  :  "万荣县"
            },
            {
              "id"  :  "140823",
              "name"  :  "闻喜县"
            },
            {
              "id"  :  "140824",
              "name"  :  "稷山县"
            },
            {
              "id"  :  "140825",
              "name"  :  "新绛县"
            },
            {
              "id"  :  "140826",
              "name"  :  "绛县"
            },
            {
              "id"  :  "140827",
              "name"  :  "垣曲县"
            },
            {
              "id"  :  "140828",
              "name"  :  "夏县"
            },
            {
              "id"  :  "140829",
              "name"  :  "平陆县"
            },
            {
              "id"  :  "140830",
              "name"  :  "芮城县"
            },
            {
              "id"  :  "140881",
              "name"  :  "永济市"
            },
            {
              "id"  :  "140882",
              "name"  :  "河津市"
            }
          ]
        },
        {
          "id"  :  "140900",
          "name"  :  "忻州市",
          "area"  :  [
            {
              "id"  :  "140902",
              "name"  :  "忻府区"
            },
            {
              "id"  :  "140921",
              "name"  :  "定襄县"
            },
            {
              "id"  :  "140922",
              "name"  :  "五台县"
            },
            {
              "id"  :  "140923",
              "name"  :  "代县"
            },
            {
              "id"  :  "140924",
              "name"  :  "繁峙县"
            },
            {
              "id"  :  "140925",
              "name"  :  "宁武县"
            },
            {
              "id"  :  "140926",
              "name"  :  "静乐县"
            },
            {
              "id"  :  "140927",
              "name"  :  "神池县"
            },
            {
              "id"  :  "140928",
              "name"  :  "五寨县"
            },
            {
              "id"  :  "140929",
              "name"  :  "岢岚县"
            },
            {
              "id"  :  "140930",
              "name"  :  "河曲县"
            },
            {
              "id"  :  "140931",
              "name"  :  "保德县"
            },
            {
              "id"  :  "140932",
              "name"  :  "偏关县"
            },
            {
              "id"  :  "140981",
              "name"  :  "原平市"
            }
          ]
        },
        {
          "id"  :  "141000",
          "name"  :  "临汾市",
          "area"  :  [
            {
              "id"  :  "141002",
              "name"  :  "尧都区"
            },
            {
              "id"  :  "141021",
              "name"  :  "曲沃县"
            },
            {
              "id"  :  "141022",
              "name"  :  "翼城县"
            },
            {
              "id"  :  "141023",
              "name"  :  "襄汾县"
            },
            {
              "id"  :  "141024",
              "name"  :  "洪洞县"
            },
            {
              "id"  :  "141025",
              "name"  :  "古县"
            },
            {
              "id"  :  "141026",
              "name"  :  "安泽县"
            },
            {
              "id"  :  "141027",
              "name"  :  "浮山县"
            },
            {
              "id"  :  "141028",
              "name"  :  "吉县"
            },
            {
              "id"  :  "141029",
              "name"  :  "乡宁县"
            },
            {
              "id"  :  "141030",
              "name"  :  "大宁县"
            },
            {
              "id"  :  "141031",
              "name"  :  "隰县"
            },
            {
              "id"  :  "141032",
              "name"  :  "永和县"
            },
            {
              "id"  :  "141033",
              "name"  :  "蒲县"
            },
            {
              "id"  :  "141034",
              "name"  :  "汾西县"
            },
            {
              "id"  :  "141081",
              "name"  :  "侯马市"
            },
            {
              "id"  :  "141082",
              "name"  :  "霍州市"
            }
          ]
        },
        {
          "id"  :  "141100",
          "name"  :  "吕梁市",
          "area"  :  [
            {
              "id"  :  "141102",
              "name"  :  "离石区"
            },
            {
              "id"  :  "141121",
              "name"  :  "文水县"
            },
            {
              "id"  :  "141122",
              "name"  :  "交城县"
            },
            {
              "id"  :  "141123",
              "name"  :  "兴县"
            },
            {
              "id"  :  "141124",
              "name"  :  "临县"
            },
            {
              "id"  :  "141125",
              "name"  :  "柳林县"
            },
            {
              "id"  :  "141126",
              "name"  :  "石楼县"
            },
            {
              "id"  :  "141127",
              "name"  :  "岚县"
            },
            {
              "id"  :  "141128",
              "name"  :  "方山县"
            },
            {
              "id"  :  "141129",
              "name"  :  "中阳县"
            },
            {
              "id"  :  "141130",
              "name"  :  "交口县"
            },
            {
              "id"  :  "141181",
              "name"  :  "孝义市"
            },
            {
              "id"  :  "141182",
              "name"  :  "汾阳市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "150000",
      "name"  :  "内蒙古自治区",
      "city"  :  [
        {
          "id"  :  "150100",
          "name"  :  "呼和浩特市",
          "area"  :  [
            {
              "id"  :  "150102",
              "name"  :  "新城区"
            },
            {
              "id"  :  "150103",
              "name"  :  "回民区"
            },
            {
              "id"  :  "150104",
              "name"  :  "玉泉区"
            },
            {
              "id"  :  "150105",
              "name"  :  "赛罕区"
            },
            {
              "id"  :  "150121",
              "name"  :  "土默特左旗"
            },
            {
              "id"  :  "150122",
              "name"  :  "托克托县"
            },
            {
              "id"  :  "150123",
              "name"  :  "和林格尔县"
            },
            {
              "id"  :  "150124",
              "name"  :  "清水河县"
            },
            {
              "id"  :  "150125",
              "name"  :  "武川县"
            }
          ]
        },
        {
          "id"  :  "150200",
          "name"  :  "包头市",
          "area"  :  [
            {
              "id"  :  "150202",
              "name"  :  "东河区"
            },
            {
              "id"  :  "150203",
              "name"  :  "昆都仑区"
            },
            {
              "id"  :  "150204",
              "name"  :  "青山区"
            },
            {
              "id"  :  "150205",
              "name"  :  "石拐区"
            },
            {
              "id"  :  "150206",
              "name"  :  "白云鄂博矿区"
            },
            {
              "id"  :  "150207",
              "name"  :  "九原区"
            },
            {
              "id"  :  "150221",
              "name"  :  "土默特右旗"
            },
            {
              "id"  :  "150222",
              "name"  :  "固阳县"
            },
            {
              "id"  :  "150223",
              "name"  :  "达尔罕茂明安联合旗"
            }
          ]
        },
        {
          "id"  :  "150300",
          "name"  :  "乌海市",
          "area"  :  [
            {
              "id"  :  "150302",
              "name"  :  "海勃湾区"
            },
            {
              "id"  :  "150303",
              "name"  :  "海南区"
            },
            {
              "id"  :  "150304",
              "name"  :  "乌达区"
            }
          ]
        },
        {
          "id"  :  "150400",
          "name"  :  "赤峰市",
          "area"  :  [
            {
              "id"  :  "150402",
              "name"  :  "红山区"
            },
            {
              "id"  :  "150403",
              "name"  :  "元宝山区"
            },
            {
              "id"  :  "150404",
              "name"  :  "松山区"
            },
            {
              "id"  :  "150421",
              "name"  :  "阿鲁科尔沁旗"
            },
            {
              "id"  :  "150422",
              "name"  :  "巴林左旗"
            },
            {
              "id"  :  "150423",
              "name"  :  "巴林右旗"
            },
            {
              "id"  :  "150424",
              "name"  :  "林西县"
            },
            {
              "id"  :  "150425",
              "name"  :  "克什克腾旗"
            },
            {
              "id"  :  "150426",
              "name"  :  "翁牛特旗"
            },
            {
              "id"  :  "150428",
              "name"  :  "喀喇沁旗"
            },
            {
              "id"  :  "150429",
              "name"  :  "宁城县"
            },
            {
              "id"  :  "150430",
              "name"  :  "敖汉旗"
            }
          ]
        },
        {
          "id"  :  "150500",
          "name"  :  "通辽市",
          "area"  :  [
            {
              "id"  :  "150502",
              "name"  :  "科尔沁区"
            },
            {
              "id"  :  "150521",
              "name"  :  "科尔沁左翼中旗"
            },
            {
              "id"  :  "150522",
              "name"  :  "科尔沁左翼后旗"
            },
            {
              "id"  :  "150523",
              "name"  :  "开鲁县"
            },
            {
              "id"  :  "150524",
              "name"  :  "库伦旗"
            },
            {
              "id"  :  "150525",
              "name"  :  "奈曼旗"
            },
            {
              "id"  :  "150526",
              "name"  :  "扎鲁特旗"
            },
            {
              "id"  :  "150581",
              "name"  :  "霍林郭勒市"
            }
          ]
        },
        {
          "id"  :  "150600",
          "name"  :  "鄂尔多斯市",
          "area"  :  [
            {
              "id"  :  "150602",
              "name"  :  "东胜区"
            },
            {
              "id"  :  "150621",
              "name"  :  "达拉特旗"
            },
            {
              "id"  :  "150622",
              "name"  :  "准格尔旗"
            },
            {
              "id"  :  "150623",
              "name"  :  "鄂托克前旗"
            },
            {
              "id"  :  "150624",
              "name"  :  "鄂托克旗"
            },
            {
              "id"  :  "150625",
              "name"  :  "杭锦旗"
            },
            {
              "id"  :  "150626",
              "name"  :  "乌审旗"
            },
            {
              "id"  :  "150627",
              "name"  :  "伊金霍洛旗"
            }
          ]
        },
        {
          "id"  :  "150700",
          "name"  :  "呼伦贝尔市",
          "area"  :  [
            {
              "id"  :  "150702",
              "name"  :  "海拉尔区"
            },
            {
              "id"  :  "150721",
              "name"  :  "阿荣旗"
            },
            {
              "id"  :  "150722",
              "name"  :  "莫力达瓦达斡尔族自治旗"
            },
            {
              "id"  :  "150723",
              "name"  :  "鄂伦春自治旗"
            },
            {
              "id"  :  "150724",
              "name"  :  "鄂温克族自治旗"
            },
            {
              "id"  :  "150725",
              "name"  :  "陈巴尔虎旗"
            },
            {
              "id"  :  "150726",
              "name"  :  "新巴尔虎左旗"
            },
            {
              "id"  :  "150727",
              "name"  :  "新巴尔虎右旗"
            },
            {
              "id"  :  "150781",
              "name"  :  "满洲里市"
            },
            {
              "id"  :  "150782",
              "name"  :  "牙克石市"
            },
            {
              "id"  :  "150783",
              "name"  :  "扎兰屯市"
            },
            {
              "id"  :  "150784",
              "name"  :  "额尔古纳市"
            },
            {
              "id"  :  "150785",
              "name"  :  "根河市"
            }
          ]
        },
        {
          "id"  :  "150800",
          "name"  :  "巴彦淖尔市",
          "area"  :  [
            {
              "id"  :  "150802",
              "name"  :  "临河区"
            },
            {
              "id"  :  "150821",
              "name"  :  "五原县"
            },
            {
              "id"  :  "150822",
              "name"  :  "磴口县"
            },
            {
              "id"  :  "150823",
              "name"  :  "乌拉特前旗"
            },
            {
              "id"  :  "150824",
              "name"  :  "乌拉特中旗"
            },
            {
              "id"  :  "150825",
              "name"  :  "乌拉特后旗"
            },
            {
              "id"  :  "150826",
              "name"  :  "杭锦后旗"
            }
          ]
        },
        {
          "id"  :  "150900",
          "name"  :  "乌兰察布市",
          "area"  :  [
            {
              "id"  :  "150902",
              "name"  :  "集宁区"
            },
            {
              "id"  :  "150921",
              "name"  :  "卓资县"
            },
            {
              "id"  :  "150922",
              "name"  :  "化德县"
            },
            {
              "id"  :  "150923",
              "name"  :  "商都县"
            },
            {
              "id"  :  "150924",
              "name"  :  "兴和县"
            },
            {
              "id"  :  "150925",
              "name"  :  "凉城县"
            },
            {
              "id"  :  "150926",
              "name"  :  "察哈尔右翼前旗"
            },
            {
              "id"  :  "150927",
              "name"  :  "察哈尔右翼中旗"
            },
            {
              "id"  :  "150928",
              "name"  :  "察哈尔右翼后旗"
            },
            {
              "id"  :  "150929",
              "name"  :  "四子王旗"
            },
            {
              "id"  :  "150981",
              "name"  :  "丰镇市"
            }
          ]
        },
        {
          "id"  :  "152200",
          "name"  :  "兴安盟",
          "area"  :  [
            {
              "id"  :  "152201",
              "name"  :  "乌兰浩特市"
            },
            {
              "id"  :  "152202",
              "name"  :  "阿尔山市"
            },
            {
              "id"  :  "152221",
              "name"  :  "科尔沁右翼前旗"
            },
            {
              "id"  :  "152222",
              "name"  :  "科尔沁右翼中旗"
            },
            {
              "id"  :  "152223",
              "name"  :  "扎赉特旗"
            },
            {
              "id"  :  "152224",
              "name"  :  "突泉县"
            }
          ]
        },
        {
          "id"  :  "152500",
          "name"  :  "锡林郭勒盟",
          "area"  :  [
            {
              "id"  :  "152501",
              "name"  :  "二连浩特市"
            },
            {
              "id"  :  "152502",
              "name"  :  "锡林浩特市"
            },
            {
              "id"  :  "152522",
              "name"  :  "阿巴嘎旗"
            },
            {
              "id"  :  "152523",
              "name"  :  "苏尼特左旗"
            },
            {
              "id"  :  "152524",
              "name"  :  "苏尼特右旗"
            },
            {
              "id"  :  "152525",
              "name"  :  "东乌珠穆沁旗"
            },
            {
              "id"  :  "152526",
              "name"  :  "西乌珠穆沁旗"
            },
            {
              "id"  :  "152527",
              "name"  :  "太仆寺旗"
            },
            {
              "id"  :  "152528",
              "name"  :  "镶黄旗"
            },
            {
              "id"  :  "152529",
              "name"  :  "正镶白旗"
            },
            {
              "id"  :  "152530",
              "name"  :  "正蓝旗"
            },
            {
              "id"  :  "152531",
              "name"  :  "多伦县"
            }
          ]
        },
        {
          "id"  :  "152900",
          "name"  :  "阿拉善盟",
          "area"  :  [
            {
              "id"  :  "152921",
              "name"  :  "阿拉善左旗"
            },
            {
              "id"  :  "152922",
              "name"  :  "阿拉善右旗"
            },
            {
              "id"  :  "152923",
              "name"  :  "额济纳旗"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "210000",
      "name"  :  "辽宁省",
      "city"  :  [
        {
          "id"  :  "210100",
          "name"  :  "沈阳市",
          "area"  :  [
            {
              "id"  :  "210102",
              "name"  :  "和平区"
            },
            {
              "id"  :  "210103",
              "name"  :  "沈河区"
            },
            {
              "id"  :  "210104",
              "name"  :  "大东区"
            },
            {
              "id"  :  "210105",
              "name"  :  "皇姑区"
            },
            {
              "id"  :  "210106",
              "name"  :  "铁西区"
            },
            {
              "id"  :  "210111",
              "name"  :  "苏家屯区"
            },
            {
              "id"  :  "210112",
              "name"  :  "东陵区"
            },
            {
              "id"  :  "210113",
              "name"  :  "沈北新区"
            },
            {
              "id"  :  "210114",
              "name"  :  "于洪区"
            },
            {
              "id"  :  "210122",
              "name"  :  "辽中县"
            },
            {
              "id"  :  "210123",
              "name"  :  "康平县"
            },
            {
              "id"  :  "210124",
              "name"  :  "法库县"
            },
            {
              "id"  :  "210181",
              "name"  :  "新民市"
            }
          ]
        },
        {
          "id"  :  "210200",
          "name"  :  "大连市",
          "area"  :  [
            {
              "id"  :  "210202",
              "name"  :  "中山区"
            },
            {
              "id"  :  "210203",
              "name"  :  "西岗区"
            },
            {
              "id"  :  "210204",
              "name"  :  "沙河口区"
            },
            {
              "id"  :  "210211",
              "name"  :  "甘井子区"
            },
            {
              "id"  :  "210212",
              "name"  :  "旅顺口区"
            },
            {
              "id"  :  "210213",
              "name"  :  "金州区"
            },
            {
              "id"  :  "210224",
              "name"  :  "长海县"
            },
            {
              "id"  :  "210281",
              "name"  :  "瓦房店市"
            },
            {
              "id"  :  "210282",
              "name"  :  "普兰店市"
            },
            {
              "id"  :  "210283",
              "name"  :  "庄河市"
            }
          ]
        },
        {
          "id"  :  "210300",
          "name"  :  "鞍山市",
          "area"  :  [
            {
              "id"  :  "210302",
              "name"  :  "铁东区"
            },
            {
              "id"  :  "210303",
              "name"  :  "铁西区"
            },
            {
              "id"  :  "210304",
              "name"  :  "立山区"
            },
            {
              "id"  :  "210311",
              "name"  :  "千山区"
            },
            {
              "id"  :  "210321",
              "name"  :  "台安县"
            },
            {
              "id"  :  "210323",
              "name"  :  "岫岩满族自治县"
            },
            {
              "id"  :  "210381",
              "name"  :  "海城市"
            }
          ]
        },
        {
          "id"  :  "210400",
          "name"  :  "抚顺市",
          "area"  :  [
            {
              "id"  :  "210402",
              "name"  :  "新抚区"
            },
            {
              "id"  :  "210403",
              "name"  :  "东洲区"
            },
            {
              "id"  :  "210404",
              "name"  :  "望花区"
            },
            {
              "id"  :  "210411",
              "name"  :  "顺城区"
            },
            {
              "id"  :  "210421",
              "name"  :  "抚顺县"
            },
            {
              "id"  :  "210422",
              "name"  :  "新宾满族自治县"
            },
            {
              "id"  :  "210423",
              "name"  :  "清原满族自治县"
            }
          ]
        },
        {
          "id"  :  "210500",
          "name"  :  "本溪市",
          "area"  :  [
            {
              "id"  :  "210502",
              "name"  :  "平山区"
            },
            {
              "id"  :  "210503",
              "name"  :  "溪湖区"
            },
            {
              "id"  :  "210504",
              "name"  :  "明山区"
            },
            {
              "id"  :  "210505",
              "name"  :  "南芬区"
            },
            {
              "id"  :  "210521",
              "name"  :  "本溪满族自治县"
            },
            {
              "id"  :  "210522",
              "name"  :  "桓仁满族自治县"
            }
          ]
        },
        {
          "id"  :  "210600",
          "name"  :  "丹东市",
          "area"  :  [
            {
              "id"  :  "210602",
              "name"  :  "元宝区"
            },
            {
              "id"  :  "210603",
              "name"  :  "振兴区"
            },
            {
              "id"  :  "210604",
              "name"  :  "振安区"
            },
            {
              "id"  :  "210624",
              "name"  :  "宽甸满族自治县"
            },
            {
              "id"  :  "210681",
              "name"  :  "东港市"
            },
            {
              "id"  :  "210682",
              "name"  :  "凤城市"
            }
          ]
        },
        {
          "id"  :  "210700",
          "name"  :  "锦州市",
          "area"  :  [
            {
              "id"  :  "210702",
              "name"  :  "古塔区"
            },
            {
              "id"  :  "210703",
              "name"  :  "凌河区"
            },
            {
              "id"  :  "210711",
              "name"  :  "太和区"
            },
            {
              "id"  :  "210726",
              "name"  :  "黑山县"
            },
            {
              "id"  :  "210727",
              "name"  :  "义县"
            },
            {
              "id"  :  "210781",
              "name"  :  "凌海市"
            },
            {
              "id"  :  "210782",
              "name"  :  "北镇市"
            }
          ]
        },
        {
          "id"  :  "210800",
          "name"  :  "营口市",
          "area"  :  [
            {
              "id"  :  "210802",
              "name"  :  "站前区"
            },
            {
              "id"  :  "210803",
              "name"  :  "西市区"
            },
            {
              "id"  :  "210804",
              "name"  :  "鲅鱼圈区"
            },
            {
              "id"  :  "210811",
              "name"  :  "老边区"
            },
            {
              "id"  :  "210881",
              "name"  :  "盖州市"
            },
            {
              "id"  :  "210882",
              "name"  :  "大石桥市"
            }
          ]
        },
        {
          "id"  :  "210900",
          "name"  :  "阜新市",
          "area"  :  [
            {
              "id"  :  "210902",
              "name"  :  "海州区"
            },
            {
              "id"  :  "210903",
              "name"  :  "新邱区"
            },
            {
              "id"  :  "210904",
              "name"  :  "太平区"
            },
            {
              "id"  :  "210905",
              "name"  :  "清河门区"
            },
            {
              "id"  :  "210911",
              "name"  :  "细河区"
            },
            {
              "id"  :  "210921",
              "name"  :  "阜新蒙古族自治县"
            },
            {
              "id"  :  "210922",
              "name"  :  "彰武县"
            }
          ]
        },
        {
          "id"  :  "211000",
          "name"  :  "辽阳市",
          "area"  :  [
            {
              "id"  :  "211002",
              "name"  :  "白塔区"
            },
            {
              "id"  :  "211003",
              "name"  :  "文圣区"
            },
            {
              "id"  :  "211004",
              "name"  :  "宏伟区"
            },
            {
              "id"  :  "211005",
              "name"  :  "弓长岭区"
            },
            {
              "id"  :  "211011",
              "name"  :  "太子河区"
            },
            {
              "id"  :  "211021",
              "name"  :  "辽阳县"
            },
            {
              "id"  :  "211081",
              "name"  :  "灯塔市"
            }
          ]
        },
        {
          "id"  :  "211100",
          "name"  :  "盘锦市",
          "area"  :  [
            {
              "id"  :  "211102",
              "name"  :  "双台子区"
            },
            {
              "id"  :  "211103",
              "name"  :  "兴隆台区"
            },
            {
              "id"  :  "211121",
              "name"  :  "大洼县"
            },
            {
              "id"  :  "211122",
              "name"  :  "盘山县"
            }
          ]
        },
        {
          "id"  :  "211200",
          "name"  :  "铁岭市",
          "area"  :  [
            {
              "id"  :  "211202",
              "name"  :  "银州区"
            },
            {
              "id"  :  "211204",
              "name"  :  "清河区"
            },
            {
              "id"  :  "211221",
              "name"  :  "铁岭县"
            },
            {
              "id"  :  "211223",
              "name"  :  "西丰县"
            },
            {
              "id"  :  "211224",
              "name"  :  "昌图县"
            },
            {
              "id"  :  "211281",
              "name"  :  "调兵山市"
            },
            {
              "id"  :  "211282",
              "name"  :  "开原市"
            }
          ]
        },
        {
          "id"  :  "211300",
          "name"  :  "朝阳市",
          "area"  :  [
            {
              "id"  :  "211302",
              "name"  :  "双塔区"
            },
            {
              "id"  :  "211303",
              "name"  :  "龙城区"
            },
            {
              "id"  :  "211321",
              "name"  :  "朝阳县"
            },
            {
              "id"  :  "211322",
              "name"  :  "建平县"
            },
            {
              "id"  :  "211324",
              "name"  :  "喀喇沁左翼蒙古族自治县"
            },
            {
              "id"  :  "211381",
              "name"  :  "北票市"
            },
            {
              "id"  :  "211382",
              "name"  :  "凌源市"
            }
          ]
        },
        {
          "id"  :  "211400",
          "name"  :  "葫芦岛市",
          "area"  :  [
            {
              "id"  :  "211402",
              "name"  :  "连山区"
            },
            {
              "id"  :  "211403",
              "name"  :  "龙港区"
            },
            {
              "id"  :  "211404",
              "name"  :  "南票区"
            },
            {
              "id"  :  "211421",
              "name"  :  "绥中县"
            },
            {
              "id"  :  "211422",
              "name"  :  "建昌县"
            },
            {
              "id"  :  "211481",
              "name"  :  "兴城市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "220000",
      "name"  :  "吉林省",
      "city"  :  [
        {
          "id"  :  "220100",
          "name"  :  "长春市",
          "area"  :  [
            {
              "id"  :  "220102",
              "name"  :  "南关区"
            },
            {
              "id"  :  "220103",
              "name"  :  "宽城区"
            },
            {
              "id"  :  "220104",
              "name"  :  "朝阳区"
            },
            {
              "id"  :  "220105",
              "name"  :  "二道区"
            },
            {
              "id"  :  "220106",
              "name"  :  "绿园区"
            },
            {
              "id"  :  "220112",
              "name"  :  "双阳区"
            },
            {
              "id"  :  "220122",
              "name"  :  "农安县"
            },
            {
              "id"  :  "220181",
              "name"  :  "九台市"
            },
            {
              "id"  :  "220182",
              "name"  :  "榆树市"
            },
            {
              "id"  :  "220183",
              "name"  :  "德惠市"
            }
          ]
        },
        {
          "id"  :  "220200",
          "name"  :  "吉林市",
          "area"  :  [
            {
              "id"  :  "220202",
              "name"  :  "昌邑区"
            },
            {
              "id"  :  "220203",
              "name"  :  "龙潭区"
            },
            {
              "id"  :  "220204",
              "name"  :  "船营区"
            },
            {
              "id"  :  "220211",
              "name"  :  "丰满区"
            },
            {
              "id"  :  "220221",
              "name"  :  "永吉县"
            },
            {
              "id"  :  "220281",
              "name"  :  "蛟河市"
            },
            {
              "id"  :  "220282",
              "name"  :  "桦甸市"
            },
            {
              "id"  :  "220283",
              "name"  :  "舒兰市"
            },
            {
              "id"  :  "220284",
              "name"  :  "磐石市"
            }
          ]
        },
        {
          "id"  :  "220300",
          "name"  :  "四平市",
          "area"  :  [
            {
              "id"  :  "220302",
              "name"  :  "铁西区"
            },
            {
              "id"  :  "220303",
              "name"  :  "铁东区"
            },
            {
              "id"  :  "220322",
              "name"  :  "梨树县"
            },
            {
              "id"  :  "220323",
              "name"  :  "伊通满族自治县"
            },
            {
              "id"  :  "220381",
              "name"  :  "公主岭市"
            },
            {
              "id"  :  "220382",
              "name"  :  "双辽市"
            }
          ]
        },
        {
          "id"  :  "220400",
          "name"  :  "辽源市",
          "area"  :  [
            {
              "id"  :  "220402",
              "name"  :  "龙山区"
            },
            {
              "id"  :  "220403",
              "name"  :  "西安区"
            },
            {
              "id"  :  "220421",
              "name"  :  "东丰县"
            },
            {
              "id"  :  "220422",
              "name"  :  "东辽县"
            }
          ]
        },
        {
          "id"  :  "220500",
          "name"  :  "通化市",
          "area"  :  [
            {
              "id"  :  "220502",
              "name"  :  "东昌区"
            },
            {
              "id"  :  "220503",
              "name"  :  "二道江区"
            },
            {
              "id"  :  "220521",
              "name"  :  "通化县"
            },
            {
              "id"  :  "220523",
              "name"  :  "辉南县"
            },
            {
              "id"  :  "220524",
              "name"  :  "柳河县"
            },
            {
              "id"  :  "220581",
              "name"  :  "梅河口市"
            },
            {
              "id"  :  "220582",
              "name"  :  "集安市"
            }
          ]
        },
        {
          "id"  :  "220600",
          "name"  :  "白山市",
          "area"  :  [
            {
              "id"  :  "220602",
              "name"  :  "浑江区"
            },
            {
              "id"  :  "220605",
              "name"  :  "江源区"
            },
            {
              "id"  :  "220621",
              "name"  :  "抚松县"
            },
            {
              "id"  :  "220622",
              "name"  :  "靖宇县"
            },
            {
              "id"  :  "220623",
              "name"  :  "长白朝鲜族自治县"
            },
            {
              "id"  :  "220681",
              "name"  :  "临江市"
            }
          ]
        },
        {
          "id"  :  "220700",
          "name"  :  "松原市",
          "area"  :  [
            {
              "id"  :  "220702",
              "name"  :  "宁江区"
            },
            {
              "id"  :  "220721",
              "name"  :  "前郭尔罗斯蒙古族自治县"
            },
            {
              "id"  :  "220722",
              "name"  :  "长岭县"
            },
            {
              "id"  :  "220723",
              "name"  :  "乾安县"
            },
            {
              "id"  :  "220724",
              "name"  :  "扶余县"
            }
          ]
        },
        {
          "id"  :  "220800",
          "name"  :  "白城市",
          "area"  :  [
            {
              "id"  :  "220802",
              "name"  :  "洮北区"
            },
            {
              "id"  :  "220821",
              "name"  :  "镇赉县"
            },
            {
              "id"  :  "220822",
              "name"  :  "通榆县"
            },
            {
              "id"  :  "220881",
              "name"  :  "洮南市"
            },
            {
              "id"  :  "220882",
              "name"  :  "大安市"
            }
          ]
        },
        {
          "id"  :  "222400",
          "name"  :  "延边朝鲜族自治州",
          "area"  :  [
            {
              "id"  :  "222401",
              "name"  :  "延吉市"
            },
            {
              "id"  :  "222402",
              "name"  :  "图们市"
            },
            {
              "id"  :  "222403",
              "name"  :  "敦化市"
            },
            {
              "id"  :  "222404",
              "name"  :  "珲春市"
            },
            {
              "id"  :  "222405",
              "name"  :  "龙井市"
            },
            {
              "id"  :  "222406",
              "name"  :  "和龙市"
            },
            {
              "id"  :  "222424",
              "name"  :  "汪清县"
            },
            {
              "id"  :  "222426",
              "name"  :  "安图县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "230000",
      "name"  :  "黑龙江省",
      "city"  :  [
        {
          "id"  :  "230100",
          "name"  :  "哈尔滨市",
          "area"  :  [
            {
              "id"  :  "230102",
              "name"  :  "道里区"
            },
            {
              "id"  :  "230103",
              "name"  :  "南岗区"
            },
            {
              "id"  :  "230104",
              "name"  :  "道外区"
            },
            {
              "id"  :  "230108",
              "name"  :  "平房区"
            },
            {
              "id"  :  "230109",
              "name"  :  "松北区"
            },
            {
              "id"  :  "230110",
              "name"  :  "香坊区"
            },
            {
              "id"  :  "230111",
              "name"  :  "呼兰区"
            },
            {
              "id"  :  "230112",
              "name"  :  "阿城区"
            },
            {
              "id"  :  "230123",
              "name"  :  "依兰县"
            },
            {
              "id"  :  "230124",
              "name"  :  "方正县"
            },
            {
              "id"  :  "230125",
              "name"  :  "宾县"
            },
            {
              "id"  :  "230126",
              "name"  :  "巴彦县"
            },
            {
              "id"  :  "230127",
              "name"  :  "木兰县"
            },
            {
              "id"  :  "230128",
              "name"  :  "通河县"
            },
            {
              "id"  :  "230129",
              "name"  :  "延寿县"
            },
            {
              "id"  :  "230182",
              "name"  :  "双城市"
            },
            {
              "id"  :  "230183",
              "name"  :  "尚志市"
            },
            {
              "id"  :  "230184",
              "name"  :  "五常市"
            }
          ]
        },
        {
          "id"  :  "230200",
          "name"  :  "齐齐哈尔市",
          "area"  :  [
            {
              "id"  :  "230202",
              "name"  :  "龙沙区"
            },
            {
              "id"  :  "230203",
              "name"  :  "建华区"
            },
            {
              "id"  :  "230204",
              "name"  :  "铁锋区"
            },
            {
              "id"  :  "230205",
              "name"  :  "昂昂溪区"
            },
            {
              "id"  :  "230206",
              "name"  :  "富拉尔基区"
            },
            {
              "id"  :  "230207",
              "name"  :  "碾子山区"
            },
            {
              "id"  :  "230208",
              "name"  :  "梅里斯达斡尔族区"
            },
            {
              "id"  :  "230221",
              "name"  :  "龙江县"
            },
            {
              "id"  :  "230223",
              "name"  :  "依安县"
            },
            {
              "id"  :  "230224",
              "name"  :  "泰来县"
            },
            {
              "id"  :  "230225",
              "name"  :  "甘南县"
            },
            {
              "id"  :  "230227",
              "name"  :  "富裕县"
            },
            {
              "id"  :  "230229",
              "name"  :  "克山县"
            },
            {
              "id"  :  "230230",
              "name"  :  "克东县"
            },
            {
              "id"  :  "230231",
              "name"  :  "拜泉县"
            },
            {
              "id"  :  "230281",
              "name"  :  "讷河市"
            }
          ]
        },
        {
          "id"  :  "230300",
          "name"  :  "鸡西市",
          "area"  :  [
            {
              "id"  :  "230302",
              "name"  :  "鸡冠区"
            },
            {
              "id"  :  "230303",
              "name"  :  "恒山区"
            },
            {
              "id"  :  "230304",
              "name"  :  "滴道区"
            },
            {
              "id"  :  "230305",
              "name"  :  "梨树区"
            },
            {
              "id"  :  "230306",
              "name"  :  "城子河区"
            },
            {
              "id"  :  "230307",
              "name"  :  "麻山区"
            },
            {
              "id"  :  "230321",
              "name"  :  "鸡东县"
            },
            {
              "id"  :  "230381",
              "name"  :  "虎林市"
            },
            {
              "id"  :  "230382",
              "name"  :  "密山市"
            }
          ]
        },
        {
          "id"  :  "230400",
          "name"  :  "鹤岗市",
          "area"  :  [
            {
              "id"  :  "230402",
              "name"  :  "向阳区"
            },
            {
              "id"  :  "230403",
              "name"  :  "工农区"
            },
            {
              "id"  :  "230404",
              "name"  :  "南山区"
            },
            {
              "id"  :  "230405",
              "name"  :  "兴安区"
            },
            {
              "id"  :  "230406",
              "name"  :  "东山区"
            },
            {
              "id"  :  "230407",
              "name"  :  "兴山区"
            },
            {
              "id"  :  "230421",
              "name"  :  "萝北县"
            },
            {
              "id"  :  "230422",
              "name"  :  "绥滨县"
            }
          ]
        },
        {
          "id"  :  "230500",
          "name"  :  "双鸭山市",
          "area"  :  [
            {
              "id"  :  "230502",
              "name"  :  "尖山区"
            },
            {
              "id"  :  "230503",
              "name"  :  "岭东区"
            },
            {
              "id"  :  "230505",
              "name"  :  "四方台区"
            },
            {
              "id"  :  "230506",
              "name"  :  "宝山区"
            },
            {
              "id"  :  "230521",
              "name"  :  "集贤县"
            },
            {
              "id"  :  "230522",
              "name"  :  "友谊县"
            },
            {
              "id"  :  "230523",
              "name"  :  "宝清县"
            },
            {
              "id"  :  "230524",
              "name"  :  "饶河县"
            }
          ]
        },
        {
          "id"  :  "230600",
          "name"  :  "大庆市",
          "area"  :  [
            {
              "id"  :  "230602",
              "name"  :  "萨尔图区"
            },
            {
              "id"  :  "230603",
              "name"  :  "龙凤区"
            },
            {
              "id"  :  "230604",
              "name"  :  "让胡路区"
            },
            {
              "id"  :  "230605",
              "name"  :  "红岗区"
            },
            {
              "id"  :  "230606",
              "name"  :  "大同区"
            },
            {
              "id"  :  "230621",
              "name"  :  "肇州县"
            },
            {
              "id"  :  "230622",
              "name"  :  "肇源县"
            },
            {
              "id"  :  "230623",
              "name"  :  "林甸县"
            },
            {
              "id"  :  "230624",
              "name"  :  "杜尔伯特蒙古族自治县"
            }
          ]
        },
        {
          "id"  :  "230700",
          "name"  :  "伊春市",
          "area"  :  [
            {
              "id"  :  "230702",
              "name"  :  "伊春区"
            },
            {
              "id"  :  "230703",
              "name"  :  "南岔区"
            },
            {
              "id"  :  "230704",
              "name"  :  "友好区"
            },
            {
              "id"  :  "230705",
              "name"  :  "西林区"
            },
            {
              "id"  :  "230706",
              "name"  :  "翠峦区"
            },
            {
              "id"  :  "230707",
              "name"  :  "新青区"
            },
            {
              "id"  :  "230708",
              "name"  :  "美溪区"
            },
            {
              "id"  :  "230709",
              "name"  :  "金山屯区"
            },
            {
              "id"  :  "230710",
              "name"  :  "五营区"
            },
            {
              "id"  :  "230711",
              "name"  :  "乌马河区"
            },
            {
              "id"  :  "230712",
              "name"  :  "汤旺河区"
            },
            {
              "id"  :  "230713",
              "name"  :  "带岭区"
            },
            {
              "id"  :  "230714",
              "name"  :  "乌伊岭区"
            },
            {
              "id"  :  "230715",
              "name"  :  "红星区"
            },
            {
              "id"  :  "230716",
              "name"  :  "上甘岭区"
            },
            {
              "id"  :  "230722",
              "name"  :  "嘉荫县"
            },
            {
              "id"  :  "230781",
              "name"  :  "铁力市"
            }
          ]
        },
        {
          "id"  :  "230800",
          "name"  :  "佳木斯市",
          "area"  :  [
            {
              "id"  :  "230803",
              "name"  :  "向阳区"
            },
            {
              "id"  :  "230804",
              "name"  :  "前进区"
            },
            {
              "id"  :  "230805",
              "name"  :  "东风区"
            },
            {
              "id"  :  "230811",
              "name"  :  "郊区"
            },
            {
              "id"  :  "230822",
              "name"  :  "桦南县"
            },
            {
              "id"  :  "230826",
              "name"  :  "桦川县"
            },
            {
              "id"  :  "230828",
              "name"  :  "汤原县"
            },
            {
              "id"  :  "230833",
              "name"  :  "抚远县"
            },
            {
              "id"  :  "230881",
              "name"  :  "同江市"
            },
            {
              "id"  :  "230882",
              "name"  :  "富锦市"
            }
          ]
        },
        {
          "id"  :  "230900",
          "name"  :  "七台河市",
          "area"  :  [
            {
              "id"  :  "230902",
              "name"  :  "新兴区"
            },
            {
              "id"  :  "230903",
              "name"  :  "桃山区"
            },
            {
              "id"  :  "230904",
              "name"  :  "茄子河区"
            },
            {
              "id"  :  "230921",
              "name"  :  "勃利县"
            }
          ]
        },
        {
          "id"  :  "231000",
          "name"  :  "牡丹江市",
          "area"  :  [
            {
              "id"  :  "231002",
              "name"  :  "东安区"
            },
            {
              "id"  :  "231003",
              "name"  :  "阳明区"
            },
            {
              "id"  :  "231004",
              "name"  :  "爱民区"
            },
            {
              "id"  :  "231005",
              "name"  :  "西安区"
            },
            {
              "id"  :  "231024",
              "name"  :  "东宁县"
            },
            {
              "id"  :  "231025",
              "name"  :  "林口县"
            },
            {
              "id"  :  "231081",
              "name"  :  "绥芬河市"
            },
            {
              "id"  :  "231083",
              "name"  :  "海林市"
            },
            {
              "id"  :  "231084",
              "name"  :  "宁安市"
            },
            {
              "id"  :  "231085",
              "name"  :  "穆棱市"
            }
          ]
        },
        {
          "id"  :  "231100",
          "name"  :  "黑河市",
          "area"  :  [
            {
              "id"  :  "231102",
              "name"  :  "爱辉区"
            },
            {
              "id"  :  "231121",
              "name"  :  "嫩江县"
            },
            {
              "id"  :  "231123",
              "name"  :  "逊克县"
            },
            {
              "id"  :  "231124",
              "name"  :  "孙吴县"
            },
            {
              "id"  :  "231181",
              "name"  :  "北安市"
            },
            {
              "id"  :  "231182",
              "name"  :  "五大连池市"
            }
          ]
        },
        {
          "id"  :  "231200",
          "name"  :  "绥化市",
          "area"  :  [
            {
              "id"  :  "231202",
              "name"  :  "北林区"
            },
            {
              "id"  :  "231221",
              "name"  :  "望奎县"
            },
            {
              "id"  :  "231222",
              "name"  :  "兰西县"
            },
            {
              "id"  :  "231223",
              "name"  :  "青冈县"
            },
            {
              "id"  :  "231224",
              "name"  :  "庆安县"
            },
            {
              "id"  :  "231225",
              "name"  :  "明水县"
            },
            {
              "id"  :  "231226",
              "name"  :  "绥棱县"
            },
            {
              "id"  :  "231281",
              "name"  :  "安达市"
            },
            {
              "id"  :  "231282",
              "name"  :  "肇东市"
            },
            {
              "id"  :  "231283",
              "name"  :  "海伦市"
            }
          ]
        },
        {
          "id"  :  "232700",
          "name"  :  "大兴安岭地区",
          "area"  :  [
            {
              "id"  :  "232701",
              "name"  :  "加格达奇区"
            },
            {
              "id"  :  "232702",
              "name"  :  "松岭区"
            },
            {
              "id"  :  "232703",
              "name"  :  "新林区"
            },
            {
              "id"  :  "232704",
              "name"  :  "呼中区"
            },
            {
              "id"  :  "232721",
              "name"  :  "呼玛县"
            },
            {
              "id"  :  "232722",
              "name"  :  "塔河县"
            },
            {
              "id"  :  "232723",
              "name"  :  "漠河县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "310000",
      "name"  :  "上海市",
      "city"  :  [
        {
          "id"  :  "310101",
          "name"  :  "黄浦区"
        },
        {
          "id"  :  "310104",
          "name"  :  "徐汇区"
        },
        {
          "id"  :  "310105",
          "name"  :  "长宁区"
        },
        {
          "id"  :  "310106",
          "name"  :  "静安区"
        },
        {
          "id"  :  "310107",
          "name"  :  "普陀区"
        },
        {
          "id"  :  "310108",
          "name"  :  "闸北区"
        },
        {
          "id"  :  "310109",
          "name"  :  "虹口区"
        },
        {
          "id"  :  "310110",
          "name"  :  "杨浦区"
        },
        {
          "id"  :  "310112",
          "name"  :  "闵行区"
        },
        {
          "id"  :  "310113",
          "name"  :  "宝山区"
        },
        {
          "id"  :  "310114",
          "name"  :  "嘉定区"
        },
        {
          "id"  :  "310115",
          "name"  :  "浦东新区"
        },
        {
          "id"  :  "310116",
          "name"  :  "金山区"
        },
        {
          "id"  :  "310117",
          "name"  :  "松江区"
        },
        {
          "id"  :  "310118",
          "name"  :  "青浦区"
        },
        {
          "id"  :  "310120",
          "name"  :  "奉贤区"
        },
        {
          "id"  :  "310230",
          "name"  :  "崇明县"
        }
      ]
    },
    {
      "id"  :  "320000",
      "name"  :  "江苏省",
      "city"  :  [
        {
          "id"  :  "320100",
          "name"  :  "南京市",
          "area"  :  [
            {
              "id"  :  "320102",
              "name"  :  "玄武区"
            },
            {
              "id"  :  "320103",
              "name"  :  "白下区"
            },
            {
              "id"  :  "320104",
              "name"  :  "秦淮区"
            },
            {
              "id"  :  "320105",
              "name"  :  "建邺区"
            },
            {
              "id"  :  "320106",
              "name"  :  "鼓楼区"
            },
            {
              "id"  :  "320107",
              "name"  :  "下关区"
            },
            {
              "id"  :  "320111",
              "name"  :  "浦口区"
            },
            {
              "id"  :  "320113",
              "name"  :  "栖霞区"
            },
            {
              "id"  :  "320114",
              "name"  :  "雨花台区"
            },
            {
              "id"  :  "320115",
              "name"  :  "江宁区"
            },
            {
              "id"  :  "320116",
              "name"  :  "六合区"
            },
            {
              "id"  :  "320124",
              "name"  :  "溧水县"
            },
            {
              "id"  :  "320125",
              "name"  :  "高淳县"
            }
          ]
        },
        {
          "id"  :  "320200",
          "name"  :  "无锡市",
          "area"  :  [
            {
              "id"  :  "320202",
              "name"  :  "崇安区"
            },
            {
              "id"  :  "320203",
              "name"  :  "南长区"
            },
            {
              "id"  :  "320204",
              "name"  :  "北塘区"
            },
            {
              "id"  :  "320205",
              "name"  :  "锡山区"
            },
            {
              "id"  :  "320206",
              "name"  :  "惠山区"
            },
            {
              "id"  :  "320211",
              "name"  :  "滨湖区"
            },
            {
              "id"  :  "320281",
              "name"  :  "江阴市"
            },
            {
              "id"  :  "320282",
              "name"  :  "宜兴市"
            }
          ]
        },
        {
          "id"  :  "320300",
          "name"  :  "徐州市",
          "area"  :  [
            {
              "id"  :  "320302",
              "name"  :  "鼓楼区"
            },
            {
              "id"  :  "320303",
              "name"  :  "云龙区"
            },
            {
              "id"  :  "320305",
              "name"  :  "贾汪区"
            },
            {
              "id"  :  "320311",
              "name"  :  "泉山区"
            },
            {
              "id"  :  "320312",
              "name"  :  "铜山区"
            },
            {
              "id"  :  "320321",
              "name"  :  "丰县"
            },
            {
              "id"  :  "320322",
              "name"  :  "沛县"
            },
            {
              "id"  :  "320324",
              "name"  :  "睢宁县"
            },
            {
              "id"  :  "320381",
              "name"  :  "新沂市"
            },
            {
              "id"  :  "320382",
              "name"  :  "邳州市"
            }
          ]
        },
        {
          "id"  :  "320400",
          "name"  :  "常州市",
          "area"  :  [
            {
              "id"  :  "320402",
              "name"  :  "天宁区"
            },
            {
              "id"  :  "320404",
              "name"  :  "钟楼区"
            },
            {
              "id"  :  "320405",
              "name"  :  "戚墅堰区"
            },
            {
              "id"  :  "320411",
              "name"  :  "新北区"
            },
            {
              "id"  :  "320412",
              "name"  :  "武进区"
            },
            {
              "id"  :  "320481",
              "name"  :  "溧阳市"
            },
            {
              "id"  :  "320482",
              "name"  :  "金坛市"
            }
          ]
        },
        {
          "id"  :  "320500",
          "name"  :  "苏州市",
          "area"  :  [
            {
              "id"  :  "320503",
              "name"  :  "姑苏区"
            },
            {
              "id"  :  "320505",
              "name"  :  "虎丘区"
            },
            {
              "id"  :  "320506",
              "name"  :  "吴中区"
            },
            {
              "id"  :  "320507",
              "name"  :  "相城区"
            },
            {
              "id"  :  "320581",
              "name"  :  "常熟市"
            },
            {
              "id"  :  "320582",
              "name"  :  "张家港市"
            },
            {
              "id"  :  "320583",
              "name"  :  "昆山市"
            },
            {
              "id"  :  "320584",
              "name"  :  "吴江区"
            },
            {
              "id"  :  "320585",
              "name"  :  "太仓市"
            }
          ]
        },
        {
          "id"  :  "320600",
          "name"  :  "南通市",
          "area"  :  [
            {
              "id"  :  "320602",
              "name"  :  "崇川区"
            },
            {
              "id"  :  "320611",
              "name"  :  "港闸区"
            },
            {
              "id"  :  "320612",
              "name"  :  "通州区"
            },
            {
              "id"  :  "320621",
              "name"  :  "海安县"
            },
            {
              "id"  :  "320623",
              "name"  :  "如东县"
            },
            {
              "id"  :  "320681",
              "name"  :  "启东市"
            },
            {
              "id"  :  "320682",
              "name"  :  "如皋市"
            },
            {
              "id"  :  "320684",
              "name"  :  "海门市"
            }
          ]
        },
        {
          "id"  :  "320700",
          "name"  :  "连云港市",
          "area"  :  [
            {
              "id"  :  "320703",
              "name"  :  "连云区"
            },
            {
              "id"  :  "320705",
              "name"  :  "新浦区"
            },
            {
              "id"  :  "320706",
              "name"  :  "海州区"
            },
            {
              "id"  :  "320721",
              "name"  :  "赣榆县"
            },
            {
              "id"  :  "320722",
              "name"  :  "东海县"
            },
            {
              "id"  :  "320723",
              "name"  :  "灌云县"
            },
            {
              "id"  :  "320724",
              "name"  :  "灌南县"
            }
          ]
        },
        {
          "id"  :  "320800",
          "name"  :  "淮安市",
          "area"  :  [
            {
              "id"  :  "320802",
              "name"  :  "清河区"
            },
            {
              "id"  :  "320803",
              "name"  :  "淮安区"
            },
            {
              "id"  :  "320804",
              "name"  :  "淮阴区"
            },
            {
              "id"  :  "320811",
              "name"  :  "青浦区"
            },
            {
              "id"  :  "320826",
              "name"  :  "涟水县"
            },
            {
              "id"  :  "320829",
              "name"  :  "洪泽县"
            },
            {
              "id"  :  "320830",
              "name"  :  "盱眙县"
            },
            {
              "id"  :  "320831",
              "name"  :  "金湖县"
            }
          ]
        },
        {
          "id"  :  "320900",
          "name"  :  "盐城市",
          "area"  :  [
            {
              "id"  :  "320902",
              "name"  :  "亭湖区"
            },
            {
              "id"  :  "320903",
              "name"  :  "盐都区"
            },
            {
              "id"  :  "320921",
              "name"  :  "响水县"
            },
            {
              "id"  :  "320922",
              "name"  :  "滨海县"
            },
            {
              "id"  :  "320923",
              "name"  :  "阜宁县"
            },
            {
              "id"  :  "320924",
              "name"  :  "射阳县"
            },
            {
              "id"  :  "320925",
              "name"  :  "建湖县"
            },
            {
              "id"  :  "320981",
              "name"  :  "东台市"
            },
            {
              "id"  :  "320982",
              "name"  :  "大丰市"
            }
          ]
        },
        {
          "id"  :  "321000",
          "name"  :  "扬州市",
          "area"  :  [
            {
              "id"  :  "321002",
              "name"  :  "广陵区"
            },
            {
              "id"  :  "321003",
              "name"  :  "邗江区"
            },
            {
              "id"  :  "321023",
              "name"  :  "宝应县"
            },
            {
              "id"  :  "321081",
              "name"  :  "仪征市"
            },
            {
              "id"  :  "321084",
              "name"  :  "高邮市"
            },
            {
              "id"  :  "321088",
              "name"  :  "江都市"
            }
          ]
        },
        {
          "id"  :  "321100",
          "name"  :  "镇江市",
          "area"  :  [
            {
              "id"  :  "321102",
              "name"  :  "京口区"
            },
            {
              "id"  :  "321111",
              "name"  :  "润州区"
            },
            {
              "id"  :  "321112",
              "name"  :  "丹徒区"
            },
            {
              "id"  :  "321181",
              "name"  :  "丹阳市"
            },
            {
              "id"  :  "321182",
              "name"  :  "扬中市"
            },
            {
              "id"  :  "321183",
              "name"  :  "句容市"
            }
          ]
        },
        {
          "id"  :  "321200",
          "name"  :  "泰州市",
          "area"  :  [
            {
              "id"  :  "321202",
              "name"  :  "海陵区"
            },
            {
              "id"  :  "321203",
              "name"  :  "高港区"
            },
            {
              "id"  :  "321281",
              "name"  :  "兴化市"
            },
            {
              "id"  :  "321282",
              "name"  :  "靖江市"
            },
            {
              "id"  :  "321283",
              "name"  :  "泰兴市"
            },
            {
              "id"  :  "321284",
              "name"  :  "姜堰市"
            }
          ]
        },
        {
          "id"  :  "321300",
          "name"  :  "宿迁市",
          "area"  :  [
            {
              "id"  :  "321302",
              "name"  :  "宿城区"
            },
            {
              "id"  :  "321311",
              "name"  :  "宿豫区"
            },
            {
              "id"  :  "321322",
              "name"  :  "沭阳县"
            },
            {
              "id"  :  "321323",
              "name"  :  "泗阳县"
            },
            {
              "id"  :  "321324",
              "name"  :  "泗洪县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "330000",
      "name"  :  "浙江省",
      "city"  :  [
        {
          "id"  :  "330100",
          "name"  :  "杭州市",
          "area"  :  [
            {
              "id"  :  "330102",
              "name"  :  "上城区"
            },
            {
              "id"  :  "330103",
              "name"  :  "下城区"
            },
            {
              "id"  :  "330104",
              "name"  :  "江干区"
            },
            {
              "id"  :  "330105",
              "name"  :  "拱墅区"
            },
            {
              "id"  :  "330106",
              "name"  :  "西湖区"
            },
            {
              "id"  :  "330108",
              "name"  :  "滨江区"
            },
            {
              "id"  :  "330109",
              "name"  :  "萧山区"
            },
            {
              "id"  :  "330110",
              "name"  :  "余杭区"
            },
            {
              "id"  :  "330122",
              "name"  :  "桐庐县"
            },
            {
              "id"  :  "330127",
              "name"  :  "淳安县"
            },
            {
              "id"  :  "330182",
              "name"  :  "建德市"
            },
            {
              "id"  :  "330183",
              "name"  :  "富阳市"
            },
            {
              "id"  :  "330185",
              "name"  :  "临安市"
            }
          ]
        },
        {
          "id"  :  "330200",
          "name"  :  "宁波市",
          "area"  :  [
            {
              "id"  :  "330203",
              "name"  :  "海曙区"
            },
            {
              "id"  :  "330204",
              "name"  :  "江东区"
            },
            {
              "id"  :  "330205",
              "name"  :  "江北区"
            },
            {
              "id"  :  "330206",
              "name"  :  "北仑区"
            },
            {
              "id"  :  "330211",
              "name"  :  "镇海区"
            },
            {
              "id"  :  "330212",
              "name"  :  "鄞州区"
            },
            {
              "id"  :  "330225",
              "name"  :  "象山县"
            },
            {
              "id"  :  "330226",
              "name"  :  "宁海县"
            },
            {
              "id"  :  "330281",
              "name"  :  "余姚市"
            },
            {
              "id"  :  "330282",
              "name"  :  "慈溪市"
            },
            {
              "id"  :  "330283",
              "name"  :  "奉化市"
            }
          ]
        },
        {
          "id"  :  "330300",
          "name"  :  "温州市",
          "area"  :  [
            {
              "id"  :  "330302",
              "name"  :  "鹿城区"
            },
            {
              "id"  :  "330303",
              "name"  :  "龙湾区"
            },
            {
              "id"  :  "330304",
              "name"  :  "瓯海区"
            },
            {
              "id"  :  "330322",
              "name"  :  "洞头县"
            },
            {
              "id"  :  "330324",
              "name"  :  "永嘉县"
            },
            {
              "id"  :  "330326",
              "name"  :  "平阳县"
            },
            {
              "id"  :  "330327",
              "name"  :  "苍南县"
            },
            {
              "id"  :  "330328",
              "name"  :  "文成县"
            },
            {
              "id"  :  "330329",
              "name"  :  "泰顺县"
            },
            {
              "id"  :  "330381",
              "name"  :  "瑞安市"
            },
            {
              "id"  :  "330382",
              "name"  :  "乐清市"
            }
          ]
        },
        {
          "id"  :  "330400",
          "name"  :  "嘉兴市",
          "area"  :  [
            {
              "id"  :  "330402",
              "name"  :  "南湖区"
            },
            {
              "id"  :  "330411",
              "name"  :  "秀洲区"
            },
            {
              "id"  :  "330421",
              "name"  :  "嘉善县"
            },
            {
              "id"  :  "330424",
              "name"  :  "海盐县"
            },
            {
              "id"  :  "330481",
              "name"  :  "海宁市"
            },
            {
              "id"  :  "330482",
              "name"  :  "平湖市"
            },
            {
              "id"  :  "330483",
              "name"  :  "桐乡市"
            }
          ]
        },
        {
          "id"  :  "330500",
          "name"  :  "湖州市",
          "area"  :  [
            {
              "id"  :  "330502",
              "name"  :  "吴兴区"
            },
            {
              "id"  :  "330503",
              "name"  :  "南浔区"
            },
            {
              "id"  :  "330521",
              "name"  :  "德清县"
            },
            {
              "id"  :  "330522",
              "name"  :  "长兴县"
            },
            {
              "id"  :  "330523",
              "name"  :  "安吉县"
            }
          ]
        },
        {
          "id"  :  "330600",
          "name"  :  "绍兴市",
          "area"  :  [
            {
              "id"  :  "330602",
              "name"  :  "越城区"
            },
            {
              "id"  :  "330621",
              "name"  :  "绍兴县"
            },
            {
              "id"  :  "330624",
              "name"  :  "新昌县"
            },
            {
              "id"  :  "330681",
              "name"  :  "诸暨市"
            },
            {
              "id"  :  "330682",
              "name"  :  "上虞市"
            },
            {
              "id"  :  "330683",
              "name"  :  "嵊州市"
            }
          ]
        },
        {
          "id"  :  "330700",
          "name"  :  "金华市",
          "area"  :  [
            {
              "id"  :  "330702",
              "name"  :  "婺城区"
            },
            {
              "id"  :  "330703",
              "name"  :  "金东区"
            },
            {
              "id"  :  "330723",
              "name"  :  "武义县"
            },
            {
              "id"  :  "330726",
              "name"  :  "浦江县"
            },
            {
              "id"  :  "330727",
              "name"  :  "磐安县"
            },
            {
              "id"  :  "330781",
              "name"  :  "兰溪市"
            },
            {
              "id"  :  "330782",
              "name"  :  "义乌市"
            },
            {
              "id"  :  "330783",
              "name"  :  "东阳市"
            },
            {
              "id"  :  "330784",
              "name"  :  "永康市"
            }
          ]
        },
        {
          "id"  :  "330800",
          "name"  :  "衢州市",
          "area"  :  [
            {
              "id"  :  "330802",
              "name"  :  "柯城区"
            },
            {
              "id"  :  "330803",
              "name"  :  "衢江区"
            },
            {
              "id"  :  "330822",
              "name"  :  "常山县"
            },
            {
              "id"  :  "330824",
              "name"  :  "开化县"
            },
            {
              "id"  :  "330825",
              "name"  :  "龙游县"
            },
            {
              "id"  :  "330881",
              "name"  :  "江山市"
            }
          ]
        },
        {
          "id"  :  "330900",
          "name"  :  "舟山市",
          "area"  :  [
            {
              "id"  :  "330902",
              "name"  :  "定海区"
            },
            {
              "id"  :  "330903",
              "name"  :  "普陀区"
            },
            {
              "id"  :  "330921",
              "name"  :  "岱山县"
            },
            {
              "id"  :  "330922",
              "name"  :  "嵊泗县"
            }
          ]
        },
        {
          "id"  :  "331000",
          "name"  :  "台州市",
          "area"  :  [
            {
              "id"  :  "331002",
              "name"  :  "椒江区"
            },
            {
              "id"  :  "331003",
              "name"  :  "黄岩区"
            },
            {
              "id"  :  "331004",
              "name"  :  "路桥区"
            },
            {
              "id"  :  "331021",
              "name"  :  "玉环县"
            },
            {
              "id"  :  "331022",
              "name"  :  "三门县"
            },
            {
              "id"  :  "331023",
              "name"  :  "天台县"
            },
            {
              "id"  :  "331024",
              "name"  :  "仙居县"
            },
            {
              "id"  :  "331081",
              "name"  :  "温岭市"
            },
            {
              "id"  :  "331082",
              "name"  :  "临海市"
            }
          ]
        },
        {
          "id"  :  "331100",
          "name"  :  "丽水市",
          "area"  :  [
            {
              "id"  :  "331102",
              "name"  :  "莲都区"
            },
            {
              "id"  :  "331121",
              "name"  :  "青田县"
            },
            {
              "id"  :  "331122",
              "name"  :  "缙云县"
            },
            {
              "id"  :  "331123",
              "name"  :  "遂昌县"
            },
            {
              "id"  :  "331124",
              "name"  :  "松阳县"
            },
            {
              "id"  :  "331125",
              "name"  :  "云和县"
            },
            {
              "id"  :  "331126",
              "name"  :  "庆元县"
            },
            {
              "id"  :  "331127",
              "name"  :  "景宁畲族自治县"
            },
            {
              "id"  :  "331181",
              "name"  :  "龙泉市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "340000",
      "name"  :  "安徽省",
      "city"  :  [
        {
          "id"  :  "340100",
          "name"  :  "合肥市",
          "area"  :  [
            {
              "id"  :  "340102",
              "name"  :  "瑶海区"
            },
            {
              "id"  :  "340103",
              "name"  :  "庐阳区"
            },
            {
              "id"  :  "340104",
              "name"  :  "蜀山区"
            },
            {
              "id"  :  "340111",
              "name"  :  "包河区"
            },
            {
              "id"  :  "340121",
              "name"  :  "长丰县"
            },
            {
              "id"  :  "340122",
              "name"  :  "肥东县"
            },
            {
              "id"  :  "340123",
              "name"  :  "肥西县"
            },
            {
              "id"  :  "340124",
              "name"  :  "庐江县"
            },
            {
              "id"  :  "340181",
              "name"  :  "巢湖市"
            }
          ]
        },
        {
          "id"  :  "340200",
          "name"  :  "芜湖市",
          "area"  :  [
            {
              "id"  :  "340202",
              "name"  :  "镜湖区"
            },
            {
              "id"  :  "340203",
              "name"  :  "弋江区"
            },
            {
              "id"  :  "340207",
              "name"  :  "鸠江区"
            },
            {
              "id"  :  "340208",
              "name"  :  "三山区"
            },
            {
              "id"  :  "340221",
              "name"  :  "芜湖县"
            },
            {
              "id"  :  "340222",
              "name"  :  "繁昌县"
            },
            {
              "id"  :  "340223",
              "name"  :  "南陵县"
            },
            {
              "id"  :  "340225",
              "name"  :  "无为县"
            }
          ]
        },
        {
          "id"  :  "340300",
          "name"  :  "蚌埠市",
          "area"  :  [
            {
              "id"  :  "340302",
              "name"  :  "龙子湖区"
            },
            {
              "id"  :  "340303",
              "name"  :  "蚌山区"
            },
            {
              "id"  :  "340304",
              "name"  :  "禹会区"
            },
            {
              "id"  :  "340311",
              "name"  :  "淮上区"
            },
            {
              "id"  :  "340321",
              "name"  :  "怀远县"
            },
            {
              "id"  :  "340322",
              "name"  :  "五河县"
            },
            {
              "id"  :  "340323",
              "name"  :  "固镇县"
            }
          ]
        },
        {
          "id"  :  "340400",
          "name"  :  "淮南市",
          "area"  :  [
            {
              "id"  :  "340402",
              "name"  :  "大通区"
            },
            {
              "id"  :  "340403",
              "name"  :  "田家庵区"
            },
            {
              "id"  :  "340404",
              "name"  :  "谢家集区"
            },
            {
              "id"  :  "340405",
              "name"  :  "八公山区"
            },
            {
              "id"  :  "340406",
              "name"  :  "潘集区"
            },
            {
              "id"  :  "340421",
              "name"  :  "凤台县"
            }
          ]
        },
        {
          "id"  :  "340500",
          "name"  :  "马鞍山市",
          "area"  :  [
            {
              "id"  :  "340503",
              "name"  :  "花山区"
            },
            {
              "id"  :  "340504",
              "name"  :  "雨山区"
            },
            {
              "id"  :  "340521",
              "name"  :  "当涂县"
            },
            {
              "id"  :  "340522",
              "name"  :  "含山县"
            },
            {
              "id"  :  "340523",
              "name"  :  "和县"
            },
            {
              "id"  :  "340596",
              "name"  :  "博望区"
            }
          ]
        },
        {
          "id"  :  "340600",
          "name"  :  "淮北市",
          "area"  :  [
            {
              "id"  :  "340602",
              "name"  :  "杜集区"
            },
            {
              "id"  :  "340603",
              "name"  :  "相山区"
            },
            {
              "id"  :  "340604",
              "name"  :  "烈山区"
            },
            {
              "id"  :  "340621",
              "name"  :  "濉溪县"
            }
          ]
        },
        {
          "id"  :  "340700",
          "name"  :  "铜陵市",
          "area"  :  [
            {
              "id"  :  "340702",
              "name"  :  "铜官山区"
            },
            {
              "id"  :  "340703",
              "name"  :  "狮子山区"
            },
            {
              "id"  :  "340711",
              "name"  :  "郊区"
            },
            {
              "id"  :  "340721",
              "name"  :  "铜陵县"
            }
          ]
        },
        {
          "id"  :  "340800",
          "name"  :  "安庆市",
          "area"  :  [
            {
              "id"  :  "340802",
              "name"  :  "迎江区"
            },
            {
              "id"  :  "340803",
              "name"  :  "大观区"
            },
            {
              "id"  :  "340811",
              "name"  :  "宜秀区"
            },
            {
              "id"  :  "340822",
              "name"  :  "怀宁县"
            },
            {
              "id"  :  "340823",
              "name"  :  "枞阳县"
            },
            {
              "id"  :  "340824",
              "name"  :  "潜山县"
            },
            {
              "id"  :  "340825",
              "name"  :  "太湖县"
            },
            {
              "id"  :  "340826",
              "name"  :  "宿松县"
            },
            {
              "id"  :  "340827",
              "name"  :  "望江县"
            },
            {
              "id"  :  "340828",
              "name"  :  "岳西县"
            },
            {
              "id"  :  "340881",
              "name"  :  "桐城市"
            }
          ]
        },
        {
          "id"  :  "341000",
          "name"  :  "黄山市",
          "area"  :  [
            {
              "id"  :  "341002",
              "name"  :  "屯溪区"
            },
            {
              "id"  :  "341003",
              "name"  :  "黄山区"
            },
            {
              "id"  :  "341004",
              "name"  :  "徽州区"
            },
            {
              "id"  :  "341021",
              "name"  :  "歙县"
            },
            {
              "id"  :  "341022",
              "name"  :  "休宁县"
            },
            {
              "id"  :  "341023",
              "name"  :  "黟县"
            },
            {
              "id"  :  "341024",
              "name"  :  "祁门县"
            }
          ]
        },
        {
          "id"  :  "341100",
          "name"  :  "滁州市",
          "area"  :  [
            {
              "id"  :  "341102",
              "name"  :  "琅琊区"
            },
            {
              "id"  :  "341103",
              "name"  :  "南谯区"
            },
            {
              "id"  :  "341122",
              "name"  :  "来安县"
            },
            {
              "id"  :  "341124",
              "name"  :  "全椒县"
            },
            {
              "id"  :  "341125",
              "name"  :  "定远县"
            },
            {
              "id"  :  "341126",
              "name"  :  "凤阳县"
            },
            {
              "id"  :  "341181",
              "name"  :  "天长市"
            },
            {
              "id"  :  "341182",
              "name"  :  "明光市"
            }
          ]
        },
        {
          "id"  :  "341200",
          "name"  :  "阜阳市",
          "area"  :  [
            {
              "id"  :  "341202",
              "name"  :  "颍州区"
            },
            {
              "id"  :  "341203",
              "name"  :  "颍东区"
            },
            {
              "id"  :  "341204",
              "name"  :  "颍泉区"
            },
            {
              "id"  :  "341221",
              "name"  :  "临泉县"
            },
            {
              "id"  :  "341222",
              "name"  :  "太和县"
            },
            {
              "id"  :  "341225",
              "name"  :  "阜南县"
            },
            {
              "id"  :  "341226",
              "name"  :  "颍上县"
            },
            {
              "id"  :  "341282",
              "name"  :  "界首市"
            }
          ]
        },
        {
          "id"  :  "341300",
          "name"  :  "宿州市",
          "area"  :  [
            {
              "id"  :  "341302",
              "name"  :  "埇桥区"
            },
            {
              "id"  :  "341321",
              "name"  :  "砀山县"
            },
            {
              "id"  :  "341322",
              "name"  :  "萧县"
            },
            {
              "id"  :  "341323",
              "name"  :  "灵璧县"
            },
            {
              "id"  :  "341324",
              "name"  :  "泗县"
            }
          ]
        },
        {
          "id"  :  "341500",
          "name"  :  "六安市",
          "area"  :  [
            {
              "id"  :  "341502",
              "name"  :  "金安区"
            },
            {
              "id"  :  "341503",
              "name"  :  "裕安区"
            },
            {
              "id"  :  "341521",
              "name"  :  "寿县"
            },
            {
              "id"  :  "341522",
              "name"  :  "霍邱县"
            },
            {
              "id"  :  "341523",
              "name"  :  "舒城县"
            },
            {
              "id"  :  "341524",
              "name"  :  "金寨县"
            },
            {
              "id"  :  "341525",
              "name"  :  "霍山县"
            }
          ]
        },
        {
          "id"  :  "341600",
          "name"  :  "亳州市",
          "area"  :  [
            {
              "id"  :  "341602",
              "name"  :  "谯城区"
            },
            {
              "id"  :  "341621",
              "name"  :  "涡阳县"
            },
            {
              "id"  :  "341622",
              "name"  :  "蒙城县"
            },
            {
              "id"  :  "341623",
              "name"  :  "利辛县"
            }
          ]
        },
        {
          "id"  :  "341700",
          "name"  :  "池州市",
          "area"  :  [
            {
              "id"  :  "341702",
              "name"  :  "贵池区"
            },
            {
              "id"  :  "341721",
              "name"  :  "东至县"
            },
            {
              "id"  :  "341722",
              "name"  :  "石台县"
            },
            {
              "id"  :  "341723",
              "name"  :  "青阳县"
            }
          ]
        },
        {
          "id"  :  "341800",
          "name"  :  "宣城市",
          "area"  :  [
            {
              "id"  :  "341802",
              "name"  :  "宣州区"
            },
            {
              "id"  :  "341821",
              "name"  :  "郎溪县"
            },
            {
              "id"  :  "341822",
              "name"  :  "广德县"
            },
            {
              "id"  :  "341823",
              "name"  :  "泾县"
            },
            {
              "id"  :  "341824",
              "name"  :  "绩溪县"
            },
            {
              "id"  :  "341825",
              "name"  :  "旌德县"
            },
            {
              "id"  :  "341881",
              "name"  :  "宁国市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "350000",
      "name"  :  "福建省",
      "city"  :  [
        {
          "id"  :  "350100",
          "name"  :  "福州市",
          "area"  :  [
            {
              "id"  :  "350102",
              "name"  :  "鼓楼区"
            },
            {
              "id"  :  "350103",
              "name"  :  "台江区"
            },
            {
              "id"  :  "350104",
              "name"  :  "仓山区"
            },
            {
              "id"  :  "350105",
              "name"  :  "马尾区"
            },
            {
              "id"  :  "350111",
              "name"  :  "晋安区"
            },
            {
              "id"  :  "350121",
              "name"  :  "闽侯县"
            },
            {
              "id"  :  "350122",
              "name"  :  "连江县"
            },
            {
              "id"  :  "350123",
              "name"  :  "罗源县"
            },
            {
              "id"  :  "350124",
              "name"  :  "闽清县"
            },
            {
              "id"  :  "350125",
              "name"  :  "永泰县"
            },
            {
              "id"  :  "350128",
              "name"  :  "平潭县"
            },
            {
              "id"  :  "350181",
              "name"  :  "福清市"
            },
            {
              "id"  :  "350182",
              "name"  :  "长乐市"
            }
          ]
        },
        {
          "id"  :  "350200",
          "name"  :  "厦门市",
          "area"  :  [
            {
              "id"  :  "350203",
              "name"  :  "思明区"
            },
            {
              "id"  :  "350205",
              "name"  :  "海沧区"
            },
            {
              "id"  :  "350206",
              "name"  :  "湖里区"
            },
            {
              "id"  :  "350211",
              "name"  :  "集美区"
            },
            {
              "id"  :  "350212",
              "name"  :  "同安区"
            },
            {
              "id"  :  "350213",
              "aname"  :  "翔安区"
            }
          ]
        },
        {
          "id"  :  "350300",
          "name"  :  "莆田市",
          "area"  :  [
            {
              "id"  :  "350302",
              "aname"  :  "城厢区"
            },
            {
              "id"  :  "350303",
              "aname"  :  "涵江区"
            },
            {
              "id"  :  "350304",
              "aname"  :  "荔城区"
            },
            {
              "id"  :  "350305",
              "aname"  :  "秀屿区"
            },
            {
              "id"  :  "350322",
              "aname"  :  "仙游县"
            }
          ]
        },
        {
          "id"  :  "350400",
          "name"  :  "三明市",
          "area"  :  [
            {
              "id"  :  "350402",
              "aname"  :  "梅列区"
            },
            {
              "id"  :  "350403",
              "aname"  :  "三元区"
            },
            {
              "id"  :  "350421",
              "aname"  :  "明溪县"
            },
            {
              "id"  :  "350423",
              "aname"  :  "清流县"
            },
            {
              "id"  :  "350424",
              "aname"  :  "宁化县"
            },
            {
              "id"  :  "350425",
              "aname"  :  "大田县"
            },
            {
              "id"  :  "350426",
              "aname"  :  "尤溪县"
            },
            {
              "id"  :  "350427",
              "aname"  :  "沙县"
            },
            {
              "id"  :  "350428",
              "aname"  :  "将乐县"
            },
            {
              "id"  :  "350429",
              "aname"  :  "泰宁县"
            },
            {
              "id"  :  "350430",
              "aname"  :  "建宁县"
            },
            {
              "id"  :  "350481",
              "aname"  :  "永安市"
            }
          ]
        },
        {
          "id"  :  "350500",
          "name"  :  "泉州市",
          "area"  :  [
            {
              "id"  :  "350502",
              "aname"  :  "鲤城区"
            },
            {
              "id"  :  "350503",
              "aname"  :  "丰泽区"
            },
            {
              "id"  :  "350504",
              "aname"  :  "洛江区"
            },
            {
              "id"  :  "350505",
              "aname"  :  "泉港区"
            },
            {
              "id"  :  "350521",
              "aname"  :  "惠安县"
            },
            {
              "id"  :  "350524",
              "aname"  :  "安溪县"
            },
            {
              "id"  :  "350525",
              "aname"  :  "永春县"
            },
            {
              "id"  :  "350526",
              "aname"  :  "德化县"
            },
            {
              "id"  :  "350527",
              "aname"  :  "金门县"
            },
            {
              "id"  :  "350581",
              "aname"  :  "石狮市"
            },
            {
              "id"  :  "350582",
              "aname"  :  "晋江市"
            },
            {
              "id"  :  "350583",
              "aname"  :  "南安市"
            }
          ]
        },
        {
          "id"  :  "350600",
          "name"  :  "漳州市",
          "area"  :  [
            {
              "id"  :  "350602",
              "aname"  :  "芗城区"
            },
            {
              "id"  :  "350603",
              "aname"  :  "龙文区"
            },
            {
              "id"  :  "350622",
              "aname"  :  "云霄县"
            },
            {
              "id"  :  "350623",
              "aname"  :  "漳浦县"
            },
            {
              "id"  :  "350624",
              "aname"  :  "诏安县"
            },
            {
              "id"  :  "350625",
              "aname"  :  "长泰县"
            },
            {
              "id"  :  "350626",
              "aname"  :  "东山县"
            },
            {
              "id"  :  "350627",
              "aname"  :  "南靖县"
            },
            {
              "id"  :  "350628",
              "aname"  :  "平和县"
            },
            {
              "id"  :  "350629",
              "aname"  :  "华安县"
            },
            {
              "id"  :  "350681",
              "aname"  :  "龙海市"
            }
          ]
        },
        {
          "id"  :  "350700",
          "name"  :  "南平市",
          "area"  :  [
            {
              "id"  :  "350702",
              "aname"  :  "延平区"
            },
            {
              "id"  :  "350721",
              "aname"  :  "顺昌县"
            },
            {
              "id"  :  "350722",
              "aname"  :  "浦城县"
            },
            {
              "id"  :  "350723",
              "aname"  :  "光泽县"
            },
            {
              "id"  :  "350724",
              "aname"  :  "松溪县"
            },
            {
              "id"  :  "350725",
              "aname"  :  "政和县"
            },
            {
              "id"  :  "350781",
              "aname"  :  "邵武市"
            },
            {
              "id"  :  "350782",
              "aname"  :  "武夷山市"
            },
            {
              "id"  :  "350783",
              "aname"  :  "建瓯市"
            },
            {
              "id"  :  "350784",
              "aname"  :  "建阳市"
            }
          ]
        },
        {
          "id"  :  "350800",
          "name"  :  "龙岩市",
          "area"  :  [
            {
              "id"  :  "350802",
              "aname"  :  "新罗区"
            },
            {
              "id"  :  "350821",
              "aname"  :  "长汀县"
            },
            {
              "id"  :  "350822",
              "aname"  :  "永定县"
            },
            {
              "id"  :  "350823",
              "aname"  :  "上杭县"
            },
            {
              "id"  :  "350824",
              "aname"  :  "武平县"
            },
            {
              "id"  :  "350825",
              "aname"  :  "连城县"
            },
            {
              "id"  :  "350881",
              "aname"  :  "漳平市"
            }
          ]
        },
        {
          "id"  :  "350900",
          "name"  :  "宁德市",
          "area"  :  [
            {
              "id"  :  "350902",
              "aname"  :  "蕉城区"
            },
            {
              "id"  :  "350921",
              "aname"  :  "霞浦县"
            },
            {
              "id"  :  "350922",
              "aname"  :  "古田县"
            },
            {
              "id"  :  "350923",
              "aname"  :  "屏南县"
            },
            {
              "id"  :  "350924",
              "aname"  :  "寿宁县"
            },
            {
              "id"  :  "350925",
              "aname"  :  "周宁县"
            },
            {
              "id"  :  "350926",
              "aname"  :  "柘荣县"
            },
            {
              "id"  :  "350981",
              "aname"  :  "福安市"
            },
            {
              "id"  :  "350982",
              "aname"  :  "福鼎市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "360000",
      "name"  :  "江西省",
      "city"  :  [
        {
          "id"  :  "360100",
          "name"  :  "南昌市",
          "area"  :  [
            {
              "id"  :  "360102",
              "aname"  :  "东湖区"
            },
            {
              "id"  :  "360103",
              "aname"  :  "西湖区"
            },
            {
              "id"  :  "360104",
              "aname"  :  "青云谱区"
            },
            {
              "id"  :  "360105",
              "aname"  :  "湾里区"
            },
            {
              "id"  :  "360111",
              "aname"  :  "青山湖区"
            },
            {
              "id"  :  "360121",
              "aname"  :  "南昌县"
            },
            {
              "id"  :  "360122",
              "aname"  :  "新建县"
            },
            {
              "id"  :  "360123",
              "aname"  :  "安义县"
            },
            {
              "id"  :  "360124",
              "aname"  :  "进贤县"
            }
          ]
        },
        {
          "id"  :  "360200",
          "name"  :  "景德镇市",
          "area"  :  [
            {
              "id"  :  "360202",
              "aname"  :  "昌江区"
            },
            {
              "id"  :  "360203",
              "aname"  :  "珠山区"
            },
            {
              "id"  :  "360222",
              "aname"  :  "浮梁县"
            },
            {
              "id"  :  "360281",
              "aname"  :  "乐平市"
            }
          ]
        },
        {
          "id"  :  "360300",
          "name"  :  "萍乡市",
          "area"  :  [
            {
              "id"  :  "360302",
              "aname"  :  "安源区"
            },
            {
              "id"  :  "360313",
              "aname"  :  "湘东区"
            },
            {
              "id"  :  "360321",
              "aname"  :  "莲花县"
            },
            {
              "id"  :  "360322",
              "aname"  :  "上栗县"
            },
            {
              "id"  :  "360323",
              "aname"  :  "芦溪县"
            }
          ]
        },
        {
          "id"  :  "360400",
          "name"  :  "九江市",
          "area"  :  [
            {
              "id"  :  "360402",
              "aname"  :  "庐山区"
            },
            {
              "id"  :  "360403",
              "aname"  :  "浔阳区"
            },
            {
              "id"  :  "360421",
              "aname"  :  "九江县"
            },
            {
              "id"  :  "360423",
              "aname"  :  "武宁县"
            },
            {
              "id"  :  "360424",
              "aname"  :  "修水县"
            },
            {
              "id"  :  "360425",
              "aname"  :  "永修县"
            },
            {
              "id"  :  "360426",
              "aname"  :  "德安县"
            },
            {
              "id"  :  "360427",
              "aname"  :  "星子县"
            },
            {
              "id"  :  "360428",
              "aname"  :  "都昌县"
            },
            {
              "id"  :  "360429",
              "aname"  :  "湖口县"
            },
            {
              "id"  :  "360430",
              "aname"  :  "彭泽县"
            },
            {
              "id"  :  "360481",
              "aname"  :  "瑞昌市"
            },
            {
              "id"  :  "360482",
              "aname"  :  "共青城市"
            }
          ]
        },
        {
          "id"  :  "360500",
          "name"  :  "新余市",
          "area"  :  [
            {
              "id"  :  "360502",
              "aname"  :  "渝水区"
            },
            {
              "id"  :  "360521",
              "aname"  :  "分宜县"
            }
          ]
        },
        {
          "id"  :  "360600",
          "name"  :  "鹰潭市",
          "area"  :  [
            {
              "id"  :  "360602",
              "aname"  :  "月湖区"
            },
            {
              "id"  :  "360622",
              "aname"  :  "余江县"
            },
            {
              "id"  :  "360681",
              "aname"  :  "贵溪市"
            }
          ]
        },
        {
          "id"  :  "360700",
          "name"  :  "赣州市",
          "area"  :  [
            {
              "id"  :  "360702",
              "aname"  :  "章贡区"
            },
            {
              "id"  :  "360721",
              "aname"  :  "赣县"
            },
            {
              "id"  :  "360722",
              "aname"  :  "信丰县"
            },
            {
              "id"  :  "360723",
              "aname"  :  "大余县"
            },
            {
              "id"  :  "360724",
              "aname"  :  "上犹县"
            },
            {
              "id"  :  "360725",
              "aname"  :  "崇义县"
            },
            {
              "id"  :  "360726",
              "aname"  :  "安远县"
            },
            {
              "id"  :  "360727",
              "aname"  :  "龙南县"
            },
            {
              "id"  :  "360728",
              "aname"  :  "定南县"
            },
            {
              "id"  :  "360729",
              "aname"  :  "全南县"
            },
            {
              "id"  :  "360730",
              "aname"  :  "宁都县"
            },
            {
              "id"  :  "360731",
              "aname"  :  "于都县"
            },
            {
              "id"  :  "360732",
              "aname"  :  "兴国县"
            },
            {
              "id"  :  "360733",
              "aname"  :  "会昌县"
            },
            {
              "id"  :  "360734",
              "aname"  :  "寻乌县"
            },
            {
              "id"  :  "360735",
              "aname"  :  "石城县"
            },
            {
              "id"  :  "360781",
              "aname"  :  "瑞金市"
            },
            {
              "id"  :  "360782",
              "aname"  :  "南康市"
            }
          ]
        },
        {
          "id"  :  "360800",
          "name"  :  "吉安市",
          "area"  :  [
            {
              "id"  :  "360802",
              "aname"  :  "吉州区"
            },
            {
              "id"  :  "360803",
              "aname"  :  "青原区"
            },
            {
              "id"  :  "360821",
              "aname"  :  "吉安县"
            },
            {
              "id"  :  "360822",
              "aname"  :  "吉水县"
            },
            {
              "id"  :  "360823",
              "aname"  :  "峡江县"
            },
            {
              "id"  :  "360824",
              "aname"  :  "新干县"
            },
            {
              "id"  :  "360825",
              "aname"  :  "永丰县"
            },
            {
              "id"  :  "360826",
              "aname"  :  "泰和县"
            },
            {
              "id"  :  "360827",
              "aname"  :  "遂川县"
            },
            {
              "id"  :  "360828",
              "aname"  :  "万安县"
            },
            {
              "id"  :  "360829",
              "aname"  :  "安福县"
            },
            {
              "id"  :  "360830",
              "aname"  :  "永新县"
            },
            {
              "id"  :  "360881",
              "aname"  :  "井冈山市"
            }
          ]
        },
        {
          "id"  :  "360900",
          "name"  :  "宜春市",
          "area"  :  [
            {
              "id"  :  "360902",
              "aname"  :  "袁州区"
            },
            {
              "id"  :  "360921",
              "aname"  :  "奉新县"
            },
            {
              "id"  :  "360922",
              "aname"  :  "万载县"
            },
            {
              "id"  :  "360923",
              "aname"  :  "上高县"
            },
            {
              "id"  :  "360924",
              "aname"  :  "宜丰县"
            },
            {
              "id"  :  "360925",
              "aname"  :  "靖安县"
            },
            {
              "id"  :  "360926",
              "aname"  :  "铜鼓县"
            },
            {
              "id"  :  "360981",
              "aname"  :  "丰城市"
            },
            {
              "id"  :  "360982",
              "aname"  :  "樟树市"
            },
            {
              "id"  :  "360983",
              "aname"  :  "高安市"
            }
          ]
        },
        {
          "id"  :  "361000",
          "name"  :  "抚州市",
          "area"  :  [
            {
              "id"  :  "361002",
              "aname"  :  "临川区"
            },
            {
              "id"  :  "361021",
              "aname"  :  "南城县"
            },
            {
              "id"  :  "361022",
              "aname"  :  "黎川县"
            },
            {
              "id"  :  "361023",
              "aname"  :  "南丰县"
            },
            {
              "id"  :  "361024",
              "aname"  :  "崇仁县"
            },
            {
              "id"  :  "361025",
              "aname"  :  "乐安县"
            },
            {
              "id"  :  "361026",
              "aname"  :  "宜黄县"
            },
            {
              "id"  :  "361027",
              "aname"  :  "金溪县"
            },
            {
              "id"  :  "361028",
              "aname"  :  "资溪县"
            },
            {
              "id"  :  "361029",
              "aname"  :  "东乡县"
            },
            {
              "id"  :  "361030",
              "aname"  :  "广昌县"
            }
          ]
        },
        {
          "id"  :  "361100",
          "name"  :  "上饶市",
          "area"  :  [
            {
              "id"  :  "361102",
              "aname"  :  "信州区"
            },
            {
              "id"  :  "361121",
              "aname"  :  "上饶县"
            },
            {
              "id"  :  "361122",
              "aname"  :  "广丰县"
            },
            {
              "id"  :  "361123",
              "aname"  :  "玉山县"
            },
            {
              "id"  :  "361124",
              "aname"  :  "铅山县"
            },
            {
              "id"  :  "361125",
              "aname"  :  "横峰县"
            },
            {
              "id"  :  "361126",
              "aname"  :  "弋阳县"
            },
            {
              "id"  :  "361127",
              "aname"  :  "余干县"
            },
            {
              "id"  :  "361128",
              "aname"  :  "鄱阳县"
            },
            {
              "id"  :  "361129",
              "aname"  :  "万年县"
            },
            {
              "id"  :  "361130",
              "aname"  :  "婺源县"
            },
            {
              "id"  :  "361181",
              "aname"  :  "德兴市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "370000",
      "name"  :  "山东省",
      "city"  :  [
        {
          "id"  :  "370100",
          "name"  :  "济南市",
          "area"  :  [
            {
              "id"  :  "370102",
              "aname"  :  "历下区"
            },
            {
              "id"  :  "370103",
              "aname"  :  "市中区"
            },
            {
              "id"  :  "370104",
              "aname"  :  "槐荫区"
            },
            {
              "id"  :  "370105",
              "aname"  :  "天桥区"
            },
            {
              "id"  :  "370112",
              "aname"  :  "历城区"
            },
            {
              "id"  :  "370113",
              "aname"  :  "长清区"
            },
            {
              "id"  :  "370124",
              "aname"  :  "平阴县"
            },
            {
              "id"  :  "370125",
              "aname"  :  "济阳县"
            },
            {
              "id"  :  "370126",
              "aname"  :  "商河县"
            },
            {
              "id"  :  "370181",
              "aname"  :  "章丘市"
            }
          ]
        },
        {
          "id"  :  "370200",
          "name"  :  "青岛市",
          "area"  :  [
            {
              "id"  :  "370202",
              "aname"  :  "市南区"
            },
            {
              "id"  :  "370203",
              "aname"  :  "市北区"
            },
            {
              "id"  :  "370205",
              "aname"  :  "四方区"
            },
            {
              "id"  :  "370211",
              "aname"  :  "黄岛区"
            },
            {
              "id"  :  "370212",
              "aname"  :  "崂山区"
            },
            {
              "id"  :  "370213",
              "aname"  :  "李沧区"
            },
            {
              "id"  :  "370214",
              "aname"  :  "城阳区"
            },
            {
              "id"  :  "370281",
              "aname"  :  "胶州市"
            },
            {
              "id"  :  "370282",
              "aname"  :  "即墨市"
            },
            {
              "id"  :  "370283",
              "aname"  :  "平度市"
            },
            {
              "id"  :  "370284",
              "aname"  :  "胶南市"
            },
            {
              "id"  :  "370285",
              "aname"  :  "莱西市"
            }
          ]
        },
        {
          "id"  :  "370300",
          "name"  :  "淄博市",
          "area"  :  [
            {
              "id"  :  "370302",
              "aname"  :  "淄川区"
            },
            {
              "id"  :  "370303",
              "aname"  :  "张店区"
            },
            {
              "id"  :  "370304",
              "aname"  :  "博山区"
            },
            {
              "id"  :  "370305",
              "aname"  :  "临淄区"
            },
            {
              "id"  :  "370306",
              "aname"  :  "周村区"
            },
            {
              "id"  :  "370321",
              "aname"  :  "桓台县"
            },
            {
              "id"  :  "370322",
              "aname"  :  "高青县"
            },
            {
              "id"  :  "370323",
              "aname"  :  "沂源县"
            }
          ]
        },
        {
          "id"  :  "370400",
          "name"  :  "枣庄市",
          "area"  :  [
            {
              "id"  :  "370402",
              "aname"  :  "市中区"
            },
            {
              "id"  :  "370403",
              "aname"  :  "薛城区"
            },
            {
              "id"  :  "370404",
              "aname"  :  "峄城区"
            },
            {
              "id"  :  "370405",
              "aname"  :  "台儿庄区"
            },
            {
              "id"  :  "370406",
              "aname"  :  "山亭区"
            },
            {
              "id"  :  "370481",
              "aname"  :  "滕州市"
            }
          ]
        },
        {
          "id"  :  "370500",
          "name"  :  "东营市",
          "area"  :  [
            {
              "id"  :  "370502",
              "aname"  :  "东营区"
            },
            {
              "id"  :  "370503",
              "aname"  :  "河口区"
            },
            {
              "id"  :  "370521",
              "aname"  :  "垦利县"
            },
            {
              "id"  :  "370522",
              "aname"  :  "利津县"
            },
            {
              "id"  :  "370523",
              "aname"  :  "广饶县"
            }
          ]
        },
        {
          "id"  :  "370600",
          "name"  :  "烟台市",
          "area"  :  [
            {
              "id"  :  "370602",
              "aname"  :  "芝罘区"
            },
            {
              "id"  :  "370611",
              "aname"  :  "福山区"
            },
            {
              "id"  :  "370612",
              "aname"  :  "牟平区"
            },
            {
              "id"  :  "370613",
              "aname"  :  "莱山区"
            },
            {
              "id"  :  "370634",
              "aname"  :  "长岛县"
            },
            {
              "id"  :  "370681",
              "aname"  :  "龙口市"
            },
            {
              "id"  :  "370682",
              "aname"  :  "莱阳市"
            },
            {
              "id"  :  "370683",
              "aname"  :  "莱州市"
            },
            {
              "id"  :  "370684",
              "aname"  :  "蓬莱市"
            },
            {
              "id"  :  "370685",
              "aname"  :  "招远市"
            },
            {
              "id"  :  "370686",
              "aname"  :  "栖霞市"
            },
            {
              "id"  :  "370687",
              "aname"  :  "海阳市"
            }
          ]
        },
        {
          "id"  :  "370700",
          "name"  :  "潍坊市",
          "area"  :  [
            {
              "id"  :  "370702",
              "aname"  :  "潍城区"
            },
            {
              "id"  :  "370703",
              "aname"  :  "寒亭区"
            },
            {
              "id"  :  "370704",
              "aname"  :  "坊子区"
            },
            {
              "id"  :  "370705",
              "aname"  :  "奎文区"
            },
            {
              "id"  :  "370724",
              "aname"  :  "临朐县"
            },
            {
              "id"  :  "370725",
              "aname"  :  "昌乐县"
            },
            {
              "id"  :  "370781",
              "aname"  :  "青州市"
            },
            {
              "id"  :  "370782",
              "aname"  :  "诸城市"
            },
            {
              "id"  :  "370783",
              "aname"  :  "寿光市"
            },
            {
              "id"  :  "370784",
              "aname"  :  "安丘市"
            },
            {
              "id"  :  "370785",
              "aname"  :  "高密市"
            },
            {
              "id"  :  "370786",
              "aname"  :  "昌邑市"
            }
          ]
        },
        {
          "id"  :  "370800",
          "name"  :  "济宁市",
          "area"  :  [
            {
              "id"  :  "370802",
              "aname"  :  "市中区"
            },
            {
              "id"  :  "370811",
              "aname"  :  "任城区"
            },
            {
              "id"  :  "370826",
              "aname"  :  "微山县"
            },
            {
              "id"  :  "370827",
              "aname"  :  "鱼台县"
            },
            {
              "id"  :  "370828",
              "aname"  :  "金乡县"
            },
            {
              "id"  :  "370829",
              "aname"  :  "嘉祥县"
            },
            {
              "id"  :  "370830",
              "aname"  :  "汶上县"
            },
            {
              "id"  :  "370831",
              "aname"  :  "泗水县"
            },
            {
              "id"  :  "370832",
              "aname"  :  "梁山县"
            },
            {
              "id"  :  "370881",
              "aname"  :  "曲阜市"
            },
            {
              "id"  :  "370882",
              "aname"  :  "兖州市"
            },
            {
              "id"  :  "370883",
              "aname"  :  "邹城市"
            }
          ]
        },
        {
          "id"  :  "370900",
          "name"  :  "泰安市",
          "area"  :  [
            {
              "id"  :  "370902",
              "aname"  :  "泰山区"
            },
            {
              "id"  :  "370911",
              "aname"  :  "岱岳区"
            },
            {
              "id"  :  "370921",
              "aname"  :  "宁阳县"
            },
            {
              "id"  :  "370923",
              "aname"  :  "东平县"
            },
            {
              "id"  :  "370982",
              "aname"  :  "新泰市"
            },
            {
              "id"  :  "370983",
              "aname"  :  "肥城市"
            }
          ]
        },
        {
          "id"  :  "371000",
          "name"  :  "威海市",
          "area"  :  [
            {
              "id"  :  "371002",
              "aname"  :  "环翠区"
            },
            {
              "id"  :  "371081",
              "aname"  :  "文登市"
            },
            {
              "id"  :  "371082",
              "aname"  :  "荣成市"
            },
            {
              "id"  :  "371083",
              "aname"  :  "乳山市"
            }
          ]
        },
        {
          "id"  :  "371100",
          "name"  :  "日照市",
          "area"  :  [
            {
              "id"  :  "371102",
              "aname"  :  "东港区"
            },
            {
              "id"  :  "371103",
              "aname"  :  "岚山区"
            },
            {
              "id"  :  "371121",
              "aname"  :  "五莲县"
            },
            {
              "id"  :  "371122",
              "aname"  :  "莒县"
            }
          ]
        },
        {
          "id"  :  "371200",
          "name"  :  "莱芜市",
          "area"  :  [
            {
              "id"  :  "371202",
              "aname"  :  "莱城区"
            },
            {
              "id"  :  "371203",
              "aname"  :  "钢城区"
            }
          ]
        },
        {
          "id"  :  "371300",
          "name"  :  "临沂市",
          "area"  :  [
            {
              "id"  :  "371302",
              "aname"  :  "兰山区"
            },
            {
              "id"  :  "371311",
              "aname"  :  "罗庄区"
            },
            {
              "id"  :  "371312",
              "aname"  :  "河东区"
            },
            {
              "id"  :  "371321",
              "aname"  :  "沂南县"
            },
            {
              "id"  :  "371322",
              "aname"  :  "郯城县"
            },
            {
              "id"  :  "371323",
              "aname"  :  "沂水县"
            },
            {
              "id"  :  "371324",
              "aname"  :  "苍山县"
            },
            {
              "id"  :  "371325",
              "aname"  :  "费县"
            },
            {
              "id"  :  "371326",
              "aname"  :  "平邑县"
            },
            {
              "id"  :  "371327",
              "aname"  :  "莒南县"
            },
            {
              "id"  :  "371328",
              "aname"  :  "蒙阴县"
            },
            {
              "id"  :  "371329",
              "aname"  :  "临沭县"
            }
          ]
        },
        {
          "id"  :  "371400",
          "name"  :  "德州市",
          "area"  :  [
            {
              "id"  :  "371402",
              "aname"  :  "德城区"
            },
            {
              "id"  :  "371421",
              "aname"  :  "陵县"
            },
            {
              "id"  :  "371422",
              "aname"  :  "宁津县"
            },
            {
              "id"  :  "371423",
              "aname"  :  "庆云县"
            },
            {
              "id"  :  "371424",
              "aname"  :  "临邑县"
            },
            {
              "id"  :  "371425",
              "aname"  :  "齐河县"
            },
            {
              "id"  :  "371426",
              "aname"  :  "平原县"
            },
            {
              "id"  :  "371427",
              "aname"  :  "夏津县"
            },
            {
              "id"  :  "371428",
              "aname"  :  "武城县"
            },
            {
              "id"  :  "371481",
              "aname"  :  "乐陵市"
            },
            {
              "id"  :  "371482",
              "aname"  :  "禹城市"
            }
          ]
        },
        {
          "id"  :  "371500",
          "name"  :  "聊城市",
          "area"  :  [
            {
              "id"  :  "371502",
              "aname"  :  "东昌府区"
            },
            {
              "id"  :  "371521",
              "aname"  :  "阳谷县"
            },
            {
              "id"  :  "371522",
              "aname"  :  "莘县"
            },
            {
              "id"  :  "371523",
              "aname"  :  "茌平县"
            },
            {
              "id"  :  "371524",
              "aname"  :  "东阿县"
            },
            {
              "id"  :  "371525",
              "aname"  :  "冠县"
            },
            {
              "id"  :  "371526",
              "aname"  :  "高唐县"
            },
            {
              "id"  :  "371581",
              "aname"  :  "临清市"
            }
          ]
        },
        {
          "id"  :  "371600",
          "name"  :  "滨州市",
          "area"  :  [
            {
              "id"  :  "371602",
              "aname"  :  "滨城区"
            },
            {
              "id"  :  "371621",
              "aname"  :  "惠民县"
            },
            {
              "id"  :  "371622",
              "aname"  :  "阳信县"
            },
            {
              "id"  :  "371623",
              "aname"  :  "无棣县"
            },
            {
              "id"  :  "371624",
              "aname"  :  "沾化县"
            },
            {
              "id"  :  "371625",
              "aname"  :  "博兴县"
            },
            {
              "id"  :  "371626",
              "aname"  :  "邹平县"
            }
          ]
        },
        {
          "id"  :  "371700",
          "name"  :  "菏泽市",
          "area"  :  [
            {
              "id"  :  "371702",
              "aname"  :  "牡丹区"
            },
            {
              "id"  :  "371721",
              "aname"  :  "曹县"
            },
            {
              "id"  :  "371722",
              "aname"  :  "单县"
            },
            {
              "id"  :  "371723",
              "aname"  :  "成武县"
            },
            {
              "id"  :  "371724",
              "aname"  :  "巨野县"
            },
            {
              "id"  :  "371725",
              "aname"  :  "郓城县"
            },
            {
              "id"  :  "371726",
              "aname"  :  "鄄城县"
            },
            {
              "id"  :  "371727",
              "aname"  :  "定陶县"
            },
            {
              "id"  :  "371728",
              "aname"  :  "东明县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "410000",
      "name"  :  "河南省",
      "city"  :  [
        {
          "id"  :  "410100",
          "name"  :  "郑州市",
          "area"  :  [
            {
              "id"  :  "410102",
              "aname"  :  "中原区"
            },
            {
              "id"  :  "410103",
              "aname"  :  "二七区"
            },
            {
              "id"  :  "410104",
              "aname"  :  "管城回族区"
            },
            {
              "id"  :  "410105",
              "aname"  :  "金水区"
            },
            {
              "id"  :  "410106",
              "aname"  :  "上街区"
            },
            {
              "id"  :  "410108",
              "aname"  :  "惠济区"
            },
            {
              "id"  :  "410122",
              "aname"  :  "中牟县"
            },
            {
              "id"  :  "410181",
              "aname"  :  "巩义市"
            },
            {
              "id"  :  "410182",
              "aname"  :  "荥阳市"
            },
            {
              "id"  :  "410183",
              "aname"  :  "新密市"
            },
            {
              "id"  :  "410184",
              "aname"  :  "新郑市"
            },
            {
              "id"  :  "410185",
              "aname"  :  "登封市"
            }
          ]
        },
        {
          "id"  :  "410200",
          "name"  :  "开封市",
          "area"  :  [
            {
              "id"  :  "410202",
              "aname"  :  "龙亭区"
            },
            {
              "id"  :  "410203",
              "aname"  :  "顺河回族区"
            },
            {
              "id"  :  "410204",
              "aname"  :  "鼓楼区"
            },
            {
              "id"  :  "410205",
              "aname"  :  "禹王台区"
            },
            {
              "id"  :  "410211",
              "aname"  :  "金明区"
            },
            {
              "id"  :  "410221",
              "aname"  :  "杞县"
            },
            {
              "id"  :  "410222",
              "aname"  :  "通许县"
            },
            {
              "id"  :  "410223",
              "aname"  :  "尉氏县"
            },
            {
              "id"  :  "410224",
              "aname"  :  "开封县"
            },
            {
              "id"  :  "410225",
              "aname"  :  "兰考县"
            }
          ]
        },
        {
          "id"  :  "410300",
          "name"  :  "洛阳市",
          "area"  :  [
            {
              "id"  :  "410302",
              "aname"  :  "老城区"
            },
            {
              "id"  :  "410303",
              "aname"  :  "西工区"
            },
            {
              "id"  :  "410304",
              "aname"  :  "瀍河回族区"
            },
            {
              "id"  :  "410305",
              "aname"  :  "涧西区"
            },
            {
              "id"  :  "410306",
              "aname"  :  "吉利区"
            },
            {
              "id"  :  "410311",
              "aname"  :  "洛龙区"
            },
            {
              "id"  :  "410322",
              "aname"  :  "孟津县"
            },
            {
              "id"  :  "410323",
              "aname"  :  "新安县"
            },
            {
              "id"  :  "410324",
              "aname"  :  "栾川县"
            },
            {
              "id"  :  "410325",
              "aname"  :  "嵩县"
            },
            {
              "id"  :  "410326",
              "aname"  :  "汝阳县"
            },
            {
              "id"  :  "410327",
              "aname"  :  "宜阳县"
            },
            {
              "id"  :  "410328",
              "aname"  :  "洛宁县"
            },
            {
              "id"  :  "410329",
              "aname"  :  "伊川县"
            },
            {
              "id"  :  "410381",
              "aname"  :  "偃师市"
            }
          ]
        },
        {
          "id"  :  "410400",
          "name"  :  "平顶山市",
          "area"  :  [
            {
              "id"  :  "410402",
              "aname"  :  "新华区"
            },
            {
              "id"  :  "410403",
              "aname"  :  "卫东区"
            },
            {
              "id"  :  "410404",
              "aname"  :  "石龙区"
            },
            {
              "id"  :  "410411",
              "aname"  :  "湛河区"
            },
            {
              "id"  :  "410421",
              "aname"  :  "宝丰县"
            },
            {
              "id"  :  "410422",
              "aname"  :  "叶县"
            },
            {
              "id"  :  "410423",
              "aname"  :  "鲁山县"
            },
            {
              "id"  :  "410425",
              "aname"  :  "郏县"
            },
            {
              "id"  :  "410481",
              "aname"  :  "舞钢市"
            },
            {
              "id"  :  "410482",
              "aname"  :  "汝州市"
            }
          ]
        },
        {
          "id"  :  "410500",
          "name"  :  "安阳市",
          "area"  :  [
            {
              "id"  :  "410502",
              "aname"  :  "文峰区"
            },
            {
              "id"  :  "410503",
              "aname"  :  "北关区"
            },
            {
              "id"  :  "410505",
              "aname"  :  "殷都区"
            },
            {
              "id"  :  "410506",
              "aname"  :  "龙安区"
            },
            {
              "id"  :  "410522",
              "aname"  :  "安阳县"
            },
            {
              "id"  :  "410523",
              "aname"  :  "汤阴县"
            },
            {
              "id"  :  "410526",
              "aname"  :  "滑县"
            },
            {
              "id"  :  "410527",
              "aname"  :  "内黄县"
            },
            {
              "id"  :  "410581",
              "aname"  :  "林州市"
            }
          ]
        },
        {
          "id"  :  "410600",
          "name"  :  "鹤壁市",
          "area"  :  [
            {
              "id"  :  "410602",
              "aname"  :  "鹤山区"
            },
            {
              "id"  :  "410603",
              "aname"  :  "山城区"
            },
            {
              "id"  :  "410611",
              "aname"  :  "淇滨区"
            },
            {
              "id"  :  "410621",
              "aname"  :  "浚县"
            },
            {
              "id"  :  "410622",
              "aname"  :  "淇县"
            }
          ]
        },
        {
          "id"  :  "410700",
          "name"  :  "新乡市",
          "area"  :  [
            {
              "id"  :  "410702",
              "aname"  :  "红旗区"
            },
            {
              "id"  :  "410703",
              "aname"  :  "卫滨区"
            },
            {
              "id"  :  "410704",
              "aname"  :  "凤泉区"
            },
            {
              "id"  :  "410711",
              "aname"  :  "牧野区"
            },
            {
              "id"  :  "410721",
              "aname"  :  "新乡县"
            },
            {
              "id"  :  "410724",
              "aname"  :  "获嘉县"
            },
            {
              "id"  :  "410725",
              "aname"  :  "原阳县"
            },
            {
              "id"  :  "410726",
              "aname"  :  "延津县"
            },
            {
              "id"  :  "410727",
              "aname"  :  "封丘县"
            },
            {
              "id"  :  "410728",
              "aname"  :  "长垣县"
            },
            {
              "id"  :  "410781",
              "aname"  :  "卫辉市"
            },
            {
              "id"  :  "410782",
              "aname"  :  "辉县市"
            }
          ]
        },
        {
          "id"  :  "410800",
          "name"  :  "焦作市",
          "area"  :  [
            {
              "id"  :  "410802",
              "aname"  :  "解放区"
            },
            {
              "id"  :  "410803",
              "aname"  :  "中站区"
            },
            {
              "id"  :  "410804",
              "aname"  :  "马村区"
            },
            {
              "id"  :  "410811",
              "aname"  :  "山阳区"
            },
            {
              "id"  :  "410821",
              "aname"  :  "修武县"
            },
            {
              "id"  :  "410822",
              "aname"  :  "博爱县"
            },
            {
              "id"  :  "410823",
              "aname"  :  "武陟县"
            },
            {
              "id"  :  "410825",
              "aname"  :  "温县"
            },
            {
              "id"  :  "410882",
              "aname"  :  "沁阳市"
            },
            {
              "id"  :  "410883",
              "aname"  :  "孟州市"
            }
          ]
        },
        {
          "id"  :  "410900",
          "name"  :  "濮阳市",
          "area"  :  [
            {
              "id"  :  "410902",
              "aname"  :  "华龙区"
            },
            {
              "id"  :  "410922",
              "aname"  :  "清丰县"
            },
            {
              "id"  :  "410923",
              "aname"  :  "南乐县"
            },
            {
              "id"  :  "410926",
              "aname"  :  "范县"
            },
            {
              "id"  :  "410927",
              "aname"  :  "台前县"
            },
            {
              "id"  :  "410928",
              "aname"  :  "濮阳县"
            }
          ]
        },
        {
          "id"  :  "411000",
          "name"  :  "许昌市",
          "area"  :  [
            {
              "id"  :  "411002",
              "aname"  :  "魏都区"
            },
            {
              "id"  :  "411023",
              "aname"  :  "许昌县"
            },
            {
              "id"  :  "411024",
              "aname"  :  "鄢陵县"
            },
            {
              "id"  :  "411025",
              "aname"  :  "襄城县"
            },
            {
              "id"  :  "411081",
              "aname"  :  "禹州市"
            },
            {
              "id"  :  "411082",
              "aname"  :  "长葛市"
            }
          ]
        },
        {
          "id"  :  "411100",
          "name"  :  "漯河市",
          "area"  :  [
            {
              "id"  :  "411102",
              "aname"  :  "源汇区"
            },
            {
              "id"  :  "411103",
              "aname"  :  "郾城区"
            },
            {
              "id"  :  "411104",
              "aname"  :  "召陵区"
            },
            {
              "id"  :  "411121",
              "aname"  :  "舞阳县"
            },
            {
              "id"  :  "411122",
              "aname"  :  "临颍县"
            }
          ]
        },
        {
          "id"  :  "411200",
          "name"  :  "三门峡市",
          "area"  :  [
            {
              "id"  :  "411202",
              "aname"  :  "湖滨区"
            },
            {
              "id"  :  "411221",
              "aname"  :  "渑池县"
            },
            {
              "id"  :  "411222",
              "aname"  :  "陕县"
            },
            {
              "id"  :  "411224",
              "aname"  :  "卢氏县"
            },
            {
              "id"  :  "411281",
              "aname"  :  "义马市"
            },
            {
              "id"  :  "411282",
              "aname"  :  "灵宝市"
            }
          ]
        },
        {
          "id"  :  "411300",
          "name"  :  "南阳市",
          "area"  :  [
            {
              "id"  :  "411302",
              "aname"  :  "宛城区"
            },
            {
              "id"  :  "411303",
              "aname"  :  "卧龙区"
            },
            {
              "id"  :  "411321",
              "aname"  :  "南召县"
            },
            {
              "id"  :  "411322",
              "aname"  :  "方城县"
            },
            {
              "id"  :  "411323",
              "aname"  :  "西峡县"
            },
            {
              "id"  :  "411324",
              "aname"  :  "镇平县"
            },
            {
              "id"  :  "411325",
              "aname"  :  "内乡县"
            },
            {
              "id"  :  "411326",
              "aname"  :  "淅川县"
            },
            {
              "id"  :  "411327",
              "aname"  :  "社旗县"
            },
            {
              "id"  :  "411328",
              "aname"  :  "唐河县"
            },
            {
              "id"  :  "411329",
              "aname"  :  "新野县"
            },
            {
              "id"  :  "411330",
              "aname"  :  "桐柏县"
            },
            {
              "id"  :  "411381",
              "aname"  :  "邓州市"
            }
          ]
        },
        {
          "id"  :  "411400",
          "name"  :  "商丘市",
          "area"  :  [
            {
              "id"  :  "411402",
              "aname"  :  "梁园区"
            },
            {
              "id"  :  "411403",
              "aname"  :  "睢阳区"
            },
            {
              "id"  :  "411421",
              "aname"  :  "民权县"
            },
            {
              "id"  :  "411422",
              "aname"  :  "睢县"
            },
            {
              "id"  :  "411423",
              "aname"  :  "宁陵县"
            },
            {
              "id"  :  "411424",
              "aname"  :  "柘城县"
            },
            {
              "id"  :  "411425",
              "aname"  :  "虞城县"
            },
            {
              "id"  :  "411426",
              "aname"  :  "夏邑县"
            },
            {
              "id"  :  "411481",
              "aname"  :  "永城市"
            }
          ]
        },
        {
          "id"  :  "411500",
          "name"  :  "信阳市",
          "area"  :  [
            {
              "id"  :  "411502",
              "aname"  :  "浉河区"
            },
            {
              "id"  :  "411503",
              "aname"  :  "平桥区"
            },
            {
              "id"  :  "411521",
              "aname"  :  "罗山县"
            },
            {
              "id"  :  "411522",
              "aname"  :  "光山县"
            },
            {
              "id"  :  "411523",
              "aname"  :  "新县"
            },
            {
              "id"  :  "411524",
              "aname"  :  "商城县"
            },
            {
              "id"  :  "411525",
              "aname"  :  "固始县"
            },
            {
              "id"  :  "411526",
              "aname"  :  "潢川县"
            },
            {
              "id"  :  "411527",
              "aname"  :  "淮滨县"
            },
            {
              "id"  :  "411528",
              "aname"  :  "息县"
            }
          ]
        },
        {
          "id"  :  "411600",
          "name"  :  "周口市",
          "area"  :  [
            {
              "id"  :  "411602",
              "aname"  :  "川汇区"
            },
            {
              "id"  :  "411621",
              "aname"  :  "扶沟县"
            },
            {
              "id"  :  "411622",
              "aname"  :  "西华县"
            },
            {
              "id"  :  "411623",
              "aname"  :  "商水县"
            },
            {
              "id"  :  "411624",
              "aname"  :  "沈丘县"
            },
            {
              "id"  :  "411625",
              "aname"  :  "郸城县"
            },
            {
              "id"  :  "411626",
              "aname"  :  "淮阳县"
            },
            {
              "id"  :  "411627",
              "aname"  :  "太康县"
            },
            {
              "id"  :  "411628",
              "aname"  :  "鹿邑县"
            },
            {
              "id"  :  "411681",
              "aname"  :  "项城市"
            }
          ]
        },
        {
          "id"  :  "411700",
          "name"  :  "驻马店市",
          "area"  :  [
            {
              "id"  :  "411702",
              "aname"  :  "驿城区"
            },
            {
              "id"  :  "411721",
              "aname"  :  "西平县"
            },
            {
              "id"  :  "411722",
              "aname"  :  "上蔡县"
            },
            {
              "id"  :  "411723",
              "aname"  :  "平舆县"
            },
            {
              "id"  :  "411724",
              "aname"  :  "正阳县"
            },
            {
              "id"  :  "411725",
              "aname"  :  "确山县"
            },
            {
              "id"  :  "411726",
              "aname"  :  "泌阳县"
            },
            {
              "id"  :  "411727",
              "aname"  :  "汝南县"
            },
            {
              "id"  :  "411728",
              "aname"  :  "遂平县"
            },
            {
              "id"  :  "411729",
              "aname"  :  "新蔡县"
            }
          ]
        },
        {
          "id"  :  "419000",
          "name"  :  "省直辖",
          "area"  :  [
            {
              "id"  :  "419001",
              "aname"  :  "济源市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "420000",
      "name"  :  "湖北省",
      "city"  :  [
        {
          "id"  :  "420100",
          "name"  :  "武汉市",
          "area"  :  [
            {
              "id"  :  "420102",
              "aname"  :  "江岸区"
            },
            {
              "id"  :  "420103",
              "aname"  :  "江汉区"
            },
            {
              "id"  :  "420104",
              "aname"  :  "硚口区"
            },
            {
              "id"  :  "420105",
              "aname"  :  "汉阳区"
            },
            {
              "id"  :  "420106",
              "aname"  :  "武昌区"
            },
            {
              "id"  :  "420107",
              "aname"  :  "青山区"
            },
            {
              "id"  :  "420111",
              "aname"  :  "洪山区"
            },
            {
              "id"  :  "420112",
              "aname"  :  "东西湖区"
            },
            {
              "id"  :  "420113",
              "aname"  :  "汉南区"
            },
            {
              "id"  :  "420114",
              "aname"  :  "蔡甸区"
            },
            {
              "id"  :  "420115",
              "aname"  :  "江夏区"
            },
            {
              "id"  :  "420116",
              "aname"  :  "黄陂区"
            },
            {
              "id"  :  "420117",
              "aname"  :  "新洲区"
            }
          ]
        },
        {
          "id"  :  "420200",
          "name"  :  "黄石市",
          "area"  :  [
            {
              "id"  :  "420202",
              "aname"  :  "黄石港区"
            },
            {
              "id"  :  "420203",
              "aname"  :  "西塞山区"
            },
            {
              "id"  :  "420204",
              "aname"  :  "下陆区"
            },
            {
              "id"  :  "420205",
              "aname"  :  "铁山区"
            },
            {
              "id"  :  "420222",
              "aname"  :  "阳新县"
            },
            {
              "id"  :  "420281",
              "aname"  :  "大冶市"
            }
          ]
        },
        {
          "id"  :  "420300",
          "name"  :  "十堰市",
          "area"  :  [
            {
              "id"  :  "420302",
              "aname"  :  "茅箭区"
            },
            {
              "id"  :  "420303",
              "aname"  :  "张湾区"
            },
            {
              "id"  :  "420321",
              "aname"  :  "郧县"
            },
            {
              "id"  :  "420322",
              "aname"  :  "郧西县"
            },
            {
              "id"  :  "420323",
              "aname"  :  "竹山县"
            },
            {
              "id"  :  "420324",
              "aname"  :  "竹溪县"
            },
            {
              "id"  :  "420325",
              "aname"  :  "房县"
            },
            {
              "id"  :  "420381",
              "aname"  :  "丹江口市"
            }
          ]
        },
        {
          "id"  :  "420500",
          "name"  :  "宜昌市",
          "area"  :  [
            {
              "id"  :  "420502",
              "aname"  :  "西陵区"
            },
            {
              "id"  :  "420503",
              "aname"  :  "伍家岗区"
            },
            {
              "id"  :  "420504",
              "aname"  :  "点军区"
            },
            {
              "id"  :  "420505",
              "aname"  :  "猇亭区"
            },
            {
              "id"  :  "420506",
              "aname"  :  "夷陵区"
            },
            {
              "id"  :  "420525",
              "aname"  :  "远安县"
            },
            {
              "id"  :  "420526",
              "aname"  :  "兴山县"
            },
            {
              "id"  :  "420527",
              "aname"  :  "秭归县"
            },
            {
              "id"  :  "420528",
              "aname"  :  "长阳土家族自治县"
            },
            {
              "id"  :  "420529",
              "aname"  :  "五峰土家族自治县"
            },
            {
              "id"  :  "420581",
              "aname"  :  "宜都市"
            },
            {
              "id"  :  "420582",
              "aname"  :  "当阳市"
            },
            {
              "id"  :  "420583",
              "aname"  :  "枝江市"
            }
          ]
        },
        {
          "id"  :  "420600",
          "name"  :  "襄阳市",
          "area"  :  [
            {
              "id"  :  "420602",
              "aname"  :  "襄城区"
            },
            {
              "id"  :  "420606",
              "aname"  :  "樊城区"
            },
            {
              "id"  :  "420607",
              "aname"  :  "襄州区"
            },
            {
              "id"  :  "420624",
              "aname"  :  "南漳县"
            },
            {
              "id"  :  "420625",
              "aname"  :  "谷城县"
            },
            {
              "id"  :  "420626",
              "aname"  :  "保康县"
            },
            {
              "id"  :  "420682",
              "aname"  :  "老河口市"
            },
            {
              "id"  :  "420683",
              "aname"  :  "枣阳市"
            },
            {
              "id"  :  "420684",
              "aname"  :  "宜城市"
            }
          ]
        },
        {
          "id"  :  "420700",
          "name"  :  "鄂州市",
          "area"  :  [
            {
              "id"  :  "420702",
              "aname"  :  "梁子湖区"
            },
            {
              "id"  :  "420703",
              "aname"  :  "华容区"
            },
            {
              "id"  :  "420704",
              "aname"  :  "鄂城区"
            }
          ]
        },
        {
          "id"  :  "420800",
          "name"  :  "荆门市",
          "area"  :  [
            {
              "id"  :  "420802",
              "aname"  :  "东宝区"
            },
            {
              "id"  :  "420804",
              "aname"  :  "掇刀区"
            },
            {
              "id"  :  "420821",
              "aname"  :  "京山县"
            },
            {
              "id"  :  "420822",
              "aname"  :  "沙洋县"
            },
            {
              "id"  :  "420881",
              "aname"  :  "钟祥市"
            }
          ]
        },
        {
          "id"  :  "420900",
          "name"  :  "孝感市",
          "area"  :  [
            {
              "id"  :  "420902",
              "aname"  :  "孝南区"
            },
            {
              "id"  :  "420921",
              "aname"  :  "孝昌县"
            },
            {
              "id"  :  "420922",
              "aname"  :  "大悟县"
            },
            {
              "id"  :  "420923",
              "aname"  :  "云梦县"
            },
            {
              "id"  :  "420981",
              "aname"  :  "应城市"
            },
            {
              "id"  :  "420982",
              "aname"  :  "安陆市"
            },
            {
              "id"  :  "420984",
              "aname"  :  "汉川市"
            }
          ]
        },
        {
          "id"  :  "421000",
          "name"  :  "荆州市",
          "area"  :  [
            {
              "id"  :  "421002",
              "aname"  :  "沙市区"
            },
            {
              "id"  :  "421003",
              "aname"  :  "荆州区"
            },
            {
              "id"  :  "421022",
              "aname"  :  "公安县"
            },
            {
              "id"  :  "421023",
              "aname"  :  "监利县"
            },
            {
              "id"  :  "421024",
              "aname"  :  "江陵县"
            },
            {
              "id"  :  "421081",
              "aname"  :  "石首市"
            },
            {
              "id"  :  "421083",
              "aname"  :  "洪湖市"
            },
            {
              "id"  :  "421087",
              "aname"  :  "松滋市"
            }
          ]
        },
        {
          "id"  :  "421100",
          "name"  :  "黄冈市",
          "area"  :  [
            {
              "id"  :  "421102",
              "aname"  :  "黄州区"
            },
            {
              "id"  :  "421121",
              "aname"  :  "团风县"
            },
            {
              "id"  :  "421122",
              "aname"  :  "红安县"
            },
            {
              "id"  :  "421123",
              "aname"  :  "罗田县"
            },
            {
              "id"  :  "421124",
              "aname"  :  "英山县"
            },
            {
              "id"  :  "421125",
              "aname"  :  "浠水县"
            },
            {
              "id"  :  "421126",
              "aname"  :  "蕲春县"
            },
            {
              "id"  :  "421127",
              "aname"  :  "黄梅县"
            },
            {
              "id"  :  "421181",
              "aname"  :  "麻城市"
            },
            {
              "id"  :  "421182",
              "aname"  :  "武穴市"
            }
          ]
        },
        {
          "id"  :  "421200",
          "name"  :  "咸宁市",
          "area"  :  [
            {
              "id"  :  "421202",
              "aname"  :  "咸安区"
            },
            {
              "id"  :  "421221",
              "aname"  :  "嘉鱼县"
            },
            {
              "id"  :  "421222",
              "aname"  :  "通城县"
            },
            {
              "id"  :  "421223",
              "aname"  :  "崇阳县"
            },
            {
              "id"  :  "421224",
              "aname"  :  "通山县"
            },
            {
              "id"  :  "421281",
              "aname"  :  "赤壁市"
            }
          ]
        },
        {
          "id"  :  "421300",
          "name"  :  "随州市",
          "area"  :  [
            {
              "id"  :  "421303",
              "aname"  :  "曾都区"
            },
            {
              "id"  :  "421321",
              "aname"  :  "随县"
            },
            {
              "id"  :  "421381",
              "aname"  :  "广水市"
            }
          ]
        },
        {
          "id"  :  "422800",
          "name"  :  "恩施土家族苗族自治州",
          "area"  :  [
            {
              "id"  :  "422801",
              "aname"  :  "恩施市"
            },
            {
              "id"  :  "422802",
              "aname"  :  "利川市"
            },
            {
              "id"  :  "422822",
              "aname"  :  "建始县"
            },
            {
              "id"  :  "422823",
              "aname"  :  "巴东县"
            },
            {
              "id"  :  "422825",
              "aname"  :  "宣恩县"
            },
            {
              "id"  :  "422826",
              "aname"  :  "咸丰县"
            },
            {
              "id"  :  "422827",
              "aname"  :  "来凤县"
            },
            {
              "id"  :  "422828",
              "aname"  :  "鹤峰县"
            }
          ]
        },
        {
          "id"  :  "429000",
          "name"  :  "省直辖",
          "area"  :  [
            {
              "id"  :  "429004",
              "aname"  :  "仙桃市"
            },
            {
              "id"  :  "429005",
              "aname"  :  "潜江市"
            },
            {
              "id"  :  "429006",
              "aname"  :  "天门市"
            },
            {
              "id"  :  "429021",
              "aname"  :  "神农架林区"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "430000",
      "name"  :  "湖南省",
      "city"  :  [
        {
          "id"  :  "430100",
          "name"  :  "长沙市",
          "area"  :  [
            {
              "id"  :  "430102",
              "aname"  :  "芙蓉区"
            },
            {
              "id"  :  "430103",
              "aname"  :  "天心区"
            },
            {
              "id"  :  "430104",
              "aname"  :  "岳麓区"
            },
            {
              "id"  :  "430105",
              "aname"  :  "开福区"
            },
            {
              "id"  :  "430111",
              "aname"  :  "雨花区"
            },
            {
              "id"  :  "430112",
              "aname"  :  "望城区"
            },
            {
              "id"  :  "430121",
              "aname"  :  "长沙县"
            },
            {
              "id"  :  "430124",
              "aname"  :  "宁乡县"
            },
            {
              "id"  :  "430181",
              "aname"  :  "浏阳市"
            }
          ]
        },
        {
          "id"  :  "430200",
          "name"  :  "株洲市",
          "area"  :  [
            {
              "id"  :  "430202",
              "aname"  :  "荷塘区"
            },
            {
              "id"  :  "430203",
              "aname"  :  "芦淞区"
            },
            {
              "id"  :  "430204",
              "aname"  :  "石峰区"
            },
            {
              "id"  :  "430211",
              "aname"  :  "天元区"
            },
            {
              "id"  :  "430221",
              "aname"  :  "株洲县"
            },
            {
              "id"  :  "430223",
              "aname"  :  "攸县"
            },
            {
              "id"  :  "430224",
              "aname"  :  "茶陵县"
            },
            {
              "id"  :  "430225",
              "aname"  :  "炎陵县"
            },
            {
              "id"  :  "430281",
              "aname"  :  "醴陵市"
            }
          ]
        },
        {
          "id"  :  "430300",
          "name"  :  "湘潭市",
          "area"  :  [
            {
              "id"  :  "430302",
              "aname"  :  "雨湖区"
            },
            {
              "id"  :  "430304",
              "aname"  :  "岳塘区"
            },
            {
              "id"  :  "430321",
              "aname"  :  "湘潭县"
            },
            {
              "id"  :  "430381",
              "aname"  :  "湘乡市"
            },
            {
              "id"  :  "430382",
              "aname"  :  "韶山市"
            }
          ]
        },
        {
          "id"  :  "430400",
          "name"  :  "衡阳市",
          "area"  :  [
            {
              "id"  :  "430405",
              "aname"  :  "珠晖区"
            },
            {
              "id"  :  "430406",
              "aname"  :  "雁峰区"
            },
            {
              "id"  :  "430407",
              "aname"  :  "石鼓区"
            },
            {
              "id"  :  "430408",
              "aname"  :  "蒸湘区"
            },
            {
              "id"  :  "430412",
              "aname"  :  "南岳区"
            },
            {
              "id"  :  "430421",
              "aname"  :  "衡阳县"
            },
            {
              "id"  :  "430422",
              "aname"  :  "衡南县"
            },
            {
              "id"  :  "430423",
              "aname"  :  "衡山县"
            },
            {
              "id"  :  "430424",
              "aname"  :  "衡东县"
            },
            {
              "id"  :  "430426",
              "aname"  :  "祁东县"
            },
            {
              "id"  :  "430481",
              "aname"  :  "耒阳市"
            },
            {
              "id"  :  "430482",
              "aname"  :  "常宁市"
            }
          ]
        },
        {
          "id"  :  "430500",
          "name"  :  "邵阳市",
          "area"  :  [
            {
              "id"  :  "430502",
              "aname"  :  "双清区"
            },
            {
              "id"  :  "430503",
              "aname"  :  "大祥区"
            },
            {
              "id"  :  "430511",
              "aname"  :  "北塔区"
            },
            {
              "id"  :  "430521",
              "aname"  :  "邵东县"
            },
            {
              "id"  :  "430522",
              "aname"  :  "新邵县"
            },
            {
              "id"  :  "430523",
              "aname"  :  "邵阳县"
            },
            {
              "id"  :  "430524",
              "aname"  :  "隆回县"
            },
            {
              "id"  :  "430525",
              "aname"  :  "洞口县"
            },
            {
              "id"  :  "430527",
              "aname"  :  "绥宁县"
            },
            {
              "id"  :  "430528",
              "aname"  :  "新宁县"
            },
            {
              "id"  :  "430529",
              "aname"  :  "城步苗族自治县"
            },
            {
              "id"  :  "430581",
              "aname"  :  "武冈市"
            }
          ]
        },
        {
          "id"  :  "430600",
          "name"  :  "岳阳市",
          "area"  :  [
            {
              "id"  :  "430602",
              "aname"  :  "岳阳楼区"
            },
            {
              "id"  :  "430603",
              "aname"  :  "云溪区"
            },
            {
              "id"  :  "430611",
              "aname"  :  "君山区"
            },
            {
              "id"  :  "430621",
              "aname"  :  "岳阳县"
            },
            {
              "id"  :  "430623",
              "aname"  :  "华容县"
            },
            {
              "id"  :  "430624",
              "aname"  :  "湘阴县"
            },
            {
              "id"  :  "430626",
              "aname"  :  "平江县"
            },
            {
              "id"  :  "430681",
              "aname"  :  "汨罗市"
            },
            {
              "id"  :  "430682",
              "aname"  :  "临湘市"
            }
          ]
        },
        {
          "id"  :  "430700",
          "name"  :  "常德市",
          "area"  :  [
            {
              "id"  :  "430702",
              "aname"  :  "武陵区"
            },
            {
              "id"  :  "430703",
              "aname"  :  "鼎城区"
            },
            {
              "id"  :  "430721",
              "aname"  :  "安乡县"
            },
            {
              "id"  :  "430722",
              "aname"  :  "汉寿县"
            },
            {
              "id"  :  "430723",
              "aname"  :  "澧县"
            },
            {
              "id"  :  "430724",
              "aname"  :  "临澧县"
            },
            {
              "id"  :  "430725",
              "aname"  :  "桃源县"
            },
            {
              "id"  :  "430726",
              "aname"  :  "石门县"
            },
            {
              "id"  :  "430781",
              "aname"  :  "津市市"
            }
          ]
        },
        {
          "id"  :  "430800",
          "name"  :  "张家界市",
          "area"  :  [
            {
              "id"  :  "430802",
              "aname"  :  "永定区"
            },
            {
              "id"  :  "430811",
              "aname"  :  "武陵源区"
            },
            {
              "id"  :  "430821",
              "aname"  :  "慈利县"
            },
            {
              "id"  :  "430822",
              "aname"  :  "桑植县"
            }
          ]
        },
        {
          "id"  :  "430900",
          "name"  :  "益阳市",
          "area"  :  [
            {
              "id"  :  "430902",
              "aname"  :  "资阳区"
            },
            {
              "id"  :  "430903",
              "aname"  :  "赫山区"
            },
            {
              "id"  :  "430921",
              "aname"  :  "南县"
            },
            {
              "id"  :  "430922",
              "aname"  :  "桃江县"
            },
            {
              "id"  :  "430923",
              "aname"  :  "安化县"
            },
            {
              "id"  :  "430981",
              "aname"  :  "沅江市"
            }
          ]
        },
        {
          "id"  :  "431000",
          "name"  :  "郴州市",
          "area"  :  [
            {
              "id"  :  "431002",
              "aname"  :  "北湖区"
            },
            {
              "id"  :  "431003",
              "aname"  :  "苏仙区"
            },
            {
              "id"  :  "431021",
              "aname"  :  "桂阳县"
            },
            {
              "id"  :  "431022",
              "aname"  :  "宜章县"
            },
            {
              "id"  :  "431023",
              "aname"  :  "永兴县"
            },
            {
              "id"  :  "431024",
              "aname"  :  "嘉禾县"
            },
            {
              "id"  :  "431025",
              "aname"  :  "临武县"
            },
            {
              "id"  :  "431026",
              "aname"  :  "汝城县"
            },
            {
              "id"  :  "431027",
              "aname"  :  "桂东县"
            },
            {
              "id"  :  "431028",
              "aname"  :  "安仁县"
            },
            {
              "id"  :  "431081",
              "aname"  :  "资兴市"
            }
          ]
        },
        {
          "id"  :  "431100",
          "name"  :  "永州市",
          "area"  :  [
            {
              "id"  :  "431102",
              "aname"  :  "零陵区"
            },
            {
              "id"  :  "431103",
              "aname"  :  "冷水滩区"
            },
            {
              "id"  :  "431121",
              "aname"  :  "祁阳县"
            },
            {
              "id"  :  "431122",
              "aname"  :  "东安县"
            },
            {
              "id"  :  "431123",
              "aname"  :  "双牌县"
            },
            {
              "id"  :  "431124",
              "aname"  :  "道县"
            },
            {
              "id"  :  "431125",
              "aname"  :  "江永县"
            },
            {
              "id"  :  "431126",
              "aname"  :  "宁远县"
            },
            {
              "id"  :  "431127",
              "aname"  :  "蓝山县"
            },
            {
              "id"  :  "431128",
              "aname"  :  "新田县"
            },
            {
              "id"  :  "431129",
              "aname"  :  "江华瑶族自治县"
            }
          ]
        },
        {
          "id"  :  "431200",
          "name"  :  "怀化市",
          "area"  :  [
            {
              "id"  :  "431202",
              "aname"  :  "鹤城区"
            },
            {
              "id"  :  "431221",
              "aname"  :  "中方县"
            },
            {
              "id"  :  "431222",
              "aname"  :  "沅陵县"
            },
            {
              "id"  :  "431223",
              "aname"  :  "辰溪县"
            },
            {
              "id"  :  "431224",
              "aname"  :  "溆浦县"
            },
            {
              "id"  :  "431225",
              "aname"  :  "会同县"
            },
            {
              "id"  :  "431226",
              "aname"  :  "麻阳苗族自治县"
            },
            {
              "id"  :  "431227",
              "aname"  :  "新晃侗族自治县"
            },
            {
              "id"  :  "431228",
              "aname"  :  "芷江侗族自治县"
            },
            {
              "id"  :  "431229",
              "aname"  :  "靖州苗族侗族自治县"
            },
            {
              "id"  :  "431230",
              "aname"  :  "通道侗族自治县"
            },
            {
              "id"  :  "431281",
              "aname"  :  "洪江市"
            }
          ]
        },
        {
          "id"  :  "431300",
          "name"  :  "娄底市",
          "area"  :  [
            {
              "id"  :  "431302",
              "aname"  :  "娄星区"
            },
            {
              "id"  :  "431321",
              "aname"  :  "双峰县"
            },
            {
              "id"  :  "431322",
              "aname"  :  "新化县"
            },
            {
              "id"  :  "431381",
              "aname"  :  "冷水江市"
            },
            {
              "id"  :  "431382",
              "aname"  :  "涟源市"
            }
          ]
        },
        {
          "id"  :  "433100",
          "name"  :  "湘西土家族苗族自治州",
          "area"  :  [
            {
              "id"  :  "433101",
              "aname"  :  "吉首市"
            },
            {
              "id"  :  "433122",
              "aname"  :  "泸溪县"
            },
            {
              "id"  :  "433123",
              "aname"  :  "凤凰县"
            },
            {
              "id"  :  "433124",
              "aname"  :  "花垣县"
            },
            {
              "id"  :  "433125",
              "aname"  :  "保靖县"
            },
            {
              "id"  :  "433126",
              "aname"  :  "古丈县"
            },
            {
              "id"  :  "433127",
              "aname"  :  "永顺县"
            },
            {
              "id"  :  "433130",
              "aname"  :  "龙山县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "440000",
      "name"  :  "广东省",
      "city"  :  [
        {
          "id"  :  "440100",
          "name"  :  "广州市",
          "area"  :  [
            {
              "id"  :  "440103",
              "aname"  :  "荔湾区"
            },
            {
              "id"  :  "440104",
              "aname"  :  "越秀区"
            },
            {
              "id"  :  "440105",
              "aname"  :  "海珠区"
            },
            {
              "id"  :  "440106",
              "aname"  :  "天河区"
            },
            {
              "id"  :  "440111",
              "aname"  :  "白云区"
            },
            {
              "id"  :  "440112",
              "aname"  :  "黄埔区"
            },
            {
              "id"  :  "440113",
              "aname"  :  "番禺区"
            },
            {
              "id"  :  "440114",
              "aname"  :  "花都区"
            },
            {
              "id"  :  "440115",
              "aname"  :  "南沙区"
            },
            {
              "id"  :  "440116",
              "aname"  :  "萝岗区"
            },
            {
              "id"  :  "440183",
              "aname"  :  "增城市"
            },
            {
              "id"  :  "440184",
              "aname"  :  "从化市"
            }
          ]
        },
        {
          "id"  :  "440200",
          "name"  :  "韶关市",
          "area"  :  [
            {
              "id"  :  "440203",
              "aname"  :  "武江区"
            },
            {
              "id"  :  "440204",
              "aname"  :  "浈江区"
            },
            {
              "id"  :  "440205",
              "aname"  :  "曲江区"
            },
            {
              "id"  :  "440222",
              "aname"  :  "始兴县"
            },
            {
              "id"  :  "440224",
              "aname"  :  "仁化县"
            },
            {
              "id"  :  "440229",
              "aname"  :  "翁源县"
            },
            {
              "id"  :  "440232",
              "aname"  :  "乳源瑶族自治县"
            },
            {
              "id"  :  "440233",
              "aname"  :  "新丰县"
            },
            {
              "id"  :  "440281",
              "aname"  :  "乐昌市"
            },
            {
              "id"  :  "440282",
              "aname"  :  "南雄市"
            }
          ]
        },
        {
          "id"  :  "440300",
          "name"  :  "深圳市",
          "area"  :  [
            {
              "id"  :  "440303",
              "aname"  :  "罗湖区"
            },
            {
              "id"  :  "440304",
              "aname"  :  "福田区"
            },
            {
              "id"  :  "440305",
              "aname"  :  "南山区"
            },
            {
              "id"  :  "440306",
              "aname"  :  "宝安区"
            },
            {
              "id"  :  "440307",
              "aname"  :  "龙岗区"
            },
            {
              "id"  :  "440308",
              "aname"  :  "盐田区"
            }
          ]
        },
        {
          "id"  :  "440400",
          "name"  :  "珠海市",
          "area"  :  [
            {
              "id"  :  "440402",
              "aname"  :  "香洲区"
            },
            {
              "id"  :  "440403",
              "aname"  :  "斗门区"
            },
            {
              "id"  :  "440404",
              "aname"  :  "金湾区"
            }
          ]
        },
        {
          "id"  :  "440500",
          "name"  :  "汕头市",
          "area"  :  [
            {
              "id"  :  "440507",
              "aname"  :  "龙湖区"
            },
            {
              "id"  :  "440511",
              "aname"  :  "金平区"
            },
            {
              "id"  :  "440512",
              "aname"  :  "濠江区"
            },
            {
              "id"  :  "440513",
              "aname"  :  "潮阳区"
            },
            {
              "id"  :  "440514",
              "aname"  :  "潮南区"
            },
            {
              "id"  :  "440515",
              "aname"  :  "澄海区"
            },
            {
              "id"  :  "440523",
              "aname"  :  "南澳县"
            }
          ]
        },
        {
          "id"  :  "440600",
          "name"  :  "佛山市",
          "area"  :  [
            {
              "id"  :  "440604",
              "aname"  :  "禅城区"
            },
            {
              "id"  :  "440605",
              "aname"  :  "南海区"
            },
            {
              "id"  :  "440606",
              "aname"  :  "顺德区"
            },
            {
              "id"  :  "440607",
              "aname"  :  "三水区"
            },
            {
              "id"  :  "440608",
              "aname"  :  "高明区"
            }
          ]
        },
        {
          "id"  :  "440700",
          "name"  :  "江门市",
          "area"  :  [
            {
              "id"  :  "440703",
              "aname"  :  "蓬江区"
            },
            {
              "id"  :  "440704",
              "aname"  :  "江海区"
            },
            {
              "id"  :  "440705",
              "aname"  :  "新会区"
            },
            {
              "id"  :  "440781",
              "aname"  :  "台山市"
            },
            {
              "id"  :  "440783",
              "aname"  :  "开平市"
            },
            {
              "id"  :  "440784",
              "aname"  :  "鹤山市"
            },
            {
              "id"  :  "440785",
              "aname"  :  "恩平市"
            }
          ]
        },
        {
          "id"  :  "440800",
          "name"  :  "湛江市",
          "area"  :  [
            {
              "id"  :  "440802",
              "aname"  :  "赤坎区"
            },
            {
              "id"  :  "440803",
              "aname"  :  "霞山区"
            },
            {
              "id"  :  "440804",
              "aname"  :  "坡头区"
            },
            {
              "id"  :  "440811",
              "aname"  :  "麻章区"
            },
            {
              "id"  :  "440823",
              "aname"  :  "遂溪县"
            },
            {
              "id"  :  "440825",
              "aname"  :  "徐闻县"
            },
            {
              "id"  :  "440881",
              "aname"  :  "廉江市"
            },
            {
              "id"  :  "440882",
              "aname"  :  "雷州市"
            },
            {
              "id"  :  "440883",
              "aname"  :  "吴川市"
            }
          ]
        },
        {
          "id"  :  "440900",
          "name"  :  "茂名市",
          "area"  :  [
            {
              "id"  :  "440902",
              "aname"  :  "茂南区"
            },
            {
              "id"  :  "440903",
              "aname"  :  "茂港区"
            },
            {
              "id"  :  "440923",
              "aname"  :  "电白县"
            },
            {
              "id"  :  "440981",
              "aname"  :  "高州市"
            },
            {
              "id"  :  "440982",
              "aname"  :  "化州市"
            },
            {
              "id"  :  "440983",
              "aname"  :  "信宜市"
            }
          ]
        },
        {
          "id"  :  "441200",
          "name"  :  "肇庆市",
          "area"  :  [
            {
              "id"  :  "441202",
              "aname"  :  "端州区"
            },
            {
              "id"  :  "441203",
              "aname"  :  "鼎湖区"
            },
            {
              "id"  :  "441223",
              "aname"  :  "广宁县"
            },
            {
              "id"  :  "441224",
              "aname"  :  "怀集县"
            },
            {
              "id"  :  "441225",
              "aname"  :  "封开县"
            },
            {
              "id"  :  "441226",
              "aname"  :  "德庆县"
            },
            {
              "id"  :  "441283",
              "aname"  :  "高要市"
            },
            {
              "id"  :  "441284",
              "aname"  :  "四会市"
            }
          ]
        },
        {
          "id"  :  "441300",
          "name"  :  "惠州市",
          "area"  :  [
            {
              "id"  :  "441302",
              "aname"  :  "惠城区"
            },
            {
              "id"  :  "441303",
              "aname"  :  "惠阳区"
            },
            {
              "id"  :  "441322",
              "aname"  :  "博罗县"
            },
            {
              "id"  :  "441323",
              "aname"  :  "惠东县"
            },
            {
              "id"  :  "441324",
              "aname"  :  "龙门县"
            }
          ]
        },
        {
          "id"  :  "441400",
          "name"  :  "梅州市",
          "area"  :  [
            {
              "id"  :  "441402",
              "aname"  :  "梅江区"
            },
            {
              "id"  :  "441421",
              "aname"  :  "梅县"
            },
            {
              "id"  :  "441422",
              "aname"  :  "大埔县"
            },
            {
              "id"  :  "441423",
              "aname"  :  "丰顺县"
            },
            {
              "id"  :  "441424",
              "aname"  :  "五华县"
            },
            {
              "id"  :  "441426",
              "aname"  :  "平远县"
            },
            {
              "id"  :  "441427",
              "aname"  :  "蕉岭县"
            },
            {
              "id"  :  "441481",
              "aname"  :  "兴宁市"
            }
          ]
        },
        {
          "id"  :  "441500",
          "name"  :  "汕尾市",
          "area"  :  [
            {
              "id"  :  "441502",
              "aname"  :  "城区"
            },
            {
              "id"  :  "441521",
              "aname"  :  "海丰县"
            },
            {
              "id"  :  "441523",
              "aname"  :  "陆河县"
            },
            {
              "id"  :  "441581",
              "aname"  :  "陆丰市"
            }
          ]
        },
        {
          "id"  :  "441600",
          "name"  :  "河源市",
          "area"  :  [
            {
              "id"  :  "441602",
              "aname"  :  "源城区"
            },
            {
              "id"  :  "441621",
              "aname"  :  "紫金县"
            },
            {
              "id"  :  "441622",
              "aname"  :  "龙川县"
            },
            {
              "id"  :  "441623",
              "aname"  :  "连平县"
            },
            {
              "id"  :  "441624",
              "aname"  :  "和平县"
            },
            {
              "id"  :  "441625",
              "aname"  :  "东源县"
            }
          ]
        },
        {
          "id"  :  "441700",
          "name"  :  "阳江市",
          "area"  :  [
            {
              "id"  :  "441702",
              "aname"  :  "江城区"
            },
            {
              "id"  :  "441721",
              "aname"  :  "阳西县"
            },
            {
              "id"  :  "441723",
              "aname"  :  "阳东县"
            },
            {
              "id"  :  "441781",
              "aname"  :  "阳春市"
            }
          ]
        },
        {
          "id"  :  "441800",
          "name"  :  "清远市",
          "area"  :  [
            {
              "id"  :  "441802",
              "aname"  :  "清城区"
            },
            {
              "id"  :  "441821",
              "aname"  :  "佛冈县"
            },
            {
              "id"  :  "441823",
              "aname"  :  "阳山县"
            },
            {
              "id"  :  "441825",
              "aname"  :  "连山壮族瑶族自治县"
            },
            {
              "id"  :  "441826",
              "aname"  :  "连南瑶族自治县"
            },
            {
              "id"  :  "441827",
              "aname"  :  "清新县"
            },
            {
              "id"  :  "441881",
              "aname"  :  "英德市"
            },
            {
              "id"  :  "441882",
              "aname"  :  "连州市"
            }
          ]
        },
        {
          "id"  :  "441900",
          "name"  :  "东莞市",
          "area"  :  [
            {
              "id"  :  "441901",
              "aname"  :  "东莞市"
            }
          ]
        },
        {
          "id"  :  "442000",
          "name"  :  "中山市",
          "area"  :  [
            {
              "id"  :  "442001",
              "aname"  :  "中山市"
            }
          ]
        },
        {
          "id"  :  "445100",
          "name"  :  "潮州市",
          "area"  :  [
            {
              "id"  :  "445102",
              "aname"  :  "湘桥区"
            },
            {
              "id"  :  "445121",
              "aname"  :  "潮安县"
            },
            {
              "id"  :  "445122",
              "aname"  :  "饶平县"
            }
          ]
        },
        {
          "id"  :  "445200",
          "name"  :  "揭阳市",
          "area"  :  [
            {
              "id"  :  "445202",
              "aname"  :  "榕城区"
            },
            {
              "id"  :  "445221",
              "aname"  :  "揭东县"
            },
            {
              "id"  :  "445222",
              "aname"  :  "揭西县"
            },
            {
              "id"  :  "445224",
              "aname"  :  "惠来县"
            },
            {
              "id"  :  "445281",
              "aname"  :  "普宁市"
            }
          ]
        },
        {
          "id"  :  "445300",
          "name"  :  "云浮市",
          "area"  :  [
            {
              "id"  :  "445302",
              "aname"  :  "云城区"
            },
            {
              "id"  :  "445321",
              "aname"  :  "新兴县"
            },
            {
              "id"  :  "445322",
              "aname"  :  "郁南县"
            },
            {
              "id"  :  "445323",
              "aname"  :  "云安县"
            },
            {
              "id"  :  "445381",
              "aname"  :  "罗定市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "450000",
      "name"  :  "广西壮族自治区",
      "city"  :  [
        {
          "id"  :  "450100",
          "name"  :  "南宁市",
          "area"  :  [
            {
              "id"  :  "450102",
              "aname"  :  "兴宁区"
            },
            {
              "id"  :  "450103",
              "aname"  :  "青秀区"
            },
            {
              "id"  :  "450105",
              "aname"  :  "江南区"
            },
            {
              "id"  :  "450107",
              "aname"  :  "西乡塘区"
            },
            {
              "id"  :  "450108",
              "aname"  :  "良庆区"
            },
            {
              "id"  :  "450109",
              "aname"  :  "邕宁区"
            },
            {
              "id"  :  "450122",
              "aname"  :  "武鸣县"
            },
            {
              "id"  :  "450123",
              "aname"  :  "隆安县"
            },
            {
              "id"  :  "450124",
              "aname"  :  "马山县"
            },
            {
              "id"  :  "450125",
              "aname"  :  "上林县"
            },
            {
              "id"  :  "450126",
              "aname"  :  "宾阳县"
            },
            {
              "id"  :  "450127",
              "aname"  :  "横县"
            }
          ]
        },
        {
          "id"  :  "450200",
          "name"  :  "柳州市",
          "area"  :  [
            {
              "id"  :  "450202",
              "aname"  :  "城中区"
            },
            {
              "id"  :  "450203",
              "aname"  :  "鱼峰区"
            },
            {
              "id"  :  "450204",
              "aname"  :  "柳南区"
            },
            {
              "id"  :  "450205",
              "aname"  :  "柳北区"
            },
            {
              "id"  :  "450221",
              "aname"  :  "柳江县"
            },
            {
              "id"  :  "450222",
              "aname"  :  "柳城县"
            },
            {
              "id"  :  "450223",
              "aname"  :  "鹿寨县"
            },
            {
              "id"  :  "450224",
              "aname"  :  "融安县"
            },
            {
              "id"  :  "450225",
              "aname"  :  "融水苗族自治县"
            },
            {
              "id"  :  "450226",
              "aname"  :  "三江侗族自治县"
            }
          ]
        },
        {
          "id"  :  "450300",
          "name"  :  "桂林市",
          "area"  :  [
            {
              "id"  :  "450302",
              "aname"  :  "秀峰区"
            },
            {
              "id"  :  "450303",
              "aname"  :  "叠彩区"
            },
            {
              "id"  :  "450304",
              "aname"  :  "象山区"
            },
            {
              "id"  :  "450305",
              "aname"  :  "七星区"
            },
            {
              "id"  :  "450311",
              "aname"  :  "雁山区"
            },
            {
              "id"  :  "450321",
              "aname"  :  "阳朔县"
            },
            {
              "id"  :  "450322",
              "aname"  :  "临桂县"
            },
            {
              "id"  :  "450323",
              "aname"  :  "灵川县"
            },
            {
              "id"  :  "450324",
              "aname"  :  "全州县"
            },
            {
              "id"  :  "450325",
              "aname"  :  "兴安县"
            },
            {
              "id"  :  "450326",
              "aname"  :  "永福县"
            },
            {
              "id"  :  "450327",
              "aname"  :  "灌阳县"
            },
            {
              "id"  :  "450328",
              "aname"  :  "龙胜各族自治县"
            },
            {
              "id"  :  "450329",
              "aname"  :  "资源县"
            },
            {
              "id"  :  "450330",
              "aname"  :  "平乐县"
            },
            {
              "id"  :  "450331",
              "aname"  :  "荔蒲县"
            },
            {
              "id"  :  "450332",
              "aname"  :  "恭城瑶族自治县"
            }
          ]
        },
        {
          "id"  :  "450400",
          "name"  :  "梧州市",
          "area"  :  [
            {
              "id"  :  "450403",
              "aname"  :  "万秀区"
            },
            {
              "id"  :  "450404",
              "aname"  :  "蝶山区"
            },
            {
              "id"  :  "450405",
              "aname"  :  "长洲区"
            },
            {
              "id"  :  "450421",
              "aname"  :  "苍梧县"
            },
            {
              "id"  :  "450422",
              "aname"  :  "藤县"
            },
            {
              "id"  :  "450423",
              "aname"  :  "蒙山县"
            },
            {
              "id"  :  "450481",
              "aname"  :  "岑溪市"
            }
          ]
        },
        {
          "id"  :  "450500",
          "name"  :  "北海市",
          "area"  :  [
            {
              "id"  :  "450502",
              "aname"  :  "海城区"
            },
            {
              "id"  :  "450503",
              "aname"  :  "银海区"
            },
            {
              "id"  :  "450512",
              "aname"  :  "铁山港区"
            },
            {
              "id"  :  "450521",
              "aname"  :  "合浦县"
            }
          ]
        },
        {
          "id"  :  "450600",
          "name"  :  "防城港市",
          "area"  :  [
            {
              "id"  :  "450602",
              "aname"  :  "港口区"
            },
            {
              "id"  :  "450603",
              "aname"  :  "防城区"
            },
            {
              "id"  :  "450621",
              "aname"  :  "上思县"
            },
            {
              "id"  :  "450681",
              "aname"  :  "东兴市"
            }
          ]
        },
        {
          "id"  :  "450700",
          "name"  :  "钦州市",
          "area"  :  [
            {
              "id"  :  "450702",
              "aname"  :  "钦南区"
            },
            {
              "id"  :  "450703",
              "aname"  :  "钦北区"
            },
            {
              "id"  :  "450721",
              "aname"  :  "灵山县"
            },
            {
              "id"  :  "450722",
              "aname"  :  "浦北县"
            }
          ]
        },
        {
          "id"  :  "450800",
          "name"  :  "贵港市",
          "area"  :  [
            {
              "id"  :  "450802",
              "aname"  :  "港北区"
            },
            {
              "id"  :  "450803",
              "aname"  :  "港南区"
            },
            {
              "id"  :  "450804",
              "aname"  :  "覃塘区"
            },
            {
              "id"  :  "450821",
              "aname"  :  "平南县"
            },
            {
              "id"  :  "450881",
              "aname"  :  "桂平市"
            }
          ]
        },
        {
          "id"  :  "450900",
          "name"  :  "玉林市",
          "area"  :  [
            {
              "id"  :  "450902",
              "aname"  :  "玉州区"
            },
            {
              "id"  :  "450921",
              "aname"  :  "容县"
            },
            {
              "id"  :  "450922",
              "aname"  :  "陆川县"
            },
            {
              "id"  :  "450923",
              "aname"  :  "博白县"
            },
            {
              "id"  :  "450924",
              "aname"  :  "兴业县"
            },
            {
              "id"  :  "450981",
              "aname"  :  "北流市"
            }
          ]
        },
        {
          "id"  :  "451000",
          "name"  :  "百色市",
          "area"  :  [
            {
              "id"  :  "451002",
              "aname"  :  "右江区"
            },
            {
              "id"  :  "451021",
              "aname"  :  "田阳县"
            },
            {
              "id"  :  "451022",
              "aname"  :  "田东县"
            },
            {
              "id"  :  "451023",
              "aname"  :  "平果县"
            },
            {
              "id"  :  "451024",
              "aname"  :  "德保县"
            },
            {
              "id"  :  "451025",
              "aname"  :  "靖西县"
            },
            {
              "id"  :  "451026",
              "aname"  :  "那坡县"
            },
            {
              "id"  :  "451027",
              "aname"  :  "凌云县"
            },
            {
              "id"  :  "451028",
              "aname"  :  "乐业县"
            },
            {
              "id"  :  "451029",
              "aname"  :  "田林县"
            },
            {
              "id"  :  "451030",
              "aname"  :  "西林县"
            },
            {
              "id"  :  "451031",
              "aname"  :  "隆林各族自治县"
            }
          ]
        },
        {
          "id"  :  "451100",
          "name"  :  "贺州市",
          "area"  :  [
            {
              "id"  :  "451102",
              "aname"  :  "八步区"
            },
            {
              "id"  :  "451119",
              "aname"  :  "平桂管理区"
            },
            {
              "id"  :  "451121",
              "aname"  :  "昭平县"
            },
            {
              "id"  :  "451122",
              "aname"  :  "钟山县"
            },
            {
              "id"  :  "451123",
              "aname"  :  "富川瑶族自治县"
            }
          ]
        },
        {
          "id"  :  "451200",
          "name"  :  "河池市",
          "area"  :  [
            {
              "id"  :  "451202",
              "aname"  :  "金城江区"
            },
            {
              "id"  :  "451221",
              "aname"  :  "南丹县"
            },
            {
              "id"  :  "451222",
              "aname"  :  "天峨县"
            },
            {
              "id"  :  "451223",
              "aname"  :  "凤山县"
            },
            {
              "id"  :  "451224",
              "aname"  :  "东兰县"
            },
            {
              "id"  :  "451225",
              "aname"  :  "罗城仫佬族自治县"
            },
            {
              "id"  :  "451226",
              "aname"  :  "环江毛南族自治县"
            },
            {
              "id"  :  "451227",
              "aname"  :  "巴马瑶族自治县"
            },
            {
              "id"  :  "451228",
              "aname"  :  "都安瑶族自治县"
            },
            {
              "id"  :  "451229",
              "aname"  :  "大化瑶族自治县"
            },
            {
              "id"  :  "451281",
              "aname"  :  "宜州市"
            }
          ]
        },
        {
          "id"  :  "451300",
          "name"  :  "来宾市",
          "area"  :  [
            {
              "id"  :  "451302",
              "aname"  :  "兴宾区"
            },
            {
              "id"  :  "451321",
              "aname"  :  "忻城县"
            },
            {
              "id"  :  "451322",
              "aname"  :  "象州县"
            },
            {
              "id"  :  "451323",
              "aname"  :  "武宣县"
            },
            {
              "id"  :  "451324",
              "aname"  :  "金秀瑶族自治县"
            },
            {
              "id"  :  "451381",
              "aname"  :  "合山市"
            }
          ]
        },
        {
          "id"  :  "451400",
          "name"  :  "崇左市",
          "area"  :  [
            {
              "id"  :  "451402",
              "aname"  :  "江洲区"
            },
            {
              "id"  :  "451421",
              "aname"  :  "扶绥县"
            },
            {
              "id"  :  "451422",
              "aname"  :  "宁明县"
            },
            {
              "id"  :  "451423",
              "aname"  :  "龙州县"
            },
            {
              "id"  :  "451424",
              "aname"  :  "大新县"
            },
            {
              "id"  :  "451425",
              "aname"  :  "天等县"
            },
            {
              "id"  :  "451481",
              "aname"  :  "凭祥市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "460000",
      "name"  :  "海南省",
      "city"  :  [
        {
          "id"  :  "460100",
          "name"  :  "海口市",
          "area"  :  [
            {
              "id"  :  "460105",
              "aname"  :  "秀英区"
            },
            {
              "id"  :  "460106",
              "aname"  :  "龙华区"
            },
            {
              "id"  :  "460107",
              "aname"  :  "琼山区"
            },
            {
              "id"  :  "460108",
              "aname"  :  "美兰区"
            }
          ]
        },
        {
          "id"  :  "460200",
          "name"  :  "三亚市",
          "area"  :  [
            {
              "id"  :  "460201",
              "aname"  :  "三亚市"
            }
          ]
        },
        {
          "id"  :  "460300",
          "name"  :  "三沙市",
          "area"  :  [
            {
              "id"  :  "460321",
              "aname"  :  "西沙群岛"
            },
            {
              "id"  :  "460322",
              "aname"  :  "南沙群岛"
            },
            {
              "id"  :  "460323",
              "aname"  :  "中沙群岛"
            }
          ]
        },
        {
          "id"  :  "469000",
          "name"  :  "省直辖",
          "area"  :  [
            {
              "id"  :  "469001",
              "aname"  :  "五指山市"
            },
            {
              "id"  :  "469002",
              "aname"  :  "琼海市"
            },
            {
              "id"  :  "469003",
              "aname"  :  "儋州市"
            },
            {
              "id"  :  "469005",
              "aname"  :  "文昌市"
            },
            {
              "id"  :  "469006",
              "aname"  :  "万宁市"
            },
            {
              "id"  :  "469007",
              "aname"  :  "东方市"
            },
            {
              "id"  :  "469021",
              "aname"  :  "定安县"
            },
            {
              "id"  :  "469022",
              "aname"  :  "屯昌县"
            },
            {
              "id"  :  "469023",
              "aname"  :  "澄迈县"
            },
            {
              "id"  :  "469024",
              "aname"  :  "临高县"
            },
            {
              "id"  :  "469025",
              "aname"  :  "白沙黎族自治县"
            },
            {
              "id"  :  "469026",
              "aname"  :  "昌江黎族自治县"
            },
            {
              "id"  :  "469027",
              "aname"  :  "乐东黎族自治县"
            },
            {
              "id"  :  "469028",
              "aname"  :  "陵水黎族自治县"
            },
            {
              "id"  :  "469029",
              "aname"  :  "保亭黎族苗族自治县"
            },
            {
              "id"  :  "469030",
              "aname"  :  "琼中黎族苗族自治县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "500000",
      "name"  :  "重庆市",
      "city"  :  [
        {
          "id"  :  "500101",
          "name"  :  "万州区"
        },
        {
          "id"  :  "500102",
          "name"  :  "涪陵区"
        },
        {
          "id"  :  "500103",
          "name"  :  "渝中区"
        },
        {
          "id"  :  "500104",
          "name"  :  "大渡口区"
        },
        {
          "id"  :  "500105",
          "name"  :  "江北区"
        },
        {
          "id"  :  "500106",
          "name"  :  "沙坪坝区"
        },
        {
          "id"  :  "500107",
          "name"  :  "九龙坡区"
        },
        {
          "id"  :  "500108",
          "name"  :  "南岸区"
        },
        {
          "id"  :  "500109",
          "name"  :  "北碚区"
        },
        {
          "id"  :  "500110",
          "name"  :  "綦江区"
        },
        {
          "id"  :  "500111",
          "name"  :  "大足区"
        },
        {
          "id"  :  "500112",
          "name"  :  "渝北区"
        },
        {
          "id"  :  "500113",
          "name"  :  "巴南区"
        },
        {
          "id"  :  "500114",
          "name"  :  "黔江区"
        },
        {
          "id"  :  "500115",
          "name"  :  "长寿区"
        },
        {
          "id"  :  "500116",
          "name"  :  "江津区"
        },
        {
          "id"  :  "500117",
          "name"  :  "合川区"
        },
        {
          "id"  :  "500118",
          "name"  :  "永川区"
        },
        {
          "id"  :  "500119",
          "name"  :  "南川区"
        },
        {
          "id"  :  "500223",
          "name"  :  "潼南县"
        },
        {
          "id"  :  "500224",
          "name"  :  "铜梁县"
        },
        {
          "id"  :  "500226",
          "name"  :  "荣昌县"
        },
        {
          "id"  :  "500227",
          "name"  :  "璧山县"
        },
        {
          "id"  :  "500228",
          "name"  :  "梁平县"
        },
        {
          "id"  :  "500229",
          "name"  :  "城口县"
        },
        {
          "id"  :  "500230",
          "name"  :  "丰都县"
        },
        {
          "id"  :  "500231",
          "name"  :  "垫江县"
        },
        {
          "id"  :  "500232",
          "name"  :  "武隆县"
        },
        {
          "id"  :  "500233",
          "name"  :  "忠县"
        },
        {
          "id"  :  "500234",
          "name"  :  "开县"
        },
        {
          "id"  :  "500235",
          "name"  :  "云阳县"
        },
        {
          "id"  :  "500236",
          "name"  :  "奉节县"
        },
        {
          "id"  :  "500237",
          "name"  :  "巫山县"
        },
        {
          "id"  :  "500238",
          "name"  :  "巫溪县"
        },
        {
          "id"  :  "500240",
          "name"  :  "石柱土家族自治县"
        },
        {
          "id"  :  "500241",
          "name"  :  "秀山土家族苗族自治县"
        },
        {
          "id"  :  "500242",
          "name"  :  "酉阳土家族苗族自治县"
        },
        {
          "id"  :  "500243",
          "name"  :  "彭水苗族土家族自治县"
        }
      ]
    },
    {
      "id"  :  "510000",
      "name"  :  "四川省",
      "city"  :  [
        {
          "id"  :  "510100",
          "name"  :  "成都市",
          "area"  :  [
            {
              "id"  :  "510104",
              "aname"  :  "锦江区"
            },
            {
              "id"  :  "510105",
              "aname"  :  "青羊区"
            },
            {
              "id"  :  "510106",
              "aname"  :  "金牛区"
            },
            {
              "id"  :  "510107",
              "aname"  :  "武侯区"
            },
            {
              "id"  :  "510108",
              "aname"  :  "成华区"
            },
            {
              "id"  :  "510112",
              "aname"  :  "龙泉驿区"
            },
            {
              "id"  :  "510113",
              "aname"  :  "青白江区"
            },
            {
              "id"  :  "510114",
              "aname"  :  "新都区"
            },
            {
              "id"  :  "510115",
              "aname"  :  "温江区"
            },
            {
              "id"  :  "510121",
              "aname"  :  "金堂县"
            },
            {
              "id"  :  "510122",
              "aname"  :  "双流县"
            },
            {
              "id"  :  "510124",
              "aname"  :  "郫县"
            },
            {
              "id"  :  "510129",
              "aname"  :  "大邑县"
            },
            {
              "id"  :  "510131",
              "aname"  :  "蒲江县"
            },
            {
              "id"  :  "510132",
              "aname"  :  "新津县"
            },
            {
              "id"  :  "510181",
              "aname"  :  "都江堰市"
            },
            {
              "id"  :  "510182",
              "aname"  :  "彭州市"
            },
            {
              "id"  :  "510183",
              "aname"  :  "邛崃市"
            },
            {
              "id"  :  "510184",
              "aname"  :  "崇州市"
            }
          ]
        },
        {
          "id"  :  "510300",
          "name"  :  "自贡市",
          "area"  :  [
            {
              "id"  :  "510302",
              "aname"  :  "自流井区"
            },
            {
              "id"  :  "510303",
              "aname"  :  "贡井区"
            },
            {
              "id"  :  "510304",
              "aname"  :  "大安区"
            },
            {
              "id"  :  "510311",
              "aname"  :  "沿滩区"
            },
            {
              "id"  :  "510321",
              "aname"  :  "荣县"
            },
            {
              "id"  :  "510322",
              "aname"  :  "富顺县"
            }
          ]
        },
        {
          "id"  :  "510400",
          "name"  :  "攀枝花市",
          "area"  :  [
            {
              "id"  :  "510402",
              "aname"  :  "东区"
            },
            {
              "id"  :  "510403",
              "aname"  :  "西区"
            },
            {
              "id"  :  "510411",
              "aname"  :  "仁和区"
            },
            {
              "id"  :  "510421",
              "aname"  :  "米易县"
            },
            {
              "id"  :  "510422",
              "aname"  :  "盐边县"
            }
          ]
        },
        {
          "id"  :  "510500",
          "name"  :  "泸州市",
          "area"  :  [
            {
              "id"  :  "510502",
              "aname"  :  "江阳区"
            },
            {
              "id"  :  "510503",
              "aname"  :  "纳溪区"
            },
            {
              "id"  :  "510504",
              "aname"  :  "龙马潭区"
            },
            {
              "id"  :  "510521",
              "aname"  :  "泸县"
            },
            {
              "id"  :  "510522",
              "aname"  :  "合江县"
            },
            {
              "id"  :  "510524",
              "aname"  :  "叙永县"
            },
            {
              "id"  :  "510525",
              "aname"  :  "古蔺县"
            }
          ]
        },
        {
          "id"  :  "510600",
          "name"  :  "德阳市",
          "area"  :  [
            {
              "id"  :  "510603",
              "aname"  :  "旌阳区"
            },
            {
              "id"  :  "510623",
              "aname"  :  "中江县"
            },
            {
              "id"  :  "510626",
              "aname"  :  "罗江县"
            },
            {
              "id"  :  "510681",
              "aname"  :  "广汉市"
            },
            {
              "id"  :  "510682",
              "aname"  :  "什邡市"
            },
            {
              "id"  :  "510683",
              "aname"  :  "绵竹市"
            }
          ]
        },
        {
          "id"  :  "510700",
          "name"  :  "绵阳市",
          "area"  :  [
            {
              "id"  :  "510703",
              "aname"  :  "涪城区"
            },
            {
              "id"  :  "510704",
              "aname"  :  "游仙区"
            },
            {
              "id"  :  "510722",
              "aname"  :  "三台县"
            },
            {
              "id"  :  "510723",
              "aname"  :  "盐亭县"
            },
            {
              "id"  :  "510724",
              "aname"  :  "安县"
            },
            {
              "id"  :  "510725",
              "aname"  :  "梓潼县"
            },
            {
              "id"  :  "510726",
              "aname"  :  "北川羌族自治县"
            },
            {
              "id"  :  "510727",
              "aname"  :  "平武县"
            },
            {
              "id"  :  "510781",
              "aname"  :  "江油市"
            }
          ]
        },
        {
          "id"  :  "510800",
          "name"  :  "广元市",
          "area"  :  [
            {
              "id"  :  "510802",
              "aname"  :  "利州区"
            },
            {
              "id"  :  "510811",
              "aname"  :  "元坝区"
            },
            {
              "id"  :  "510812",
              "aname"  :  "朝天区"
            },
            {
              "id"  :  "510821",
              "aname"  :  "旺苍县"
            },
            {
              "id"  :  "510822",
              "aname"  :  "青川县"
            },
            {
              "id"  :  "510823",
              "aname"  :  "剑阁县"
            },
            {
              "id"  :  "510824",
              "aname"  :  "苍溪县"
            }
          ]
        },
        {
          "id"  :  "510900",
          "name"  :  "遂宁市",
          "area"  :  [
            {
              "id"  :  "510903",
              "aname"  :  "船山区"
            },
            {
              "id"  :  "510904",
              "aname"  :  "安居区"
            },
            {
              "id"  :  "510921",
              "aname"  :  "蓬溪县"
            },
            {
              "id"  :  "510922",
              "aname"  :  "射洪县"
            },
            {
              "id"  :  "510923",
              "aname"  :  "大英县"
            }
          ]
        },
        {
          "id"  :  "511000",
          "name"  :  "内江市",
          "area"  :  [
            {
              "id"  :  "511002",
              "aname"  :  "市中区"
            },
            {
              "id"  :  "511011",
              "aname"  :  "东兴区"
            },
            {
              "id"  :  "511024",
              "aname"  :  "威远县"
            },
            {
              "id"  :  "511025",
              "aname"  :  "资中县"
            },
            {
              "id"  :  "511028",
              "aname"  :  "隆昌县"
            }
          ]
        },
        {
          "id"  :  "511100",
          "name"  :  "乐山市",
          "area"  :  [
            {
              "id"  :  "511102",
              "aname"  :  "市中区"
            },
            {
              "id"  :  "511111",
              "aname"  :  "沙湾区"
            },
            {
              "id"  :  "511112",
              "aname"  :  "五通桥区"
            },
            {
              "id"  :  "511113",
              "aname"  :  "金口河区"
            },
            {
              "id"  :  "511123",
              "aname"  :  "犍为县"
            },
            {
              "id"  :  "511124",
              "aname"  :  "井研县"
            },
            {
              "id"  :  "511126",
              "aname"  :  "夹江县"
            },
            {
              "id"  :  "511129",
              "aname"  :  "沐川县"
            },
            {
              "id"  :  "511132",
              "aname"  :  "峨边彝族自治县"
            },
            {
              "id"  :  "511133",
              "aname"  :  "马边彝族自治县"
            },
            {
              "id"  :  "511181",
              "aname"  :  "峨眉山市"
            }
          ]
        },
        {
          "id"  :  "511300",
          "name"  :  "南充市",
          "area"  :  [
            {
              "id"  :  "511302",
              "aname"  :  "顺庆区"
            },
            {
              "id"  :  "511303",
              "aname"  :  "高坪区"
            },
            {
              "id"  :  "511304",
              "aname"  :  "嘉陵区"
            },
            {
              "id"  :  "511321",
              "aname"  :  "南部县"
            },
            {
              "id"  :  "511322",
              "aname"  :  "营山县"
            },
            {
              "id"  :  "511323",
              "aname"  :  "蓬安县"
            },
            {
              "id"  :  "511324",
              "aname"  :  "仪陇县"
            },
            {
              "id"  :  "511325",
              "aname"  :  "西充县"
            },
            {
              "id"  :  "511381",
              "aname"  :  "阆中市"
            }
          ]
        },
        {
          "id"  :  "511400",
          "name"  :  "眉山市",
          "area"  :  [
            {
              "id"  :  "511402",
              "aname"  :  "东坡区"
            },
            {
              "id"  :  "511421",
              "aname"  :  "仁寿县"
            },
            {
              "id"  :  "511422",
              "aname"  :  "彭山县"
            },
            {
              "id"  :  "511423",
              "aname"  :  "洪雅县"
            },
            {
              "id"  :  "511424",
              "aname"  :  "丹棱县"
            },
            {
              "id"  :  "511425",
              "aname"  :  "青神县"
            }
          ]
        },
        {
          "id"  :  "511500",
          "name"  :  "宜宾市",
          "area"  :  [
            {
              "id"  :  "511502",
              "aname"  :  "翠屏区"
            },
            {
              "id"  :  "511521",
              "aname"  :  "宜宾县"
            },
            {
              "id"  :  "511522",
              "aname"  :  "南溪区"
            },
            {
              "id"  :  "511523",
              "aname"  :  "江安县"
            },
            {
              "id"  :  "511524",
              "aname"  :  "长宁县"
            },
            {
              "id"  :  "511525",
              "aname"  :  "高县"
            },
            {
              "id"  :  "511526",
              "aname"  :  "珙县"
            },
            {
              "id"  :  "511527",
              "aname"  :  "筠连县"
            },
            {
              "id"  :  "511528",
              "aname"  :  "兴文县"
            },
            {
              "id"  :  "511529",
              "aname"  :  "屏山县"
            }
          ]
        },
        {
          "id"  :  "511600",
          "name"  :  "广安市",
          "area"  :  [
            {
              "id"  :  "511602",
              "aname"  :  "广安区"
            },
            {
              "id"  :  "511621",
              "aname"  :  "岳池县"
            },
            {
              "id"  :  "511622",
              "aname"  :  "武胜县"
            },
            {
              "id"  :  "511623",
              "aname"  :  "邻水县"
            },
            {
              "id"  :  "511681",
              "aname"  :  "华蓥市"
            }
          ]
        },
        {
          "id"  :  "511700",
          "name"  :  "达州市",
          "area"  :  [
            {
              "id"  :  "511702",
              "aname"  :  "通川区"
            },
            {
              "id"  :  "511721",
              "aname"  :  "达县"
            },
            {
              "id"  :  "511722",
              "aname"  :  "宣汉县"
            },
            {
              "id"  :  "511723",
              "aname"  :  "开江县"
            },
            {
              "id"  :  "511724",
              "aname"  :  "大竹县"
            },
            {
              "id"  :  "511725",
              "aname"  :  "渠县"
            },
            {
              "id"  :  "511781",
              "aname"  :  "万源市"
            }
          ]
        },
        {
          "id"  :  "511800",
          "name"  :  "雅安市",
          "area"  :  [
            {
              "id"  :  "511802",
              "aname"  :  "雨城区"
            },
            {
              "id"  :  "511821",
              "aname"  :  "名山县"
            },
            {
              "id"  :  "511822",
              "aname"  :  "荥经县"
            },
            {
              "id"  :  "511823",
              "aname"  :  "汉源县"
            },
            {
              "id"  :  "511824",
              "aname"  :  "石棉县"
            },
            {
              "id"  :  "511825",
              "aname"  :  "天全县"
            },
            {
              "id"  :  "511826",
              "aname"  :  "芦山县"
            },
            {
              "id"  :  "511827",
              "aname"  :  "宝兴县"
            }
          ]
        },
        {
          "id"  :  "511900",
          "name"  :  "巴中市",
          "area"  :  [
            {
              "id"  :  "511902",
              "aname"  :  "巴州区"
            },
            {
              "id"  :  "511921",
              "aname"  :  "通江县"
            },
            {
              "id"  :  "511922",
              "aname"  :  "南江县"
            },
            {
              "id"  :  "511923",
              "aname"  :  "平昌县"
            }
          ]
        },
        {
          "id"  :  "512000",
          "name"  :  "资阳市",
          "area"  :  [
            {
              "id"  :  "512002",
              "aname"  :  "雁江区"
            },
            {
              "id"  :  "512021",
              "aname"  :  "安岳县"
            },
            {
              "id"  :  "512022",
              "aname"  :  "乐至县"
            },
            {
              "id"  :  "512081",
              "aname"  :  "简阳市"
            }
          ]
        },
        {
          "id"  :  "513200",
          "name"  :  "阿坝藏族羌族自治州",
          "area"  :  [
            {
              "id"  :  "513221",
              "aname"  :  "汶川县"
            },
            {
              "id"  :  "513222",
              "aname"  :  "理县"
            },
            {
              "id"  :  "513223",
              "aname"  :  "茂县"
            },
            {
              "id"  :  "513224",
              "aname"  :  "松潘县"
            },
            {
              "id"  :  "513225",
              "aname"  :  "九寨沟县"
            },
            {
              "id"  :  "513226",
              "aname"  :  "金川县"
            },
            {
              "id"  :  "513227",
              "aname"  :  "小金县"
            },
            {
              "id"  :  "513228",
              "aname"  :  "黑水县"
            },
            {
              "id"  :  "513229",
              "aname"  :  "马尔康县"
            },
            {
              "id"  :  "513230",
              "aname"  :  "壤塘县"
            },
            {
              "id"  :  "513231",
              "aname"  :  "阿坝县"
            },
            {
              "id"  :  "513232",
              "aname"  :  "若尔盖县"
            },
            {
              "id"  :  "513233",
              "aname"  :  "红原县"
            }
          ]
        },
        {
          "id"  :  "513300",
          "name"  :  "甘孜藏族自治州",
          "area"  :  [
            {
              "id"  :  "513321",
              "aname"  :  "康定县"
            },
            {
              "id"  :  "513322",
              "aname"  :  "泸定县"
            },
            {
              "id"  :  "513323",
              "aname"  :  "丹巴县"
            },
            {
              "id"  :  "513324",
              "aname"  :  "九龙县"
            },
            {
              "id"  :  "513325",
              "aname"  :  "雅江县"
            },
            {
              "id"  :  "513326",
              "aname"  :  "道孚县"
            },
            {
              "id"  :  "513327",
              "aname"  :  "炉霍县"
            },
            {
              "id"  :  "513328",
              "aname"  :  "甘孜县"
            },
            {
              "id"  :  "513329",
              "aname"  :  "新龙县"
            },
            {
              "id"  :  "513330",
              "aname"  :  "德格县"
            },
            {
              "id"  :  "513331",
              "aname"  :  "白玉县"
            },
            {
              "id"  :  "513332",
              "aname"  :  "石渠县"
            },
            {
              "id"  :  "513333",
              "aname"  :  "色达县"
            },
            {
              "id"  :  "513334",
              "aname"  :  "理塘县"
            },
            {
              "id"  :  "513335",
              "aname"  :  "巴塘县"
            },
            {
              "id"  :  "513336",
              "aname"  :  "乡城县"
            },
            {
              "id"  :  "513337",
              "aname"  :  "稻城县"
            },
            {
              "id"  :  "513338",
              "aname"  :  "得荣县"
            }
          ]
        },
        {
          "id"  :  "513400",
          "name"  :  "凉山彝族自治州",
          "area"  :  [
            {
              "id"  :  "513401",
              "aname"  :  "西昌市"
            },
            {
              "id"  :  "513422",
              "aname"  :  "木里藏族自治县"
            },
            {
              "id"  :  "513423",
              "aname"  :  "盐源县"
            },
            {
              "id"  :  "513424",
              "aname"  :  "德昌县"
            },
            {
              "id"  :  "513425",
              "aname"  :  "会理县"
            },
            {
              "id"  :  "513426",
              "aname"  :  "会东县"
            },
            {
              "id"  :  "513427",
              "aname"  :  "宁南县"
            },
            {
              "id"  :  "513428",
              "aname"  :  "普格县"
            },
            {
              "id"  :  "513429",
              "aname"  :  "布拖县"
            },
            {
              "id"  :  "513430",
              "aname"  :  "金阳县"
            },
            {
              "id"  :  "513431",
              "aname"  :  "昭觉县"
            },
            {
              "id"  :  "513432",
              "aname"  :  "喜德县"
            },
            {
              "id"  :  "513433",
              "aname"  :  "冕宁县"
            },
            {
              "id"  :  "513434",
              "aname"  :  "越西县"
            },
            {
              "id"  :  "513435",
              "aname"  :  "甘洛县"
            },
            {
              "id"  :  "513436",
              "aname"  :  "美姑县"
            },
            {
              "id"  :  "513437",
              "aname"  :  "雷波县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "520000",
      "name"  :  "贵州省",
      "city"  :  [
        {
          "id"  :  "520100",
          "name"  :  "贵阳市",
          "area"  :  [
            {
              "id"  :  "520102",
              "aname"  :  "南明区"
            },
            {
              "id"  :  "520103",
              "aname"  :  "云岩区"
            },
            {
              "id"  :  "520111",
              "aname"  :  "花溪区"
            },
            {
              "id"  :  "520112",
              "aname"  :  "乌当区"
            },
            {
              "id"  :  "520113",
              "aname"  :  "白云区"
            },
            {
              "id"  :  "520114",
              "aname"  :  "小河区"
            },
            {
              "id"  :  "520121",
              "aname"  :  "开阳县"
            },
            {
              "id"  :  "520122",
              "aname"  :  "息烽县"
            },
            {
              "id"  :  "520123",
              "aname"  :  "修文县"
            },
            {
              "id"  :  "520181",
              "aname"  :  "清镇市"
            }
          ]
        },
        {
          "id"  :  "520200",
          "name"  :  "六盘水市",
          "area"  :  [
            {
              "id"  :  "520201",
              "aname"  :  "钟山区"
            },
            {
              "id"  :  "520203",
              "aname"  :  "六枝特区"
            },
            {
              "id"  :  "520221",
              "aname"  :  "水城县"
            },
            {
              "id"  :  "520222",
              "aname"  :  "盘县"
            }
          ]
        },
        {
          "id"  :  "520300",
          "name"  :  "遵义市",
          "area"  :  [
            {
              "id"  :  "520302",
              "aname"  :  "红花岗区"
            },
            {
              "id"  :  "520303",
              "aname"  :  "汇川区"
            },
            {
              "id"  :  "520321",
              "aname"  :  "遵义县"
            },
            {
              "id"  :  "520322",
              "aname"  :  "桐梓县"
            },
            {
              "id"  :  "520323",
              "aname"  :  "绥阳县"
            },
            {
              "id"  :  "520324",
              "aname"  :  "正安县"
            },
            {
              "id"  :  "520325",
              "aname"  :  "道真仡佬族苗族自治县"
            },
            {
              "id"  :  "520326",
              "aname"  :  "务川仡佬族苗族自治县"
            },
            {
              "id"  :  "520327",
              "aname"  :  "凤冈县"
            },
            {
              "id"  :  "520328",
              "aname"  :  "湄潭县"
            },
            {
              "id"  :  "520329",
              "aname"  :  "余庆县"
            },
            {
              "id"  :  "520330",
              "aname"  :  "习水县"
            },
            {
              "id"  :  "520381",
              "aname"  :  "赤水市"
            },
            {
              "id"  :  "520382",
              "aname"  :  "仁怀市"
            }
          ]
        },
        {
          "id"  :  "520400",
          "name"  :  "安顺市",
          "area"  :  [
            {
              "id"  :  "520402",
              "aname"  :  "西秀区"
            },
            {
              "id"  :  "520421",
              "aname"  :  "平坝县"
            },
            {
              "id"  :  "520422",
              "aname"  :  "普定县"
            },
            {
              "id"  :  "520423",
              "aname"  :  "镇宁布依族苗族自治县"
            },
            {
              "id"  :  "520424",
              "aname"  :  "关岭布依族苗族自治县"
            },
            {
              "id"  :  "520425",
              "aname"  :  "紫云苗族布依族自治县"
            }
          ]
        },
        {
          "id"  :  "520500",
          "name"  :  "毕节市",
          "area"  :  [
            {
              "id"  :  "520501",
              "aname"  :  "七星关区"
            },
            {
              "id"  :  "520522",
              "aname"  :  "大方县"
            },
            {
              "id"  :  "520523",
              "aname"  :  "黔西县"
            },
            {
              "id"  :  "520524",
              "aname"  :  "金沙县"
            },
            {
              "id"  :  "520525",
              "aname"  :  "织金县"
            },
            {
              "id"  :  "520526",
              "aname"  :  "纳雍县"
            },
            {
              "id"  :  "520527",
              "aname"  :  "威宁彝族回族苗族自治县"
            },
            {
              "id"  :  "520528",
              "aname"  :  "赫章县"
            }
          ]
        },
        {
          "id"  :  "520600",
          "name"  :  "铜仁市",
          "area"  :  [
            {
              "id"  :  "520601",
              "aname"  :  "碧江区"
            },
            {
              "id"  :  "520602",
              "aname"  :  "万山区"
            },
            {
              "id"  :  "520622",
              "aname"  :  "江口县"
            },
            {
              "id"  :  "520623",
              "aname"  :  "玉屏侗族自治县"
            },
            {
              "id"  :  "520624",
              "aname"  :  "石阡县"
            },
            {
              "id"  :  "520625",
              "aname"  :  "思南县"
            },
            {
              "id"  :  "520626",
              "aname"  :  "印江土家族苗族自治县"
            },
            {
              "id"  :  "520627",
              "aname"  :  "德江县"
            },
            {
              "id"  :  "520628",
              "aname"  :  "沿河土家族自治县"
            },
            {
              "id"  :  "520629",
              "aname"  :  "松桃苗族自治县"
            }
          ]
        },
        {
          "id"  :  "522300",
          "name"  :  "黔西南布依族苗族自治州",
          "area"  :  [
            {
              "id"  :  "522301",
              "aname"  :  "兴义市"
            },
            {
              "id"  :  "522322",
              "aname"  :  "兴仁县"
            },
            {
              "id"  :  "522323",
              "aname"  :  "普安县"
            },
            {
              "id"  :  "522324",
              "aname"  :  "晴隆县"
            },
            {
              "id"  :  "522325",
              "aname"  :  "贞丰县"
            },
            {
              "id"  :  "522326",
              "aname"  :  "望谟县"
            },
            {
              "id"  :  "522327",
              "aname"  :  "册亨县"
            },
            {
              "id"  :  "522328",
              "aname"  :  "安龙县"
            }
          ]
        },
        {
          "id"  :  "522600",
          "name"  :  "黔东南苗族侗族自治州",
          "area"  :  [
            {
              "id"  :  "522601",
              "aname"  :  "凯里市"
            },
            {
              "id"  :  "522622",
              "aname"  :  "黄平县"
            },
            {
              "id"  :  "522623",
              "aname"  :  "施秉县"
            },
            {
              "id"  :  "522624",
              "aname"  :  "三穗县"
            },
            {
              "id"  :  "522625",
              "aname"  :  "镇远县"
            },
            {
              "id"  :  "522626",
              "aname"  :  "岑巩县"
            },
            {
              "id"  :  "522627",
              "aname"  :  "天柱县"
            },
            {
              "id"  :  "522628",
              "aname"  :  "锦屏县"
            },
            {
              "id"  :  "522629",
              "aname"  :  "剑河县"
            },
            {
              "id"  :  "522630",
              "aname"  :  "台江县"
            },
            {
              "id"  :  "522631",
              "aname"  :  "黎平县"
            },
            {
              "id"  :  "522632",
              "aname"  :  "榕江县"
            },
            {
              "id"  :  "522633",
              "aname"  :  "从江县"
            },
            {
              "id"  :  "522634",
              "aname"  :  "雷山县"
            },
            {
              "id"  :  "522635",
              "aname"  :  "麻江县"
            },
            {
              "id"  :  "522636",
              "aname"  :  "丹寨县"
            }
          ]
        },
        {
          "id"  :  "522700",
          "name"  :  "黔南布依族苗族自治州",
          "area"  :  [
            {
              "id"  :  "522701",
              "aname"  :  "都匀市"
            },
            {
              "id"  :  "522702",
              "aname"  :  "福泉市"
            },
            {
              "id"  :  "522722",
              "aname"  :  "荔波县"
            },
            {
              "id"  :  "522723",
              "aname"  :  "贵定县"
            },
            {
              "id"  :  "522725",
              "aname"  :  "瓮安县"
            },
            {
              "id"  :  "522726",
              "aname"  :  "独山县"
            },
            {
              "id"  :  "522727",
              "aname"  :  "平塘县"
            },
            {
              "id"  :  "522728",
              "aname"  :  "罗甸县"
            },
            {
              "id"  :  "522729",
              "aname"  :  "长顺县"
            },
            {
              "id"  :  "522730",
              "aname"  :  "龙里县"
            },
            {
              "id"  :  "522731",
              "aname"  :  "惠水县"
            },
            {
              "id"  :  "522732",
              "aname"  :  "三都水族自治县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "530000",
      "name"  :  "云南省",
      "city"  :  [
        {
          "id"  :  "530100",
          "name"  :  "昆明市",
          "area"  :  [
            {
              "id"  :  "530102",
              "aname"  :  "五华区"
            },
            {
              "id"  :  "530103",
              "aname"  :  "盘龙区"
            },
            {
              "id"  :  "530111",
              "aname"  :  "官渡区"
            },
            {
              "id"  :  "530112",
              "aname"  :  "西山区"
            },
            {
              "id"  :  "530113",
              "aname"  :  "东川区"
            },
            {
              "id"  :  "530121",
              "aname"  :  "呈贡区"
            },
            {
              "id"  :  "530122",
              "aname"  :  "晋宁县"
            },
            {
              "id"  :  "530124",
              "aname"  :  "富民县"
            },
            {
              "id"  :  "530125",
              "aname"  :  "宜良县"
            },
            {
              "id"  :  "530126",
              "aname"  :  "石林彝族自治县"
            },
            {
              "id"  :  "530127",
              "aname"  :  "嵩明县"
            },
            {
              "id"  :  "530128",
              "aname"  :  "禄劝彝族苗族自治县"
            },
            {
              "id"  :  "530129",
              "aname"  :  "寻甸回族彝族自治县"
            },
            {
              "id"  :  "530181",
              "aname"  :  "安宁市"
            }
          ]
        },
        {
          "id"  :  "530300",
          "name"  :  "曲靖市",
          "area"  :  [
            {
              "id"  :  "530302",
              "aname"  :  "麒麟区"
            },
            {
              "id"  :  "530321",
              "aname"  :  "马龙县"
            },
            {
              "id"  :  "530322",
              "aname"  :  "陆良县"
            },
            {
              "id"  :  "530323",
              "aname"  :  "师宗县"
            },
            {
              "id"  :  "530324",
              "aname"  :  "罗平县"
            },
            {
              "id"  :  "530325",
              "aname"  :  "富源县"
            },
            {
              "id"  :  "530326",
              "aname"  :  "会泽县"
            },
            {
              "id"  :  "530328",
              "aname"  :  "沾益县"
            },
            {
              "id"  :  "530381",
              "aname"  :  "宣威市"
            }
          ]
        },
        {
          "id"  :  "530400",
          "name"  :  "玉溪市",
          "area"  :  [
            {
              "id"  :  "530402",
              "aname"  :  "红塔区"
            },
            {
              "id"  :  "530421",
              "aname"  :  "江川县"
            },
            {
              "id"  :  "530422",
              "aname"  :  "澄江县"
            },
            {
              "id"  :  "530423",
              "aname"  :  "通海县"
            },
            {
              "id"  :  "530424",
              "aname"  :  "华宁县"
            },
            {
              "id"  :  "530425",
              "aname"  :  "易门县"
            },
            {
              "id"  :  "530426",
              "aname"  :  "峨山彝族自治县"
            },
            {
              "id"  :  "530427",
              "aname"  :  "新平彝族傣族自治县"
            },
            {
              "id"  :  "530428",
              "aname"  :  "元江哈尼族彝族傣族自治县"
            }
          ]
        },
        {
          "id"  :  "530500",
          "name"  :  "保山市",
          "area"  :  [
            {
              "id"  :  "530502",
              "aname"  :  "隆阳区"
            },
            {
              "id"  :  "530521",
              "aname"  :  "施甸县"
            },
            {
              "id"  :  "530522",
              "aname"  :  "腾冲县"
            },
            {
              "id"  :  "530523",
              "aname"  :  "龙陵县"
            },
            {
              "id"  :  "530524",
              "aname"  :  "昌宁县"
            }
          ]
        },
        {
          "id"  :  "530600",
          "name"  :  "昭通市",
          "area"  :  [
            {
              "id"  :  "530602",
              "aname"  :  "昭阳区"
            },
            {
              "id"  :  "530621",
              "aname"  :  "鲁甸县"
            },
            {
              "id"  :  "530622",
              "aname"  :  "巧家县"
            },
            {
              "id"  :  "530623",
              "aname"  :  "盐津县"
            },
            {
              "id"  :  "530624",
              "aname"  :  "大关县"
            },
            {
              "id"  :  "530625",
              "aname"  :  "永善县"
            },
            {
              "id"  :  "530626",
              "aname"  :  "绥江县"
            },
            {
              "id"  :  "530627",
              "aname"  :  "镇雄县"
            },
            {
              "id"  :  "530628",
              "aname"  :  "彝良县"
            },
            {
              "id"  :  "530629",
              "aname"  :  "威信县"
            },
            {
              "id"  :  "530630",
              "aname"  :  "水富县"
            }
          ]
        },
        {
          "id"  :  "530700",
          "name"  :  "丽江市",
          "area"  :  [
            {
              "id"  :  "530702",
              "aname"  :  "古城区"
            },
            {
              "id"  :  "530721",
              "aname"  :  "玉龙纳西族自治县"
            },
            {
              "id"  :  "530722",
              "aname"  :  "永胜县"
            },
            {
              "id"  :  "530723",
              "aname"  :  "华坪县"
            },
            {
              "id"  :  "530724",
              "aname"  :  "宁蒗彝族自治县"
            }
          ]
        },
        {
          "id"  :  "530800",
          "name"  :  "普洱市",
          "area"  :  [
            {
              "id"  :  "530802",
              "aname"  :  "思茅区"
            },
            {
              "id"  :  "530821",
              "aname"  :  "宁洱哈尼族彝族自治县"
            },
            {
              "id"  :  "530822",
              "aname"  :  "墨江哈尼族自治县"
            },
            {
              "id"  :  "530823",
              "aname"  :  "景东彝族自治县"
            },
            {
              "id"  :  "530824",
              "aname"  :  "景谷傣族彝族自治县"
            },
            {
              "id"  :  "530825",
              "aname"  :  "镇沅彝族哈尼族拉祜族自治县"
            },
            {
              "id"  :  "530826",
              "aname"  :  "江城哈尼族彝族自治县"
            },
            {
              "id"  :  "530827",
              "aname"  :  "孟连傣族拉祜族佤族自治县"
            },
            {
              "id"  :  "530828",
              "aname"  :  "澜沧拉祜族自治县"
            },
            {
              "id"  :  "530829",
              "aname"  :  "西盟佤族自治县"
            }
          ]
        },
        {
          "id"  :  "530900",
          "name"  :  "临沧市",
          "area"  :  [
            {
              "id"  :  "530902",
              "aname"  :  "临翔区"
            },
            {
              "id"  :  "530921",
              "aname"  :  "凤庆县"
            },
            {
              "id"  :  "530922",
              "aname"  :  "云县"
            },
            {
              "id"  :  "530923",
              "aname"  :  "永德县"
            },
            {
              "id"  :  "530924",
              "aname"  :  "镇康县"
            },
            {
              "id"  :  "530925",
              "aname"  :  "双江拉祜族佤族布朗族傣族自治县"
            },
            {
              "id"  :  "530926",
              "aname"  :  "耿马傣族佤族自治县"
            },
            {
              "id"  :  "530927",
              "aname"  :  "沧源佤族自治县"
            }
          ]
        },
        {
          "id"  :  "532300",
          "name"  :  "楚雄彝族自治州",
          "area"  :  [
            {
              "id"  :  "532301",
              "aname"  :  "楚雄市"
            },
            {
              "id"  :  "532322",
              "aname"  :  "双柏县"
            },
            {
              "id"  :  "532323",
              "aname"  :  "牟定县"
            },
            {
              "id"  :  "532324",
              "aname"  :  "南华县"
            },
            {
              "id"  :  "532325",
              "aname"  :  "姚安县"
            },
            {
              "id"  :  "532326",
              "aname"  :  "大姚县"
            },
            {
              "id"  :  "532327",
              "aname"  :  "永仁县"
            },
            {
              "id"  :  "532328",
              "aname"  :  "元谋县"
            },
            {
              "id"  :  "532329",
              "aname"  :  "武定县"
            },
            {
              "id"  :  "532331",
              "aname"  :  "禄丰县"
            }
          ]
        },
        {
          "id"  :  "532500",
          "name"  :  "红河哈尼族彝族自治州",
          "area"  :  [
            {
              "id"  :  "532501",
              "aname"  :  "个旧市"
            },
            {
              "id"  :  "532502",
              "aname"  :  "开远市"
            },
            {
              "id"  :  "532503",
              "aname"  :  "蒙自市"
            },
            {
              "id"  :  "532523",
              "aname"  :  "屏边苗族自治县"
            },
            {
              "id"  :  "532524",
              "aname"  :  "建水县"
            },
            {
              "id"  :  "532525",
              "aname"  :  "石屏县"
            },
            {
              "id"  :  "532526",
              "aname"  :  "弥勒县"
            },
            {
              "id"  :  "532527",
              "aname"  :  "泸西县"
            },
            {
              "id"  :  "532528",
              "aname"  :  "元阳县"
            },
            {
              "id"  :  "532529",
              "aname"  :  "红河县"
            },
            {
              "id"  :  "532530",
              "aname"  :  "金平苗族瑶族傣族自治县"
            },
            {
              "id"  :  "532531",
              "aname"  :  "绿春县"
            },
            {
              "id"  :  "532532",
              "aname"  :  "河口瑶族自治县"
            }
          ]
        },
        {
          "id"  :  "532600",
          "name"  :  "文山壮族苗族自治州",
          "area"  :  [
            {
              "id"  :  "532621",
              "aname"  :  "文山市"
            },
            {
              "id"  :  "532622",
              "aname"  :  "砚山县"
            },
            {
              "id"  :  "532623",
              "aname"  :  "西畴县"
            },
            {
              "id"  :  "532624",
              "aname"  :  "麻栗坡县"
            },
            {
              "id"  :  "532625",
              "aname"  :  "马关县"
            },
            {
              "id"  :  "532626",
              "aname"  :  "丘北县"
            },
            {
              "id"  :  "532627",
              "aname"  :  "广南县"
            },
            {
              "id"  :  "532628",
              "aname"  :  "富宁县"
            }
          ]
        },
        {
          "id"  :  "532800",
          "name"  :  "西双版纳傣族自治州",
          "area"  :  [
            {
              "id"  :  "532801",
              "aname"  :  "景洪市"
            },
            {
              "id"  :  "532822",
              "aname"  :  "勐海县"
            },
            {
              "id"  :  "532823",
              "aname"  :  "勐腊县"
            }
          ]
        },
        {
          "id"  :  "532900",
          "name"  :  "大理白族自治州",
          "area"  :  [
            {
              "id"  :  "532901",
              "aname"  :  "大理市"
            },
            {
              "id"  :  "532922",
              "aname"  :  "漾濞彝族自治县"
            },
            {
              "id"  :  "532923",
              "aname"  :  "祥云县"
            },
            {
              "id"  :  "532924",
              "aname"  :  "宾川县"
            },
            {
              "id"  :  "532925",
              "aname"  :  "弥渡县"
            },
            {
              "id"  :  "532926",
              "aname"  :  "南涧彝族自治县"
            },
            {
              "id"  :  "532927",
              "aname"  :  "巍山彝族回族自治县"
            },
            {
              "id"  :  "532928",
              "aname"  :  "永平县"
            },
            {
              "id"  :  "532929",
              "aname"  :  "云龙县"
            },
            {
              "id"  :  "532930",
              "aname"  :  "洱源县"
            },
            {
              "id"  :  "532931",
              "aname"  :  "剑川县"
            },
            {
              "id"  :  "532932",
              "aname"  :  "鹤庆县"
            }
          ]
        },
        {
          "id"  :  "533100",
          "name"  :  "德宏傣族景颇族自治州",
          "area"  :  [
            {
              "id"  :  "533102",
              "aname"  :  "瑞丽市"
            },
            {
              "id"  :  "533103",
              "aname"  :  "芒市"
            },
            {
              "id"  :  "533122",
              "aname"  :  "梁河县"
            },
            {
              "id"  :  "533123",
              "aname"  :  "盈江县"
            },
            {
              "id"  :  "533124",
              "aname"  :  "陇川县"
            }
          ]
        },
        {
          "id"  :  "533300",
          "name"  :  "怒江傈僳族自治州",
          "area"  :  [
            {
              "id"  :  "533321",
              "aname"  :  "泸水县"
            },
            {
              "id"  :  "533323",
              "aname"  :  "福贡县"
            },
            {
              "id"  :  "533324",
              "aname"  :  "贡山独龙族怒族自治县"
            },
            {
              "id"  :  "533325",
              "aname"  :  "兰坪白族普米族自治县"
            }
          ]
        },
        {
          "id"  :  "533400",
          "name"  :  "迪庆藏族自治州",
          "area"  :  [
            {
              "id"  :  "533421",
              "aname"  :  "香格里拉县"
            },
            {
              "id"  :  "533422",
              "aname"  :  "德钦县"
            },
            {
              "id"  :  "533423",
              "aname"  :  "维西傈僳族自治县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "540000",
      "name"  :  "西藏自治区",
      "city"  :  [
        {
          "id"  :  "540100",
          "name"  :  "拉萨市",
          "area"  :  [
            {
              "id"  :  "540102",
              "aname"  :  "城关区"
            },
            {
              "id"  :  "540121",
              "aname"  :  "林周县"
            },
            {
              "id"  :  "540122",
              "aname"  :  "当雄县"
            },
            {
              "id"  :  "540123",
              "aname"  :  "尼木县"
            },
            {
              "id"  :  "540124",
              "aname"  :  "曲水县"
            },
            {
              "id"  :  "540125",
              "aname"  :  "堆龙德庆县"
            },
            {
              "id"  :  "540126",
              "aname"  :  "达孜县"
            },
            {
              "id"  :  "540127",
              "aname"  :  "墨竹工卡县"
            }
          ]
        },
        {
          "id"  :  "542100",
          "name"  :  "昌都地区",
          "area"  :  [
            {
              "id"  :  "542121",
              "aname"  :  "昌都县"
            },
            {
              "id"  :  "542122",
              "aname"  :  "江达县"
            },
            {
              "id"  :  "542123",
              "aname"  :  "贡觉县"
            },
            {
              "id"  :  "542124",
              "aname"  :  "类乌齐县"
            },
            {
              "id"  :  "542125",
              "aname"  :  "丁青县"
            },
            {
              "id"  :  "542126",
              "aname"  :  "察雅县"
            },
            {
              "id"  :  "542127",
              "aname"  :  "八宿县"
            },
            {
              "id"  :  "542128",
              "aname"  :  "左贡县"
            },
            {
              "id"  :  "542129",
              "aname"  :  "芒康县"
            },
            {
              "id"  :  "542132",
              "aname"  :  "洛隆县"
            },
            {
              "id"  :  "542133",
              "aname"  :  "边坝县"
            }
          ]
        },
        {
          "id"  :  "542200",
          "name"  :  "山南地区",
          "area"  :  [
            {
              "id"  :  "542221",
              "aname"  :  "乃东县"
            },
            {
              "id"  :  "542222",
              "aname"  :  "扎囊县"
            },
            {
              "id"  :  "542223",
              "aname"  :  "贡嘎县"
            },
            {
              "id"  :  "542224",
              "aname"  :  "桑日县"
            },
            {
              "id"  :  "542225",
              "aname"  :  "琼结县"
            },
            {
              "id"  :  "542226",
              "aname"  :  "曲松县"
            },
            {
              "id"  :  "542227",
              "aname"  :  "措美县"
            },
            {
              "id"  :  "542228",
              "aname"  :  "洛扎县"
            },
            {
              "id"  :  "542229",
              "aname"  :  "加查县"
            },
            {
              "id"  :  "542231",
              "aname"  :  "隆子县"
            },
            {
              "id"  :  "542232",
              "aname"  :  "错那县"
            },
            {
              "id"  :  "542233",
              "aname"  :  "浪卡子县"
            }
          ]
        },
        {
          "id"  :  "542300",
          "name"  :  "日喀则地区",
          "area"  :  [
            {
              "id"  :  "542301",
              "aname"  :  "日喀则市"
            },
            {
              "id"  :  "542322",
              "aname"  :  "南木林县"
            },
            {
              "id"  :  "542323",
              "aname"  :  "江孜县"
            },
            {
              "id"  :  "542324",
              "aname"  :  "定日县"
            },
            {
              "id"  :  "542325",
              "aname"  :  "萨迦县"
            },
            {
              "id"  :  "542326",
              "aname"  :  "拉孜县"
            },
            {
              "id"  :  "542327",
              "aname"  :  "昂仁县"
            },
            {
              "id"  :  "542328",
              "aname"  :  "谢通门县"
            },
            {
              "id"  :  "542329",
              "aname"  :  "白朗县"
            },
            {
              "id"  :  "542330",
              "aname"  :  "仁布县"
            },
            {
              "id"  :  "542331",
              "aname"  :  "康马县"
            },
            {
              "id"  :  "542332",
              "aname"  :  "定结县"
            },
            {
              "id"  :  "542333",
              "aname"  :  "仲巴县"
            },
            {
              "id"  :  "542334",
              "aname"  :  "亚东县"
            },
            {
              "id"  :  "542335",
              "aname"  :  "吉隆县"
            },
            {
              "id"  :  "542336",
              "aname"  :  "聂拉木县"
            },
            {
              "id"  :  "542337",
              "aname"  :  "萨嘎县"
            },
            {
              "id"  :  "542338",
              "aname"  :  "岗巴县"
            }
          ]
        },
        {
          "id"  :  "542400",
          "name"  :  "那曲地区",
          "area"  :  [
            {
              "id"  :  "542421",
              "aname"  :  "那曲县"
            },
            {
              "id"  :  "542422",
              "aname"  :  "嘉黎县"
            },
            {
              "id"  :  "542423",
              "aname"  :  "比如县"
            },
            {
              "id"  :  "542424",
              "aname"  :  "聂荣县"
            },
            {
              "id"  :  "542425",
              "aname"  :  "安多县"
            },
            {
              "id"  :  "542426",
              "aname"  :  "申扎县"
            },
            {
              "id"  :  "542427",
              "aname"  :  "索县"
            },
            {
              "id"  :  "542428",
              "aname"  :  "班戈县"
            },
            {
              "id"  :  "542429",
              "aname"  :  "巴青县"
            },
            {
              "id"  :  "542430",
              "aname"  :  "尼玛县"
            }
          ]
        },
        {
          "id"  :  "542500",
          "name"  :  "阿里地区",
          "area"  :  [
            {
              "id"  :  "542521",
              "aname"  :  "普兰县"
            },
            {
              "id"  :  "542522",
              "aname"  :  "札达县"
            },
            {
              "id"  :  "542523",
              "aname"  :  "噶尔县"
            },
            {
              "id"  :  "542524",
              "aname"  :  "日土县"
            },
            {
              "id"  :  "542525",
              "aname"  :  "革吉县"
            },
            {
              "id"  :  "542526",
              "aname"  :  "改则县"
            },
            {
              "id"  :  "542527",
              "aname"  :  "措勤县"
            }
          ]
        },
        {
          "id"  :  "542600",
          "name"  :  "林芝地区",
          "area"  :  [
            {
              "id"  :  "542621",
              "aname"  :  "林芝县"
            },
            {
              "id"  :  "542622",
              "aname"  :  "工布江达县"
            },
            {
              "id"  :  "542623",
              "aname"  :  "米林县"
            },
            {
              "id"  :  "542624",
              "aname"  :  "墨脱县"
            },
            {
              "id"  :  "542625",
              "aname"  :  "波密县"
            },
            {
              "id"  :  "542626",
              "aname"  :  "察隅县"
            },
            {
              "id"  :  "542627",
              "aname"  :  "朗县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "610000",
      "name"  :  "陕西省",
      "city"  :  [
        {
          "id"  :  "610100",
          "name"  :  "西安市",
          "area"  :  [
            {
              "id"  :  "610102",
              "aname"  :  "新城区"
            },
            {
              "id"  :  "610103",
              "aname"  :  "碑林区"
            },
            {
              "id"  :  "610104",
              "aname"  :  "莲湖区"
            },
            {
              "id"  :  "610111",
              "aname"  :  "灞桥区"
            },
            {
              "id"  :  "610112",
              "aname"  :  "未央区"
            },
            {
              "id"  :  "610113",
              "aname"  :  "雁塔区"
            },
            {
              "id"  :  "610114",
              "aname"  :  "阎良区"
            },
            {
              "id"  :  "610115",
              "aname"  :  "临潼区"
            },
            {
              "id"  :  "610116",
              "aname"  :  "长安区"
            },
            {
              "id"  :  "610122",
              "aname"  :  "蓝田县"
            },
            {
              "id"  :  "610124",
              "aname"  :  "周至县"
            },
            {
              "id"  :  "610125",
              "aname"  :  "户县"
            },
            {
              "id"  :  "610126",
              "aname"  :  "高陵县"
            }
          ]
        },
        {
          "id"  :  "610200",
          "name"  :  "铜川市",
          "area"  :  [
            {
              "id"  :  "610202",
              "aname"  :  "王益区"
            },
            {
              "id"  :  "610203",
              "aname"  :  "印台区"
            },
            {
              "id"  :  "610204",
              "aname"  :  "耀州区"
            },
            {
              "id"  :  "610222",
              "aname"  :  "宜君县"
            }
          ]
        },
        {
          "id"  :  "610300",
          "name"  :  "宝鸡市",
          "area"  :  [
            {
              "id"  :  "610302",
              "aname"  :  "渭滨区"
            },
            {
              "id"  :  "610303",
              "aname"  :  "金台区"
            },
            {
              "id"  :  "610304",
              "aname"  :  "陈仓区"
            },
            {
              "id"  :  "610322",
              "aname"  :  "凤翔县"
            },
            {
              "id"  :  "610323",
              "aname"  :  "岐山县"
            },
            {
              "id"  :  "610324",
              "aname"  :  "扶风县"
            },
            {
              "id"  :  "610326",
              "aname"  :  "眉县"
            },
            {
              "id"  :  "610327",
              "aname"  :  "陇县"
            },
            {
              "id"  :  "610328",
              "aname"  :  "千阳县"
            },
            {
              "id"  :  "610329",
              "aname"  :  "麟游县"
            },
            {
              "id"  :  "610330",
              "aname"  :  "凤县"
            },
            {
              "id"  :  "610331",
              "aname"  :  "太白县"
            }
          ]
        },
        {
          "id"  :  "610400",
          "name"  :  "咸阳市",
          "area"  :  [
            {
              "id"  :  "610402",
              "aname"  :  "秦都区"
            },
            {
              "id"  :  "610403",
              "aname"  :  "杨陵区"
            },
            {
              "id"  :  "610404",
              "aname"  :  "渭城区"
            },
            {
              "id"  :  "610422",
              "aname"  :  "三原县"
            },
            {
              "id"  :  "610423",
              "aname"  :  "泾阳县"
            },
            {
              "id"  :  "610424",
              "aname"  :  "乾县"
            },
            {
              "id"  :  "610425",
              "aname"  :  "礼泉县"
            },
            {
              "id"  :  "610426",
              "aname"  :  "永寿县"
            },
            {
              "id"  :  "610427",
              "aname"  :  "彬县"
            },
            {
              "id"  :  "610428",
              "aname"  :  "长武县"
            },
            {
              "id"  :  "610429",
              "aname"  :  "旬邑县"
            },
            {
              "id"  :  "610430",
              "aname"  :  "淳化县"
            },
            {
              "id"  :  "610431",
              "aname"  :  "武功县"
            },
            {
              "id"  :  "610481",
              "aname"  :  "兴平市"
            }
          ]
        },
        {
          "id"  :  "610500",
          "name"  :  "渭南市",
          "area"  :  [
            {
              "id"  :  "610502",
              "aname"  :  "临渭区"
            },
            {
              "id"  :  "610521",
              "aname"  :  "华县"
            },
            {
              "id"  :  "610522",
              "aname"  :  "潼关县"
            },
            {
              "id"  :  "610523",
              "aname"  :  "大荔县"
            },
            {
              "id"  :  "610524",
              "aname"  :  "合阳县"
            },
            {
              "id"  :  "610525",
              "aname"  :  "澄城县"
            },
            {
              "id"  :  "610526",
              "aname"  :  "蒲城县"
            },
            {
              "id"  :  "610527",
              "aname"  :  "白水县"
            },
            {
              "id"  :  "610528",
              "aname"  :  "富平县"
            },
            {
              "id"  :  "610581",
              "aname"  :  "韩城市"
            },
            {
              "id"  :  "610582",
              "aname"  :  "华阴市"
            }
          ]
        },
        {
          "id"  :  "610600",
          "name"  :  "延安市",
          "area"  :  [
            {
              "id"  :  "610602",
              "aname"  :  "宝塔区"
            },
            {
              "id"  :  "610621",
              "aname"  :  "延长县"
            },
            {
              "id"  :  "610622",
              "aname"  :  "延川县"
            },
            {
              "id"  :  "610623",
              "aname"  :  "子长县"
            },
            {
              "id"  :  "610624",
              "aname"  :  "安塞县"
            },
            {
              "id"  :  "610625",
              "aname"  :  "志丹县"
            },
            {
              "id"  :  "610626",
              "aname"  :  "吴起县"
            },
            {
              "id"  :  "610627",
              "aname"  :  "甘泉县"
            },
            {
              "id"  :  "610628",
              "aname"  :  "富县"
            },
            {
              "id"  :  "610629",
              "aname"  :  "洛川县"
            },
            {
              "id"  :  "610630",
              "aname"  :  "宜川县"
            },
            {
              "id"  :  "610631",
              "aname"  :  "黄龙县"
            },
            {
              "id"  :  "610632",
              "aname"  :  "黄陵县"
            }
          ]
        },
        {
          "id"  :  "610700",
          "name"  :  "汉中市",
          "area"  :  [
            {
              "id"  :  "610702",
              "aname"  :  "汉台区"
            },
            {
              "id"  :  "610721",
              "aname"  :  "南郑县"
            },
            {
              "id"  :  "610722",
              "aname"  :  "城固县"
            },
            {
              "id"  :  "610723",
              "aname"  :  "洋县"
            },
            {
              "id"  :  "610724",
              "aname"  :  "西乡县"
            },
            {
              "id"  :  "610725",
              "aname"  :  "勉县"
            },
            {
              "id"  :  "610726",
              "aname"  :  "宁强县"
            },
            {
              "id"  :  "610727",
              "aname"  :  "略阳县"
            },
            {
              "id"  :  "610728",
              "aname"  :  "镇巴县"
            },
            {
              "id"  :  "610729",
              "aname"  :  "留坝县"
            },
            {
              "id"  :  "610730",
              "aname"  :  "佛坪县"
            }
          ]
        },
        {
          "id"  :  "610800",
          "name"  :  "榆林市",
          "area"  :  [
            {
              "id"  :  "610802",
              "aname"  :  "榆阳区"
            },
            {
              "id"  :  "610821",
              "aname"  :  "神木县"
            },
            {
              "id"  :  "610822",
              "aname"  :  "府谷县"
            },
            {
              "id"  :  "610823",
              "aname"  :  "横山县"
            },
            {
              "id"  :  "610824",
              "aname"  :  "靖边县"
            },
            {
              "id"  :  "610825",
              "aname"  :  "定边县"
            },
            {
              "id"  :  "610826",
              "aname"  :  "绥德县"
            },
            {
              "id"  :  "610827",
              "aname"  :  "米脂县"
            },
            {
              "id"  :  "610828",
              "aname"  :  "佳县"
            },
            {
              "id"  :  "610829",
              "aname"  :  "吴堡县"
            },
            {
              "id"  :  "610830",
              "aname"  :  "清涧县"
            },
            {
              "id"  :  "610831",
              "aname"  :  "子洲县"
            }
          ]
        },
        {
          "id"  :  "610900",
          "name"  :  "安康市",
          "area"  :  [
            {
              "id"  :  "610902",
              "aname"  :  "汉滨区"
            },
            {
              "id"  :  "610921",
              "aname"  :  "汉阴县"
            },
            {
              "id"  :  "610922",
              "aname"  :  "石泉县"
            },
            {
              "id"  :  "610923",
              "aname"  :  "宁陕县"
            },
            {
              "id"  :  "610924",
              "aname"  :  "紫阳县"
            },
            {
              "id"  :  "610925",
              "aname"  :  "岚皋县"
            },
            {
              "id"  :  "610926",
              "aname"  :  "平利县"
            },
            {
              "id"  :  "610927",
              "aname"  :  "镇坪县"
            },
            {
              "id"  :  "610928",
              "aname"  :  "旬阳县"
            },
            {
              "id"  :  "610929",
              "aname"  :  "白河县"
            }
          ]
        },
        {
          "id"  :  "611000",
          "name"  :  "商洛市",
          "area"  :  [
            {
              "id"  :  "611002",
              "aname"  :  "商州区"
            },
            {
              "id"  :  "611021",
              "aname"  :  "洛南县"
            },
            {
              "id"  :  "611022",
              "aname"  :  "丹凤县"
            },
            {
              "id"  :  "611023",
              "aname"  :  "商南县"
            },
            {
              "id"  :  "611024",
              "aname"  :  "山阳县"
            },
            {
              "id"  :  "611025",
              "aname"  :  "镇安县"
            },
            {
              "id"  :  "611026",
              "aname"  :  "柞水县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "620000",
      "name"  :  "甘肃省",
      "city"  :  [
        {
          "id"  :  "620100",
          "name"  :  "兰州市",
          "area"  :  [
            {
              "id"  :  "620102",
              "aname"  :  "城关区"
            },
            {
              "id"  :  "620103",
              "aname"  :  "七里河区"
            },
            {
              "id"  :  "620104",
              "aname"  :  "西固区"
            },
            {
              "id"  :  "620105",
              "aname"  :  "安宁区"
            },
            {
              "id"  :  "620111",
              "aname"  :  "红古区"
            },
            {
              "id"  :  "620121",
              "aname"  :  "永登县"
            },
            {
              "id"  :  "620122",
              "aname"  :  "皋兰县"
            },
            {
              "id"  :  "620123",
              "aname"  :  "榆中县"
            }
          ]
        },
        {
          "id"  :  "620200",
          "name"  :  "嘉峪关市",
          "area"  :  [
            {
              "id"  :  "620201",
              "aname"  :  "嘉峪关市"
            }
          ]
        },
        {
          "id"  :  "620300",
          "name"  :  "金昌市",
          "area"  :  [
            {
              "id"  :  "620302",
              "aname"  :  "金川区"
            },
            {
              "id"  :  "620321",
              "aname"  :  "永昌县"
            }
          ]
        },
        {
          "id"  :  "620400",
          "name"  :  "白银市",
          "area"  :  [
            {
              "id"  :  "620402",
              "aname"  :  "白银区"
            },
            {
              "id"  :  "620403",
              "aname"  :  "平川区"
            },
            {
              "id"  :  "620421",
              "aname"  :  "靖远县"
            },
            {
              "id"  :  "620422",
              "aname"  :  "会宁县"
            },
            {
              "id"  :  "620423",
              "aname"  :  "景泰县"
            }
          ]
        },
        {
          "id"  :  "620500",
          "name"  :  "天水市",
          "area"  :  [
            {
              "id"  :  "620502",
              "aname"  :  "秦州区"
            },
            {
              "id"  :  "620503",
              "aname"  :  "麦积区"
            },
            {
              "id"  :  "620521",
              "aname"  :  "清水县"
            },
            {
              "id"  :  "620522",
              "aname"  :  "秦安县"
            },
            {
              "id"  :  "620523",
              "aname"  :  "甘谷县"
            },
            {
              "id"  :  "620524",
              "aname"  :  "武山县"
            },
            {
              "id"  :  "620525",
              "aname"  :  "张家川回族自治县"
            }
          ]
        },
        {
          "id"  :  "620600",
          "name"  :  "武威市",
          "area"  :  [
            {
              "id"  :  "620602",
              "aname"  :  "凉州区"
            },
            {
              "id"  :  "620621",
              "aname"  :  "民勤县"
            },
            {
              "id"  :  "620622",
              "aname"  :  "古浪县"
            },
            {
              "id"  :  "620623",
              "aname"  :  "天祝藏族自治县"
            }
          ]
        },
        {
          "id"  :  "620700",
          "name"  :  "张掖市",
          "area"  :  [
            {
              "id"  :  "620702",
              "aname"  :  "甘州区"
            },
            {
              "id"  :  "620721",
              "aname"  :  "肃南裕固族自治县"
            },
            {
              "id"  :  "620722",
              "aname"  :  "民乐县"
            },
            {
              "id"  :  "620723",
              "aname"  :  "临泽县"
            },
            {
              "id"  :  "620724",
              "aname"  :  "高台县"
            },
            {
              "id"  :  "620725",
              "aname"  :  "山丹县"
            }
          ]
        },
        {
          "id"  :  "620800",
          "name"  :  "平凉市",
          "area"  :  [
            {
              "id"  :  "620802",
              "aname"  :  "崆峒区"
            },
            {
              "id"  :  "620821",
              "aname"  :  "泾川县"
            },
            {
              "id"  :  "620822",
              "aname"  :  "灵台县"
            },
            {
              "id"  :  "620823",
              "aname"  :  "崇信县"
            },
            {
              "id"  :  "620824",
              "aname"  :  "华亭县"
            },
            {
              "id"  :  "620825",
              "aname"  :  "庄浪县"
            },
            {
              "id"  :  "620826",
              "aname"  :  "静宁县"
            }
          ]
        },
        {
          "id"  :  "620900",
          "name"  :  "酒泉市",
          "area"  :  [
            {
              "id"  :  "620902",
              "aname"  :  "肃州区"
            },
            {
              "id"  :  "620921",
              "aname"  :  "金塔县"
            },
            {
              "id"  :  "620922",
              "aname"  :  "瓜州县"
            },
            {
              "id"  :  "620923",
              "aname"  :  "肃北蒙古族自治县"
            },
            {
              "id"  :  "620924",
              "aname"  :  "阿克塞哈萨克族自治县"
            },
            {
              "id"  :  "620981",
              "aname"  :  "玉门市"
            },
            {
              "id"  :  "620982",
              "aname"  :  "敦煌市"
            }
          ]
        },
        {
          "id"  :  "621000",
          "name"  :  "庆阳市",
          "area"  :  [
            {
              "id"  :  "621002",
              "aname"  :  "西峰区"
            },
            {
              "id"  :  "621021",
              "aname"  :  "庆城县"
            },
            {
              "id"  :  "621022",
              "aname"  :  "环县"
            },
            {
              "id"  :  "621023",
              "aname"  :  "华池县"
            },
            {
              "id"  :  "621024",
              "aname"  :  "合水县"
            },
            {
              "id"  :  "621025",
              "aname"  :  "正宁县"
            },
            {
              "id"  :  "621026",
              "aname"  :  "宁县"
            },
            {
              "id"  :  "621027",
              "aname"  :  "镇原县"
            }
          ]
        },
        {
          "id"  :  "621100",
          "name"  :  "定西市",
          "area"  :  [
            {
              "id"  :  "621102",
              "aname"  :  "安定区"
            },
            {
              "id"  :  "621121",
              "aname"  :  "通渭县"
            },
            {
              "id"  :  "621122",
              "aname"  :  "陇西县"
            },
            {
              "id"  :  "621123",
              "aname"  :  "渭源县"
            },
            {
              "id"  :  "621124",
              "aname"  :  "临洮县"
            },
            {
              "id"  :  "621125",
              "aname"  :  "漳县"
            },
            {
              "id"  :  "621126",
              "aname"  :  "岷县"
            }
          ]
        },
        {
          "id"  :  "621200",
          "name"  :  "陇南市",
          "area"  :  [
            {
              "id"  :  "621202",
              "aname"  :  "武都区"
            },
            {
              "id"  :  "621221",
              "aname"  :  "成县"
            },
            {
              "id"  :  "621222",
              "aname"  :  "文县"
            },
            {
              "id"  :  "621223",
              "aname"  :  "宕昌县"
            },
            {
              "id"  :  "621224",
              "aname"  :  "康县"
            },
            {
              "id"  :  "621225",
              "aname"  :  "西和县"
            },
            {
              "id"  :  "621226",
              "aname"  :  "礼县"
            },
            {
              "id"  :  "621227",
              "aname"  :  "徽县"
            },
            {
              "id"  :  "621228",
              "aname"  :  "两当县"
            }
          ]
        },
        {
          "id"  :  "622900",
          "name"  :  "临夏回族自治州",
          "area"  :  [
            {
              "id"  :  "622901",
              "aname"  :  "临夏市"
            },
            {
              "id"  :  "622921",
              "aname"  :  "临夏县"
            },
            {
              "id"  :  "622922",
              "aname"  :  "康乐县"
            },
            {
              "id"  :  "622923",
              "aname"  :  "永靖县"
            },
            {
              "id"  :  "622924",
              "aname"  :  "广河县"
            },
            {
              "id"  :  "622925",
              "aname"  :  "和政县"
            },
            {
              "id"  :  "622926",
              "aname"  :  "东乡族自治县"
            },
            {
              "id"  :  "622927",
              "aname"  :  "积石山保安族东乡族撒拉族自治县"
            }
          ]
        },
        {
          "id"  :  "623000",
          "name"  :  "甘南藏族自治州",
          "area"  :  [
            {
              "id"  :  "623001",
              "aname"  :  "合作市"
            },
            {
              "id"  :  "623021",
              "aname"  :  "临潭县"
            },
            {
              "id"  :  "623022",
              "aname"  :  "卓尼县"
            },
            {
              "id"  :  "623023",
              "aname"  :  "舟曲县"
            },
            {
              "id"  :  "623024",
              "aname"  :  "迭部县"
            },
            {
              "id"  :  "623025",
              "aname"  :  "玛曲县"
            },
            {
              "id"  :  "623026",
              "aname"  :  "碌曲县"
            },
            {
              "id"  :  "623027",
              "aname"  :  "夏河县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "630000",
      "name"  :  "青海省",
      "city"  :  [
        {
          "id"  :  "630100",
          "name"  :  "西宁市",
          "area"  :  [
            {
              "id"  :  "630102",
              "aname"  :  "城东区"
            },
            {
              "id"  :  "630103",
              "aname"  :  "城中区"
            },
            {
              "id"  :  "630104",
              "aname"  :  "城西区"
            },
            {
              "id"  :  "630105",
              "aname"  :  "城北区"
            },
            {
              "id"  :  "630121",
              "aname"  :  "大通回族土族自治县"
            },
            {
              "id"  :  "630122",
              "aname"  :  "湟中县"
            },
            {
              "id"  :  "630123",
              "aname"  :  "湟源县"
            }
          ]
        },
        {
          "id"  :  "632100",
          "name"  :  "海东地区",
          "area"  :  [
            {
              "id"  :  "632121",
              "aname"  :  "平安县"
            },
            {
              "id"  :  "632122",
              "aname"  :  "民和回族土族自治县"
            },
            {
              "id"  :  "632123",
              "aname"  :  "乐都县"
            },
            {
              "id"  :  "632126",
              "aname"  :  "互助土族自治县"
            },
            {
              "id"  :  "632127",
              "aname"  :  "化隆回族自治县"
            },
            {
              "id"  :  "632128",
              "aname"  :  "循化撒拉族自治县"
            }
          ]
        },
        {
          "id"  :  "632200",
          "name"  :  "海北藏族自治州",
          "area"  :  [
            {
              "id"  :  "632221",
              "aname"  :  "门源回族自治县"
            },
            {
              "id"  :  "632222",
              "aname"  :  "祁连县"
            },
            {
              "id"  :  "632223",
              "aname"  :  "海晏县"
            },
            {
              "id"  :  "632224",
              "aname"  :  "刚察县"
            }
          ]
        },
        {
          "id"  :  "632300",
          "name"  :  "黄南藏族自治州",
          "area"  :  [
            {
              "id"  :  "632321",
              "aname"  :  "同仁县"
            },
            {
              "id"  :  "632322",
              "aname"  :  "尖扎县"
            },
            {
              "id"  :  "632323",
              "aname"  :  "泽库县"
            },
            {
              "id"  :  "632324",
              "aname"  :  "河南蒙古族自治县"
            }
          ]
        },
        {
          "id"  :  "632500",
          "name"  :  "海南藏族自治州",
          "area"  :  [
            {
              "id"  :  "632521",
              "aname"  :  "共和县"
            },
            {
              "id"  :  "632522",
              "aname"  :  "同德县"
            },
            {
              "id"  :  "632523",
              "aname"  :  "贵德县"
            },
            {
              "id"  :  "632524",
              "aname"  :  "兴海县"
            },
            {
              "id"  :  "632525",
              "aname"  :  "贵南县"
            }
          ]
        },
        {
          "id"  :  "632600",
          "name"  :  "果洛藏族自治州",
          "area"  :  [
            {
              "id"  :  "632621",
              "aname"  :  "玛沁县"
            },
            {
              "id"  :  "632622",
              "aname"  :  "班玛县"
            },
            {
              "id"  :  "632623",
              "aname"  :  "甘德县"
            },
            {
              "id"  :  "632624",
              "aname"  :  "达日县"
            },
            {
              "id"  :  "632625",
              "aname"  :  "久治县"
            },
            {
              "id"  :  "632626",
              "aname"  :  "玛多县"
            }
          ]
        },
        {
          "id"  :  "632700",
          "name"  :  "玉树藏族自治州",
          "area"  :  [
            {
              "id"  :  "632721",
              "aname"  :  "玉树县"
            },
            {
              "id"  :  "632722",
              "aname"  :  "杂多县"
            },
            {
              "id"  :  "632723",
              "aname"  :  "称多县"
            },
            {
              "id"  :  "632724",
              "aname"  :  "治多县"
            },
            {
              "id"  :  "632725",
              "aname"  :  "囊谦县"
            },
            {
              "id"  :  "632726",
              "aname"  :  "曲麻莱县"
            }
          ]
        },
        {
          "id"  :  "632800",
          "name"  :  "海西蒙古族藏族自治州",
          "area"  :  [
            {
              "id"  :  "632801",
              "aname"  :  "格尔木市"
            },
            {
              "id"  :  "632802",
              "aname"  :  "德令哈市"
            },
            {
              "id"  :  "632821",
              "aname"  :  "乌兰县"
            },
            {
              "id"  :  "632822",
              "aname"  :  "都兰县"
            },
            {
              "id"  :  "632823",
              "aname"  :  "天峻县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "640000",
      "name"  :  "宁夏回族自治区",
      "city"  :  [
        {
          "id"  :  "640100",
          "name"  :  "银川市",
          "area"  :  [
            {
              "id"  :  "640104",
              "aname"  :  "兴庆区"
            },
            {
              "id"  :  "640105",
              "aname"  :  "西夏区"
            },
            {
              "id"  :  "640106",
              "aname"  :  "金凤区"
            },
            {
              "id"  :  "640121",
              "aname"  :  "永宁县"
            },
            {
              "id"  :  "640122",
              "aname"  :  "贺兰县"
            },
            {
              "id"  :  "640181",
              "aname"  :  "灵武市"
            }
          ]
        },
        {
          "id"  :  "640200",
          "name"  :  "石嘴山市",
          "area"  :  [
            {
              "id"  :  "640202",
              "aname"  :  "大武口区"
            },
            {
              "id"  :  "640205",
              "aname"  :  "惠农区"
            },
            {
              "id"  :  "640221",
              "aname"  :  "平罗县"
            }
          ]
        },
        {
          "id"  :  "640300",
          "name"  :  "吴忠市",
          "area"  :  [
            {
              "id"  :  "640302",
              "aname"  :  "利通区"
            },
            {
              "id"  :  "640303",
              "aname"  :  "红寺堡区"
            },
            {
              "id"  :  "640323",
              "aname"  :  "盐池县"
            },
            {
              "id"  :  "640324",
              "aname"  :  "同心县"
            },
            {
              "id"  :  "640381",
              "aname"  :  "青铜峡市"
            }
          ]
        },
        {
          "id"  :  "640400",
          "name"  :  "固原市",
          "area"  :  [
            {
              "id"  :  "640402",
              "aname"  :  "原州区"
            },
            {
              "id"  :  "640422",
              "aname"  :  "西吉县"
            },
            {
              "id"  :  "640423",
              "aname"  :  "隆德县"
            },
            {
              "id"  :  "640424",
              "aname"  :  "泾源县"
            },
            {
              "id"  :  "640425",
              "aname"  :  "彭阳县"
            }
          ]
        },
        {
          "id"  :  "640500",
          "name"  :  "中卫市",
          "area"  :  [
            {
              "id"  :  "640502",
              "aname"  :  "沙坡头区"
            },
            {
              "id"  :  "640521",
              "aname"  :  "中宁县"
            },
            {
              "id"  :  "640522",
              "aname"  :  "海原县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "650000",
      "name"  :  "新疆维吾尔自治区",
      "city"  :  [
        {
          "id"  :  "650100",
          "name"  :  "乌鲁木齐市",
          "area"  :  [
            {
              "id"  :  "650102",
              "aname"  :  "天山区"
            },
            {
              "id"  :  "650103",
              "aname"  :  "沙依巴克区"
            },
            {
              "id"  :  "650104",
              "aname"  :  "新市区"
            },
            {
              "id"  :  "650105",
              "aname"  :  "水磨沟区"
            },
            {
              "id"  :  "650106",
              "aname"  :  "头屯河区"
            },
            {
              "id"  :  "650107",
              "aname"  :  "达坂城区"
            },
            {
              "id"  :  "650109",
              "aname"  :  "米东区"
            },
            {
              "id"  :  "650121",
              "aname"  :  "乌鲁木齐县"
            }
          ]
        },
        {
          "id"  :  "650200",
          "name"  :  "克拉玛依市",
          "area"  :  [
            {
              "id"  :  "650202",
              "aname"  :  "独山子区"
            },
            {
              "id"  :  "650203",
              "aname"  :  "克拉玛依区"
            },
            {
              "id"  :  "650204",
              "aname"  :  "白碱滩区"
            },
            {
              "id"  :  "650205",
              "aname"  :  "乌尔禾区"
            }
          ]
        },
        {
          "id"  :  "652100",
          "name"  :  "吐鲁番地区",
          "area"  :  [
            {
              "id"  :  "652101",
              "aname"  :  "吐鲁番市"
            },
            {
              "id"  :  "652122",
              "aname"  :  "鄯善县"
            },
            {
              "id"  :  "652123",
              "aname"  :  "托克逊县"
            }
          ]
        },
        {
          "id"  :  "652200",
          "name"  :  "哈密地区",
          "area"  :  [
            {
              "id"  :  "652201",
              "aname"  :  "哈密市"
            },
            {
              "id"  :  "652222",
              "aname"  :  "巴里坤哈萨克自治县"
            },
            {
              "id"  :  "652223",
              "aname"  :  "伊吾县"
            }
          ]
        },
        {
          "id"  :  "652300",
          "name"  :  "昌吉回族自治州",
          "area"  :  [
            {
              "id"  :  "652301",
              "aname"  :  "昌吉市"
            },
            {
              "id"  :  "652302",
              "aname"  :  "阜康市"
            },
            {
              "id"  :  "652323",
              "aname"  :  "呼图壁县"
            },
            {
              "id"  :  "652324",
              "aname"  :  "玛纳斯县"
            },
            {
              "id"  :  "652325",
              "aname"  :  "奇台县"
            },
            {
              "id"  :  "652327",
              "aname"  :  "吉木萨尔县"
            },
            {
              "id"  :  "652328",
              "aname"  :  "木垒哈萨克自治县"
            }
          ]
        },
        {
          "id"  :  "652700",
          "name"  :  "博尔塔拉蒙古自治州",
          "area"  :  [
            {
              "id"  :  "652701",
              "aname"  :  "博乐市"
            },
            {
              "id"  :  "652722",
              "aname"  :  "精河县"
            },
            {
              "id"  :  "652723",
              "aname"  :  "温泉县"
            }
          ]
        },
        {
          "id"  :  "652800",
          "name"  :  "巴音郭楞蒙古自治州",
          "area"  :  [
            {
              "id"  :  "652801",
              "aname"  :  "库尔勒市"
            },
            {
              "id"  :  "652822",
              "aname"  :  "轮台县"
            },
            {
              "id"  :  "652823",
              "aname"  :  "尉犁县"
            },
            {
              "id"  :  "652824",
              "aname"  :  "若羌县"
            },
            {
              "id"  :  "652825",
              "aname"  :  "且末县"
            },
            {
              "id"  :  "652826",
              "aname"  :  "焉耆回族自治县"
            },
            {
              "id"  :  "652827",
              "aname"  :  "和静县"
            },
            {
              "id"  :  "652828",
              "aname"  :  "和硕县"
            },
            {
              "id"  :  "652829",
              "aname"  :  "博湖县"
            }
          ]
        },
        {
          "id"  :  "652900",
          "name"  :  "阿克苏地区",
          "area"  :  [
            {
              "id"  :  "652901",
              "aname"  :  "阿克苏市"
            },
            {
              "id"  :  "652922",
              "aname"  :  "温宿县"
            },
            {
              "id"  :  "652923",
              "aname"  :  "库车县"
            },
            {
              "id"  :  "652924",
              "aname"  :  "沙雅县"
            },
            {
              "id"  :  "652925",
              "aname"  :  "新和县"
            },
            {
              "id"  :  "652926",
              "aname"  :  "拜城县"
            },
            {
              "id"  :  "652927",
              "aname"  :  "乌什县"
            },
            {
              "id"  :  "652928",
              "aname"  :  "阿瓦提县"
            },
            {
              "id"  :  "652929",
              "aname"  :  "柯坪县"
            }
          ]
        },
        {
          "id"  :  "653000",
          "name"  :  "克孜勒苏柯尔克孜自治州",
          "area"  :  [
            {
              "id"  :  "653001",
              "aname"  :  "阿图什市"
            },
            {
              "id"  :  "653022",
              "aname"  :  "阿克陶县"
            },
            {
              "id"  :  "653023",
              "aname"  :  "阿合奇县"
            },
            {
              "id"  :  "653024",
              "aname"  :  "乌恰县"
            }
          ]
        },
        {
          "id"  :  "653100",
          "name"  :  "喀什地区",
          "area"  :  [
            {
              "id"  :  "653101",
              "aname"  :  "喀什市"
            },
            {
              "id"  :  "653121",
              "aname"  :  "疏附县"
            },
            {
              "id"  :  "653122",
              "aname"  :  "疏勒县"
            },
            {
              "id"  :  "653123",
              "aname"  :  "英吉沙县"
            },
            {
              "id"  :  "653124",
              "aname"  :  "泽普县"
            },
            {
              "id"  :  "653125",
              "aname"  :  "莎车县"
            },
            {
              "id"  :  "653126",
              "aname"  :  "叶城县"
            },
            {
              "id"  :  "653127",
              "aname"  :  "麦盖提县"
            },
            {
              "id"  :  "653128",
              "aname"  :  "岳普湖县"
            },
            {
              "id"  :  "653129",
              "aname"  :  "伽师县"
            },
            {
              "id"  :  "653130",
              "aname"  :  "巴楚县"
            },
            {
              "id"  :  "653131",
              "aname"  :  "塔什库尔干塔吉克自治县"
            }
          ]
        },
        {
          "id"  :  "653200",
          "name"  :  "和田地区",
          "area"  :  [
            {
              "id"  :  "653201",
              "aname"  :  "和田市"
            },
            {
              "id"  :  "653221",
              "aname"  :  "和田县"
            },
            {
              "id"  :  "653222",
              "aname"  :  "墨玉县"
            },
            {
              "id"  :  "653223",
              "aname"  :  "皮山县"
            },
            {
              "id"  :  "653224",
              "aname"  :  "洛浦县"
            },
            {
              "id"  :  "653225",
              "aname"  :  "策勒县"
            },
            {
              "id"  :  "653226",
              "aname"  :  "于田县"
            },
            {
              "id"  :  "653227",
              "aname"  :  "民丰县"
            }
          ]
        },
        {
          "id"  :  "654000",
          "name"  :  "伊犁哈萨克自治州",
          "area"  :  [
            {
              "id"  :  "654002",
              "aname"  :  "伊宁市"
            },
            {
              "id"  :  "654003",
              "aname"  :  "奎屯市"
            },
            {
              "id"  :  "654021",
              "aname"  :  "伊宁县"
            },
            {
              "id"  :  "654022",
              "aname"  :  "察布查尔锡伯自治县"
            },
            {
              "id"  :  "654023",
              "aname"  :  "霍城县"
            },
            {
              "id"  :  "654024",
              "aname"  :  "巩留县"
            },
            {
              "id"  :  "654025",
              "aname"  :  "新源县"
            },
            {
              "id"  :  "654026",
              "aname"  :  "昭苏县"
            },
            {
              "id"  :  "654027",
              "aname"  :  "特克斯县"
            },
            {
              "id"  :  "654028",
              "aname"  :  "尼勒克县"
            }
          ]
        },
        {
          "id"  :  "654200",
          "name"  :  "塔城地区",
          "area"  :  [
            {
              "id"  :  "654201",
              "aname"  :  "塔城市"
            },
            {
              "id"  :  "654202",
              "aname"  :  "乌苏市"
            },
            {
              "id"  :  "654221",
              "aname"  :  "额敏县"
            },
            {
              "id"  :  "654223",
              "aname"  :  "沙湾县"
            },
            {
              "id"  :  "654224",
              "aname"  :  "托里县"
            },
            {
              "id"  :  "654225",
              "aname"  :  "裕民县"
            },
            {
              "id"  :  "654226",
              "aname"  :  "和布克赛尔蒙古自治县"
            }
          ]
        },
        {
          "id"  :  "654300",
          "name"  :  "阿勒泰地区",
          "area"  :  [
            {
              "id"  :  "654301",
              "aname"  :  "阿勒泰市"
            },
            {
              "id"  :  "654321",
              "aname"  :  "布尔津县"
            },
            {
              "id"  :  "654322",
              "aname"  :  "富蕴县"
            },
            {
              "id"  :  "654323",
              "aname"  :  "福海县"
            },
            {
              "id"  :  "654324",
              "aname"  :  "哈巴河县"
            },
            {
              "id"  :  "654325",
              "aname"  :  "青河县"
            },
            {
              "id"  :  "654326",
              "aname"  :  "吉木乃县"
            }
          ]
        },
        {
          "id"  :  "659000",
          "name"  :  "自治区直辖",
          "area"  :  [
            {
              "id"  :  "659001",
              "aname"  :  "石河子市"
            },
            {
              "id"  :  "659002",
              "aname"  :  "阿拉尔市"
            },
            {
              "id"  :  "659003",
              "aname"  :  "图木舒克市"
            },
            {
              "id"  :  "659004",
              "aname"  :  "五家渠市"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "710000",
      "name"  :  "台湾省",
      "city"  :  [
        {
          "id"  :  "710100",
          "name"  :  "台北市",
          "area"  :  [
            {
              "id"  :  "710101",
              "aname"  :  "中正区"
            },
            {
              "id"  :  "710102",
              "aname"  :  "大同区"
            },
            {
              "id"  :  "710103",
              "aname"  :  "中山区"
            },
            {
              "id"  :  "710104",
              "aname"  :  "松山区"
            },
            {
              "id"  :  "710105",
              "aname"  :  "大安区"
            },
            {
              "id"  :  "710106",
              "aname"  :  "万华区"
            },
            {
              "id"  :  "710107",
              "aname"  :  "信义区"
            },
            {
              "id"  :  "710108",
              "aname"  :  "士林区"
            },
            {
              "id"  :  "710109",
              "aname"  :  "北投区"
            },
            {
              "id"  :  "710110",
              "aname"  :  "内湖区"
            },
            {
              "id"  :  "710111",
              "aname"  :  "南港区"
            },
            {
              "id"  :  "710112",
              "aname"  :  "文山区"
            }
          ]
        },
        {
          "id"  :  "710200",
          "name"  :  "高雄市",
          "area"  :  [
            {
              "id"  :  "710201",
              "aname"  :  "新兴区"
            },
            {
              "id"  :  "710202",
              "aname"  :  "前金区"
            },
            {
              "id"  :  "710203",
              "aname"  :  "芩雅区"
            },
            {
              "id"  :  "710204",
              "aname"  :  "盐埕区"
            },
            {
              "id"  :  "710205",
              "aname"  :  "鼓山区"
            },
            {
              "id"  :  "710206",
              "aname"  :  "旗津区"
            },
            {
              "id"  :  "710207",
              "aname"  :  "前镇区"
            },
            {
              "id"  :  "710208",
              "aname"  :  "三民区"
            },
            {
              "id"  :  "710209",
              "aname"  :  "左营区"
            },
            {
              "id"  :  "710210",
              "aname"  :  "楠梓区"
            },
            {
              "id"  :  "710211",
              "aname"  :  "小港区"
            }
          ]
        },
        {
          "id"  :  "710300",
          "name"  :  "基隆市",
          "area"  :  [
            {
              "id"  :  "710301",
              "aname"  :  "仁爱区"
            },
            {
              "id"  :  "710302",
              "aname"  :  "信义区"
            },
            {
              "id"  :  "710303",
              "aname"  :  "中正区"
            },
            {
              "id"  :  "710304",
              "aname"  :  "中山区"
            },
            {
              "id"  :  "710305",
              "aname"  :  "安乐区"
            },
            {
              "id"  :  "710306",
              "aname"  :  "暖暖区"
            },
            {
              "id"  :  "710307",
              "aname"  :  "七堵区"
            }
          ]
        },
        {
          "id"  :  "710400",
          "name"  :  "台中市",
          "area"  :  [
            {
              "id"  :  "710401",
              "aname"  :  "中区"
            },
            {
              "id"  :  "710402",
              "aname"  :  "东区"
            },
            {
              "id"  :  "710403",
              "aname"  :  "南区"
            },
            {
              "id"  :  "710404",
              "aname"  :  "西区"
            },
            {
              "id"  :  "710405",
              "aname"  :  "北区"
            },
            {
              "id"  :  "710406",
              "aname"  :  "北屯区"
            },
            {
              "id"  :  "710407",
              "aname"  :  "西屯区"
            },
            {
              "id"  :  "710408",
              "aname"  :  "南屯区"
            }
          ]
        },
        {
          "id"  :  "710500",
          "name"  :  "台南市",
          "area"  :  [
            {
              "id"  :  "710501",
              "aname"  :  "中西区"
            },
            {
              "id"  :  "710502",
              "aname"  :  "东区"
            },
            {
              "id"  :  "710503",
              "aname"  :  "南区"
            },
            {
              "id"  :  "710504",
              "aname"  :  "北区"
            },
            {
              "id"  :  "710505",
              "aname"  :  "安平区"
            },
            {
              "id"  :  "710506",
              "aname"  :  "安南区"
            }
          ]
        },
        {
          "id"  :  "710600",
          "name"  :  "新竹市",
          "area"  :  [
            {
              "id"  :  "710601",
              "aname"  :  "东区"
            },
            {
              "id"  :  "710602",
              "aname"  :  "北区"
            },
            {
              "id"  :  "710603",
              "aname"  :  "香山区"
            }
          ]
        },
        {
          "id"  :  "710700",
          "name"  :  "嘉义市",
          "area"  :  [
            {
              "id"  :  "710701",
              "aname"  :  "东区"
            },
            {
              "id"  :  "710702",
              "aname"  :  "西区"
            }
          ]
        },
        {
          "id"  :  "719000",
          "name"  :  "省直辖",
          "area"  :  [
            {
              "id"  :  "719001",
              "aname"  :  "台北县"
            },
            {
              "id"  :  "719002",
              "aname"  :  "宜兰县"
            },
            {
              "id"  :  "719003",
              "aname"  :  "新竹县"
            },
            {
              "id"  :  "719004",
              "aname"  :  "桃园县"
            },
            {
              "id"  :  "719005",
              "aname"  :  "苗栗县"
            },
            {
              "id"  :  "719006",
              "aname"  :  "台中县"
            },
            {
              "id"  :  "719007",
              "aname"  :  "彰化县"
            },
            {
              "id"  :  "719008",
              "aname"  :  "南投县"
            },
            {
              "id"  :  "719009",
              "aname"  :  "嘉义县"
            },
            {
              "id"  :  "719010",
              "aname"  :  "云林县"
            },
            {
              "id"  :  "719011",
              "aname"  :  "台南县"
            },
            {
              "id"  :  "719012",
              "aname"  :  "高雄县"
            },
            {
              "id"  :  "719013",
              "aname"  :  "屏东县"
            },
            {
              "id"  :  "719014",
              "aname"  :  "台东县"
            },
            {
              "id"  :  "719015",
              "aname"  :  "花莲县"
            },
            {
              "id"  :  "719016",
              "aname"  :  "澎湖县"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "810000",
      "name"  :  "香港特别行政区",
      "city"  :  [
        {
          "id"  :  "810100",
          "name"  :  "香港岛",
          "area"  :  [
            {
              "id"  :  "810101",
              "aname"  :  "中西区"
            },
            {
              "id"  :  "810102",
              "aname"  :  "湾仔区"
            },
            {
              "id"  :  "810103",
              "aname"  :  "东区"
            },
            {
              "id"  :  "810104",
              "aname"  :  "南区"
            }
          ]
        },
        {
          "id"  :  "810200",
          "name"  :  "九龙",
          "area"  :  [
            {
              "id"  :  "810201",
              "aname"  :  "油尖旺区"
            },
            {
              "id"  :  "810202",
              "aname"  :  "深水埗区"
            },
            {
              "id"  :  "810203",
              "aname"  :  "九龙城区"
            },
            {
              "id"  :  "810204",
              "aname"  :  "黄大仙区"
            },
            {
              "id"  :  "810205",
              "aname"  :  "观塘区"
            }
          ]
        },
        {
          "id"  :  "810300",
          "name"  :  "新界",
          "area"  :  [
            {
              "id"  :  "810301",
              "aname"  :  "北区"
            },
            {
              "id"  :  "810302",
              "aname"  :  "大埔区"
            },
            {
              "id"  :  "810303",
              "aname"  :  "沙田区"
            },
            {
              "id"  :  "810304",
              "aname"  :  "西贡区"
            },
            {
              "id"  :  "810305",
              "aname"  :  "荃湾区"
            },
            {
              "id"  :  "810306",
              "aname"  :  "屯门区"
            },
            {
              "id"  :  "810307",
              "aname"  :  "元朗区"
            },
            {
              "id"  :  "810308",
              "aname"  :  "葵青区"
            },
            {
              "id"  :  "810309",
              "aname"  :  "离岛区"
            }
          ]
        }
      ]
    },
    {
      "id"  :  "820000",
      "name"  :  "澳门特别行政区",
      "city"  :  [
        {
          "id"  :  "820100",
          "name"  :  "澳门半岛",
          "area"  :  [
            {
              "id"  :  "820101",
              "aname"  :  "花地玛堂区"
            },
            {
              "id"  :  "820102",
              "aname"  :  "圣安多尼堂区"
            },
            {
              "id"  :  "820103",
              "aname"  :  "大堂区"
            },
            {
              "id"  :  "820104",
              "aname"  :  "望德堂区"
            },
            {
              "id"  :  "820105",
              "aname"  :  "风顺堂区"
            }
          ]
        },
        {
          "id"  :  "820200",
          "name"  :  "澳门离岛",
          "area"  :  [
            {
              "id"  :  "820201",
              "aname"  :  "嘉模堂区"
            },
            {
              "id"  :  "820202",
              "aname"  :  "圣方济各堂区"
            }
          ]
        },
        {
          "id"  :  "820300",
          "name"  :  "无堂区划分区域",
          "area"  :  [
            {
              "id"  :  "820301",
              "aname"  :  "路氹城"
            }
          ]
        }
      ]
    }
  ]
}